[
  {
    "id": "64a9eae8702e197f8afeeaba",
    "name": "Mcconnell Rowland",
    "steps": 66578,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Ponsonby",
        "id": "64a9eae8bcc1c6d284bf9754",
        "description": "Tempor est consequat enim sunt dolor est. Pariatur culpa aute excepteur consequat aute nostrud aute non et. Ex dolor nostrud elit eiusmod ullamco adipisicing. Excepteur velit quis nostrud ex ut nostrud ad amet et eu est officia adipisicing ea. Aute qui enim amet cillum nostrud. Pariatur magna dolore id nisi mollit aliquip dolore.\r\n",
        "time": 71.2761,
        "completed": true,
        "points": 22
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae867e3f2f1dbc670f6",
        "description": "Ea laborum adipisicing ipsum id ea velit id sit ipsum est sunt excepteur anim excepteur. Deserunt anim laborum minim enim consectetur dolor eiusmod sint duis duis exercitation pariatur reprehenderit. Labore amet adipisicing dolor nisi sunt occaecat sunt duis pariatur cillum officia elit.\r\n",
        "time": 54.8997,
        "completed": true,
        "points": 21
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9eae8c41d61a653534d91",
        "description": "Enim aute officia et voluptate nulla est nostrud nostrud elit laborum voluptate deserunt enim. Excepteur excepteur ullamco eu fugiat pariatur. Lorem proident cillum aute dolore officia et magna elit nostrud occaecat et labore quis. Dolore veniam sit ipsum nostrud nulla. Laborum ea laboris dolor fugiat excepteur exercitation in sunt sint excepteur pariatur veniam.\r\n",
        "time": 80.679,
        "completed": true,
        "points": 34
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae87dcae170bdb2424b",
        "description": "Adipisicing id sunt proident anim ex velit. Minim duis adipisicing sint proident reprehenderit exercitation do eu Lorem ea. Tempor cillum tempor nisi officia laboris. Excepteur aliqua irure eu reprehenderit sunt quis minim commodo aliqua sint. Labore nostrud eiusmod mollit anim sunt minim cillum officia est. Laboris elit ipsum ut do voluptate excepteur sint fugiat nulla do enim sunt deserunt deserunt. Minim do anim labore laboris consequat deserunt laborum adipisicing ex labore sint quis fugiat ex.\r\n",
        "time": 188.7606,
        "completed": true,
        "points": 27
      },
      {
        "name": "Maraetai Beach",
        "id": "64a9eae84fcedf50eeda724b",
        "description": "Veniam do ipsum veniam veniam. Sint occaecat occaecat consectetur officia ullamco cillum sint mollit pariatur. Pariatur commodo eiusmod eiusmod aute occaecat exercitation consectetur veniam ea dolore Lorem. Aliqua consequat occaecat et velit occaecat consequat magna ipsum consequat amet quis.\r\n",
        "time": 175.7576,
        "completed": true,
        "points": 51
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae81e2f9beeb46b3721",
        "description": "Consectetur consequat ex fugiat ut adipisicing excepteur. Aute amet excepteur officia non amet aliquip excepteur est velit ea. Esse aute incididunt officia ex. Mollit irure laboris ea ex magna non ullamco tempor.\r\n",
        "time": 137.8173,
        "completed": true,
        "points": 94
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae8ab57be62997f9905",
        "description": "Sunt aute veniam culpa do tempor Lorem. Laborum laboris cillum labore amet. Pariatur deserunt aliqua proident ipsum magna adipisicing consequat quis laboris exercitation. Quis cillum dolor ut officia dolore culpa cillum amet. Incididunt voluptate duis do irure ea incididunt dolore. Commodo dolor dolor laboris dolore cupidatat ut velit veniam magna proident ex.\r\n",
        "time": 97.1194,
        "completed": true,
        "points": 73
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae869a5a9d209e355ff",
        "description": "Exercitation pariatur esse voluptate esse occaecat ex qui mollit ea veniam ullamco velit. Amet consectetur sunt eiusmod proident do occaecat eu. Deserunt pariatur est incididunt reprehenderit ea exercitation veniam incididunt nulla ut cillum irure. Ipsum consequat adipisicing duis minim tempor qui.\r\n",
        "time": 27.8459,
        "completed": true,
        "points": 61
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae84cfbe8a3aee1b10c",
        "description": "Sit in labore cillum sint consectetur exercitation commodo. Reprehenderit voluptate quis aliquip mollit sit cillum ipsum velit. Anim cupidatat dolor tempor excepteur quis. Adipisicing sunt sunt esse ad dolore ad sint laboris. Consequat cillum consectetur est nostrud occaecat occaecat commodo in exercitation Lorem. Est dolor ea deserunt eu exercitation id cillum velit. Et aliqua minim est ullamco sit cupidatat labore sit deserunt excepteur adipisicing ea sunt.\r\n",
        "time": 152.3069,
        "completed": true,
        "points": 30
      }
    ]
  },
  {
    "id": "64a9eae8bfb35bb6ab16d239",
    "name": "Pearl Klein",
    "steps": 11924,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Takapuna Beach",
        "id": "64a9eae824ea30bba0d243cd",
        "description": "Enim reprehenderit enim consequat nostrud proident aliqua eu nisi quis Lorem. Magna nisi consectetur est eiusmod. Qui labore eiusmod proident non mollit. Occaecat commodo culpa deserunt excepteur deserunt fugiat id amet excepteur velit commodo velit ullamco dolor. Ipsum aliquip id occaecat eiusmod. Reprehenderit velit sunt nulla cillum nulla. Id deserunt proident magna est fugiat.\r\n",
        "time": 38.3708,
        "completed": true,
        "points": 86
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9eae87844a4249fce1d4d",
        "description": "Non ipsum reprehenderit fugiat amet magna voluptate proident voluptate non veniam. Est minim minim tempor laboris magna nisi ut nulla minim ea. Enim eu exercitation enim nostrud. Est laboris ut proident ullamco. Ut irure excepteur ex deserunt mollit.\r\n",
        "time": 5.5613,
        "completed": true,
        "points": 16
      },
      {
        "name": "Devonport",
        "id": "64a9eae801e2057ab71cc267",
        "description": "Sunt tempor velit ea dolore voluptate amet esse consequat. Laborum sit cupidatat aute id exercitation ad ullamco ea duis sunt consectetur enim nisi officia. Non deserunt ea irure officia cupidatat nulla culpa qui dolore. Ex magna esse deserunt veniam ullamco esse nisi. Labore labore dolor voluptate laboris id cupidatat eiusmod tempor voluptate minim sint nostrud veniam.\r\n",
        "time": 119.8223,
        "completed": true,
        "points": 63
      },
      {
        "name": "Wynyard Quarter",
        "id": "64a9eae8ff847afa7ed9b33f",
        "description": "Reprehenderit sit in et excepteur. Officia nulla velit sunt laborum ullamco sunt culpa Lorem. Nisi velit ea aliqua veniam nostrud non occaecat.\r\n",
        "time": 112.792,
        "completed": true,
        "points": 18
      },
      {
        "name": "Oneroa",
        "id": "64a9eae851b234287a759c36",
        "description": "Duis id laboris aute consectetur mollit aliqua sint magna ullamco. Amet ut occaecat ut et irure. Eu pariatur veniam irure in eu in cillum cupidatat ea nisi ullamco occaecat ullamco proident. Minim eiusmod velit proident voluptate do laborum duis exercitation ut do labore nulla enim. Reprehenderit est nulla cillum laborum.\r\n",
        "time": 118.7528,
        "completed": true,
        "points": 35
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae8e7746b99490c9045",
        "description": "Tempor sunt voluptate minim eu tempor officia voluptate do cupidatat et cillum sint. Enim id aliquip magna in voluptate elit qui dolore proident consequat. Magna aliquip culpa deserunt eu veniam mollit mollit irure. In ex qui irure occaecat id ut. Enim non anim veniam proident laboris. Ea incididunt sit commodo minim ex anim reprehenderit minim qui occaecat.\r\n",
        "time": 122.2065,
        "completed": true,
        "points": 63
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8832485db945d7414",
        "description": "Officia exercitation enim pariatur et adipisicing. Cillum et consequat elit Lorem quis incididunt. Proident ullamco dolor eiusmod est quis tempor aliqua et do.\r\n",
        "time": 83.3353,
        "completed": true,
        "points": 51
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8298cb63fca4d07a3",
        "description": "Ad pariatur deserunt commodo aliquip laboris id id labore enim ut. Aute velit minim qui et in sit amet est veniam. Eiusmod ipsum adipisicing do occaecat reprehenderit voluptate sunt. Lorem occaecat irure aliqua est qui enim ea esse incididunt. Aliquip cillum sit id dolor.\r\n",
        "time": 135.9825,
        "completed": true,
        "points": 68
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae8486080fa45068f65",
        "description": "Do ad aliqua proident mollit. Aliqua excepteur exercitation eu aliquip occaecat dolor aliquip proident cupidatat. Dolore Lorem id qui pariatur. Occaecat cillum sunt nisi sit est et esse.\r\n",
        "time": 140.3583,
        "completed": true,
        "points": 88
      },
      {
        "name": "Devonport",
        "id": "64a9eae856a35eb1c477ba7a",
        "description": "Sit tempor incididunt non proident ad non aliquip culpa. Pariatur irure velit aute ea laboris minim non ex. Laborum occaecat est nulla nulla velit ex veniam laboris. Minim tempor ullamco in elit duis deserunt tempor labore minim dolore aute ea nisi. Duis nulla laboris dolor nostrud ut.\r\n",
        "time": 19.5302,
        "completed": true,
        "points": 92
      }
    ]
  },
  {
    "id": "64a9eae8918c1bae6f70df70",
    "name": "Osborn Vega",
    "steps": 81890,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Mission Bay",
        "id": "64a9eae84f0a2f9f98efc723",
        "description": "Sint amet labore labore ex esse cillum laborum Lorem laborum. Pariatur nulla adipisicing velit voluptate culpa ad aliqua labore qui tempor laborum. Cillum anim mollit Lorem nostrud eu eiusmod labore enim mollit laborum nisi laborum consequat. Voluptate id incididunt velit ea aliqua proident deserunt ut labore. Est consectetur voluptate adipisicing cillum proident irure aliquip. Elit et exercitation sit occaecat id minim veniam.\r\n",
        "time": 57.775,
        "completed": true,
        "points": 16
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae84adde7ead6afb32b",
        "description": "Incididunt ipsum elit dolor culpa consectetur eiusmod nostrud do excepteur. Officia excepteur aute cillum sunt mollit. Sunt nulla adipisicing commodo commodo nisi incididunt commodo.\r\n",
        "time": 138.8789,
        "completed": true,
        "points": 20
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae8e57df61dcd8263e1",
        "description": "Nostrud cupidatat magna eiusmod nisi consectetur esse quis ad adipisicing. Elit cillum id est commodo minim adipisicing id. Reprehenderit esse est elit ullamco occaecat exercitation cillum enim culpa nulla. Mollit consectetur quis nisi deserunt fugiat enim voluptate deserunt. Ullamco esse incididunt labore in.\r\n",
        "time": 51.903,
        "completed": true,
        "points": 70
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae8466a7e714a30c1a3",
        "description": "Commodo cupidatat irure aliquip ex pariatur elit occaecat ex do ex est enim. Velit amet dolore excepteur elit tempor tempor. Duis do nulla enim reprehenderit veniam amet aliqua enim veniam non veniam dolor. Ullamco commodo veniam nisi culpa reprehenderit do exercitation in adipisicing deserunt. Eiusmod sunt id laboris aliquip sint exercitation eiusmod nostrud eiusmod non. Tempor elit mollit sit occaecat ad voluptate anim. Eiusmod labore esse adipisicing laboris elit qui occaecat exercitation laborum enim quis.\r\n",
        "time": 198.1733,
        "completed": true,
        "points": 97
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae879ae15c3731f5df9",
        "description": "Tempor esse nostrud velit Lorem mollit commodo voluptate. Irure anim amet anim amet mollit. Elit minim pariatur consequat voluptate sunt ad in anim esse est. Laboris qui consectetur commodo id minim. Proident proident aliquip culpa ullamco id. Qui est enim est voluptate exercitation. Velit est sint officia velit sunt esse mollit.\r\n",
        "time": 56.6279,
        "completed": true,
        "points": 46
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae82c9caa5021ddc98d",
        "description": "Ut voluptate elit pariatur eu non duis est in aute pariatur labore duis eu. Ut ea ea officia commodo excepteur eiusmod tempor nostrud tempor dolore ipsum voluptate commodo. Culpa in minim sint id do. Lorem et eu veniam anim veniam qui sunt consequat ullamco cupidatat.\r\n",
        "time": 8.4399,
        "completed": true,
        "points": 81
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae81ededca7c5bf0f60",
        "description": "Dolor elit ullamco consequat duis nulla quis irure cillum labore anim nulla irure. Eiusmod tempor anim laborum officia esse culpa. Velit amet cillum dolore tempor anim minim sit ex dolor magna veniam excepteur eu. Cupidatat magna non fugiat aute consectetur duis voluptate quis labore duis irure pariatur velit non. Irure veniam tempor sit ut. Nisi laborum commodo ullamco commodo adipisicing ipsum voluptate officia dolor.\r\n",
        "time": 75.402,
        "completed": true,
        "points": 65
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae84eee3597fcfdc38c",
        "description": "Excepteur eu cillum amet aliqua ut sit anim. Magna quis officia incididunt dolore duis ea. Esse amet laborum qui proident mollit cupidatat minim eiusmod consequat do in incididunt laboris. Consequat duis est reprehenderit ullamco amet ullamco minim dolore. Cillum reprehenderit aute proident pariatur anim labore qui et incididunt dolore. Reprehenderit laboris dolor proident eiusmod fugiat nulla fugiat nostrud esse ut.\r\n",
        "time": 155.5291,
        "completed": true,
        "points": 47
      },
      {
        "name": "Eden Park",
        "id": "64a9eae8ab9c5b68e130b0eb",
        "description": "Id occaecat quis Lorem irure ad ea dolor tempor magna excepteur reprehenderit. Culpa laboris exercitation tempor dolore eu nisi veniam adipisicing ad veniam. Commodo culpa id fugiat consequat dolor anim occaecat anim nostrud laborum irure veniam nostrud occaecat.\r\n",
        "time": 135.799,
        "completed": true,
        "points": 71
      }
    ]
  },
  {
    "id": "64a9eae8722a2dbfdfcdfb4e",
    "name": "Wall Bryant",
    "steps": 19745,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Silo Park",
        "id": "64a9eae845cfe684d2ef9790",
        "description": "Mollit commodo proident dolore eu reprehenderit. Elit reprehenderit fugiat sunt deserunt tempor et aliquip culpa magna officia anim tempor enim voluptate. Quis ea consequat aute est excepteur velit aliquip adipisicing minim sit Lorem exercitation. Ea fugiat in est non tempor adipisicing enim ipsum ullamco duis cupidatat. Tempor dolore veniam ex culpa.\r\n",
        "time": 174.5742,
        "completed": true,
        "points": 30
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae8dc32cb7d0d8509fb",
        "description": "Elit sunt ipsum labore nostrud nisi et eiusmod mollit minim aute ea culpa deserunt ullamco. Irure duis nulla irure fugiat labore sint nulla sit. Cillum adipisicing velit in anim consectetur occaecat. Ipsum officia ad laboris ad dolor nulla fugiat laboris est veniam non. Esse deserunt anim voluptate culpa elit cupidatat ad et aliquip Lorem.\r\n",
        "time": 184.0651,
        "completed": true,
        "points": 65
      },
      {
        "name": "Hunua Falls",
        "id": "64a9eae8b7c6a32ee036a1b9",
        "description": "Eiusmod non est exercitation nisi et nostrud reprehenderit do enim proident elit mollit. Est sit consequat sit aliqua nisi id deserunt occaecat consequat. Ad proident amet nisi ut ea proident officia laboris irure culpa nisi do veniam. Consequat eu non eu Lorem qui esse. Veniam et voluptate dolore commodo nostrud anim reprehenderit mollit excepteur. Ex ad ex aliquip pariatur ea Lorem.\r\n",
        "time": 158.2554,
        "completed": true,
        "points": 12
      },
      {
        "name": "Silo Park",
        "id": "64a9eae8aa8a572e402f75b9",
        "description": "Lorem aliqua et tempor occaecat ipsum tempor. Incididunt proident do consectetur duis cillum. Duis aliquip culpa esse aliquip aliquip occaecat Lorem. Irure ipsum esse qui commodo duis fugiat excepteur mollit commodo consectetur.\r\n",
        "time": 162.9878,
        "completed": true,
        "points": 42
      },
      {
        "name": "Karekare",
        "id": "64a9eae8025a64fe85b15b8d",
        "description": "Laborum dolor elit ad incididunt consectetur eiusmod enim dolore adipisicing nostrud ea laborum. Nulla quis nostrud culpa aute dolore ex voluptate. Occaecat amet amet ut est reprehenderit officia ea qui est laborum ad.\r\n",
        "time": 126.9811,
        "completed": true,
        "points": 78
      },
      {
        "name": "Parnell",
        "id": "64a9eae822ea6bff5a691822",
        "description": "Magna aliquip eu ea occaecat Lorem ex incididunt labore minim aliqua voluptate enim Lorem. Magna irure adipisicing exercitation enim dolor eu est qui ea reprehenderit sint sunt labore elit. Cillum anim eiusmod occaecat duis culpa eu nulla. Nisi reprehenderit et reprehenderit sunt eu commodo nostrud.\r\n",
        "time": 93.0555,
        "completed": true,
        "points": 84
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae83280018be58e9be2",
        "description": "Mollit id esse aute voluptate excepteur tempor eu ad. Cillum ipsum in laboris amet amet eu consectetur Lorem laborum Lorem laboris labore. Est do dolor nostrud aliquip et. Proident excepteur deserunt do anim pariatur non ad duis eiusmod ad deserunt aliqua nisi. Laboris reprehenderit minim aliquip culpa esse officia ea id cillum velit. Elit ut ex laboris et adipisicing commodo incididunt velit reprehenderit est cillum nisi.\r\n",
        "time": 7.2739,
        "completed": true,
        "points": 46
      },
      {
        "name": "Queen Street",
        "id": "64a9eae85cc6403328bb13e2",
        "description": "Velit labore sint dolore deserunt cupidatat laboris fugiat esse minim. Non ea ullamco ut anim ad ullamco irure duis esse. Ad laborum ipsum non culpa eu sint mollit.\r\n",
        "time": 176.1892,
        "completed": true,
        "points": 92
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae8a52c840add668176",
        "description": "Occaecat do reprehenderit commodo mollit ut irure dolore officia quis ea id. Et et occaecat consectetur laborum Lorem cillum. Proident nulla commodo nostrud do esse est proident magna eiusmod nisi ut. Pariatur officia sit nulla amet esse aliqua pariatur irure et sunt amet irure. Est incididunt adipisicing dolore voluptate irure cillum aliqua minim.\r\n",
        "time": 173.4075,
        "completed": true,
        "points": 16
      },
      {
        "name": "Silo Park",
        "id": "64a9eae8cdefdc49df4eb4a0",
        "description": "Sunt commodo id eiusmod deserunt est nulla cillum consectetur amet est excepteur consectetur est sint. Id ut dolor est ipsum est aliquip laboris ipsum qui. Eu laboris laborum et reprehenderit tempor magna id magna esse consequat. Sint incididunt excepteur commodo cupidatat proident proident ex.\r\n",
        "time": 161.0557,
        "completed": true,
        "points": 21
      }
    ]
  },
  {
    "id": "64a9eae8557edde50148d141",
    "name": "Anna Michael",
    "steps": 59049,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Sky Tower",
        "id": "64a9eae826aaec3a10f4b52b",
        "description": "Commodo nisi cupidatat ut proident ex fugiat occaecat ad pariatur Lorem et incididunt eu exercitation. Nostrud laborum fugiat sint non. Magna ex ad eu officia anim fugiat pariatur excepteur reprehenderit do officia. In veniam adipisicing aute culpa aliquip velit. Minim voluptate aliqua dolor Lorem nisi irure consectetur qui ullamco. Nostrud exercitation laborum do veniam quis culpa sunt commodo consectetur proident qui eu eu anim.\r\n",
        "time": 157.572,
        "completed": true,
        "points": 69
      },
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9eae89aa3eb1b0ae35cc5",
        "description": "Labore aliquip enim ullamco mollit anim id veniam reprehenderit occaecat amet nisi exercitation veniam nostrud. Dolore duis pariatur incididunt sint fugiat enim laboris sit qui incididunt sit proident adipisicing. Ex nostrud sint aliqua consectetur labore. Cillum culpa magna elit irure laborum occaecat tempor reprehenderit. Aliquip laboris laborum magna proident duis consectetur nulla.\r\n",
        "time": 39.7441,
        "completed": true,
        "points": 68
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9eae8bb6accbd1139ecda",
        "description": "Ad et consectetur occaecat ipsum sint cillum. Ex Lorem sit ex occaecat sunt quis. Minim mollit labore laboris ipsum. Ex aute adipisicing sit laboris non cupidatat aliquip officia quis aliqua nisi laborum adipisicing. Ex anim ipsum laborum esse est elit ullamco.\r\n",
        "time": 33.8977,
        "completed": true,
        "points": 90
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9eae89dd67863fb4f509c",
        "description": "Eu ex consequat amet dolore consectetur id sunt incididunt aliqua deserunt amet laborum laborum. Sint reprehenderit occaecat qui dolore proident pariatur ea magna. Ea non et reprehenderit dolore est quis quis cillum minim mollit cupidatat id cillum exercitation.\r\n",
        "time": 136.0552,
        "completed": true,
        "points": 14
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae8c71c4908ceb93322",
        "description": "Est est aliquip excepteur pariatur qui exercitation enim. Ut consectetur ex ut nisi excepteur velit id ex eu. Consectetur duis esse velit fugiat do veniam voluptate. Elit qui incididunt eiusmod laboris.\r\n",
        "time": 56.5488,
        "completed": true,
        "points": 36
      },
      {
        "name": "Karekare",
        "id": "64a9eae81c1bdce9498206fe",
        "description": "In ullamco in ipsum est dolore adipisicing quis. Eiusmod cillum dolore ea pariatur anim dolor sint ad eiusmod ipsum. Laboris duis eu veniam Lorem culpa cillum proident incididunt aliquip ea irure dolor sunt veniam. Occaecat qui aute velit eiusmod Lorem dolor quis aliquip ullamco nulla. Duis nulla do dolor reprehenderit eiusmod consequat ad qui eu exercitation enim.\r\n",
        "time": 27.4615,
        "completed": true,
        "points": 37
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae8ccad86dbf5895b22",
        "description": "Enim eiusmod amet pariatur adipisicing exercitation velit deserunt fugiat cupidatat commodo fugiat ipsum occaecat. Tempor sint sint deserunt excepteur ipsum fugiat dolore ea labore dolor occaecat excepteur mollit amet. Cillum ut commodo minim incididunt sint ad incididunt nulla et nisi mollit excepteur. Ullamco sint proident ut et ut cupidatat anim aute mollit culpa. Tempor elit non id culpa duis sit nisi ea minim eiusmod.\r\n",
        "time": 128.4205,
        "completed": true,
        "points": 15
      },
      {
        "name": "Devonport",
        "id": "64a9eae82c764385f5217a65",
        "description": "Adipisicing nisi velit ad id esse est ad Lorem aliquip. Elit id aliquip anim non labore mollit est irure. Aliquip voluptate sint commodo laboris minim. Incididunt nostrud aute proident id aliquip enim nulla non. Consequat qui minim anim aute amet consectetur sit. Commodo ea labore ullamco dolor est laborum. Aute laboris veniam veniam veniam ad sit elit sit esse velit velit laborum culpa non.\r\n",
        "time": 11.0188,
        "completed": true,
        "points": 75
      }
    ]
  },
  {
    "id": "64a9eae83a76d301a00a815c",
    "name": "Theresa Lindsay",
    "steps": 30464,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae85e1bc199ff21f3f7",
        "description": "Duis sint et minim laboris cupidatat aliquip magna sit commodo quis deserunt ipsum elit exercitation. Eiusmod voluptate eu occaecat ipsum ea excepteur ut dolore id. Ad nulla exercitation pariatur est anim enim Lorem velit ipsum ut nisi commodo aliquip et. Ad magna in proident proident anim do occaecat velit ex ex nisi voluptate dolore. Laborum mollit aliquip fugiat nostrud occaecat.\r\n",
        "time": 20.2355,
        "completed": true,
        "points": 12
      },
      {
        "name": "Takapuna",
        "id": "64a9eae813172240c356cf56",
        "description": "Amet culpa esse exercitation magna non consectetur ea proident velit officia velit. Mollit adipisicing quis deserunt id laborum incididunt amet incididunt. Nisi minim cupidatat officia laboris id ad nostrud sunt.\r\n",
        "time": 57.8092,
        "completed": true,
        "points": 37
      },
      {
        "name": "Auckland Domain",
        "id": "64a9eae862d8a4ec2ddaad00",
        "description": "Do excepteur incididunt qui ut consequat in excepteur et esse nulla. Veniam commodo cupidatat laborum consectetur voluptate consequat. Aute consequat ut excepteur ut quis tempor labore do adipisicing dolore laborum elit tempor Lorem. Aliquip nostrud excepteur consequat est ad culpa officia ex. Nostrud incididunt ipsum laborum dolore excepteur labore nostrud ut ullamco fugiat eu Lorem sint. Consectetur reprehenderit aliqua occaecat magna magna officia minim.\r\n",
        "time": 161.194,
        "completed": true,
        "points": 18
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae8b2db5048a4492e58",
        "description": "Cillum laborum culpa commodo laborum aliquip nulla. Sunt qui amet incididunt consequat ea magna eu veniam id. Ea nostrud incididunt enim ut.\r\n",
        "time": 186.1389,
        "completed": true,
        "points": 64
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae8e525e2d690459c4c",
        "description": "Deserunt nulla sit eu labore laboris enim tempor minim laborum Lorem consequat voluptate. Lorem in sunt consectetur deserunt non anim nostrud fugiat consequat aliqua officia anim exercitation laborum. Amet consequat laborum quis anim commodo incididunt et pariatur duis ea commodo. Deserunt cupidatat elit labore deserunt Lorem ullamco dolore consequat. Eiusmod adipisicing culpa proident occaecat anim non eiusmod enim adipisicing et ipsum incididunt amet.\r\n",
        "time": 157.8197,
        "completed": true,
        "points": 45
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8664f8f395a8d9528",
        "description": "Sint minim nostrud ullamco adipisicing adipisicing mollit irure culpa excepteur tempor. Sunt amet laboris deserunt in minim est labore duis sunt exercitation dolore. Ex tempor laboris est reprehenderit sint anim non aliqua aliqua excepteur incididunt officia aliquip. Dolor occaecat id elit occaecat nostrud quis aute.\r\n",
        "time": 132.622,
        "completed": true,
        "points": 38
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae81a38b5469f178149",
        "description": "Ipsum cillum minim qui dolore occaecat est officia magna ad aliqua cupidatat aliquip et. Qui mollit commodo voluptate id quis veniam ea occaecat fugiat non. Est nostrud ad mollit ad ad aliquip quis commodo pariatur occaecat ad. Lorem irure incididunt ea nisi. Do eiusmod laboris dolore aute adipisicing ut pariatur. Eu eu ad cupidatat sit pariatur excepteur et aliqua consequat reprehenderit dolor ex. Commodo commodo labore fugiat deserunt.\r\n",
        "time": 177.8178,
        "completed": true,
        "points": 63
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9eae8b9db410b2905973f",
        "description": "Excepteur cupidatat deserunt Lorem ea aute amet ea consequat do adipisicing ad in. Sunt enim ad aliqua adipisicing esse in est ullamco in. Aliqua consectetur quis mollit sunt ad veniam Lorem tempor nisi in.\r\n",
        "time": 101.6704,
        "completed": true,
        "points": 54
      },
      {
        "name": "Kawau Island",
        "id": "64a9eae82e4065fb29084263",
        "description": "Mollit ex mollit aliquip consectetur id voluptate. Aliqua commodo ullamco cillum Lorem. Cillum et commodo nisi cillum veniam et laborum dolore exercitation irure mollit. Cillum duis proident fugiat Lorem duis officia consectetur irure. Irure officia enim amet labore fugiat sit occaecat elit occaecat in anim in consectetur. Laborum commodo nulla esse in incididunt pariatur adipisicing elit. Laboris proident velit laborum eiusmod minim sunt ex eu.\r\n",
        "time": 33.5624,
        "completed": true,
        "points": 14
      },
      {
        "name": "Oneroa",
        "id": "64a9eae89294496029b42f87",
        "description": "Aute enim qui esse veniam aliquip. Minim cupidatat non veniam aliquip non eiusmod. Cupidatat duis et dolor labore duis ullamco non aliquip ipsum consequat. Ut id est irure amet ea labore aliquip. Fugiat consequat incididunt officia nulla qui culpa nostrud irure amet consectetur.\r\n",
        "time": 7.5023,
        "completed": true,
        "points": 44
      }
    ]
  },
  {
    "id": "64a9eae876766105d7f76c37",
    "name": "Freeman Rich",
    "steps": 63276,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae8d07e3b5e03b63803",
        "description": "Laborum eiusmod sunt nulla ullamco sit Lorem. Occaecat aute proident nulla veniam quis nostrud adipisicing eu nulla consectetur. Eiusmod Lorem do dolore velit reprehenderit laboris ad quis duis nisi enim nulla cillum officia. Voluptate aliquip aute voluptate anim ullamco ipsum non duis.\r\n",
        "time": 59.5426,
        "completed": true,
        "points": 89
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9eae8fb1e1efe9982aa87",
        "description": "Reprehenderit mollit voluptate commodo reprehenderit in nulla velit ad ut. Nisi do laboris culpa cupidatat fugiat et occaecat excepteur nulla consequat sint sunt sunt velit. Aliquip incididunt eiusmod ex quis laboris laborum tempor ullamco proident. Fugiat labore nostrud ut occaecat anim duis commodo non et ea dolor Lorem. Nisi minim aute dolor eiusmod fugiat. Excepteur officia dolore velit consectetur non ut adipisicing sunt incididunt labore cupidatat magna. Occaecat excepteur excepteur fugiat labore pariatur officia cupidatat laborum do irure aliqua minim.\r\n",
        "time": 126.2964,
        "completed": true,
        "points": 26
      },
      {
        "name": "Eden Park",
        "id": "64a9eae8f727629753c39d13",
        "description": "Pariatur dolore incididunt consectetur proident. Non labore sint proident esse enim occaecat adipisicing nulla commodo. Aute magna ullamco ullamco irure ad sint consequat qui consequat do occaecat minim qui. Duis esse duis aliqua ut minim in quis exercitation. Magna laborum do ipsum sint commodo. Pariatur non proident cillum consectetur aliquip veniam et non sit consectetur. Nostrud laboris Lorem voluptate est minim dolor laborum dolore deserunt ex excepteur.\r\n",
        "time": 122.4658,
        "completed": true,
        "points": 69
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae864aa82737446a93b",
        "description": "Excepteur commodo enim veniam adipisicing do elit reprehenderit fugiat ex ullamco cillum. Cupidatat id commodo enim reprehenderit commodo irure eiusmod consectetur ipsum ipsum consectetur adipisicing. Quis aliqua irure aliquip labore. Exercitation qui non dolore enim. Esse labore ut nisi nulla voluptate id pariatur sint enim aliquip. Voluptate reprehenderit labore do qui aliquip proident mollit nulla minim dolor.\r\n",
        "time": 69.2915,
        "completed": true,
        "points": 69
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8b072a579a41a5b5f",
        "description": "Amet nostrud laborum voluptate nostrud occaecat magna ullamco incididunt laboris. Nostrud elit aute fugiat ex esse reprehenderit culpa tempor et incididunt do do laborum. Pariatur ullamco magna laborum fugiat minim ex non. Labore duis ipsum excepteur ut incididunt deserunt enim mollit ea dolore labore aliquip qui. Voluptate incididunt aute adipisicing in nisi ullamco aliquip voluptate voluptate ut.\r\n",
        "time": 126.7385,
        "completed": true,
        "points": 78
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9eae856c865c482f6d83b",
        "description": "Amet anim exercitation velit dolor in nostrud deserunt consectetur. Et elit do commodo Lorem pariatur occaecat exercitation Lorem laboris cupidatat ea irure. Ea irure enim ipsum cillum adipisicing et. Nostrud mollit non enim elit nulla cillum ut qui deserunt sunt id duis cupidatat.\r\n",
        "time": 44.3121,
        "completed": true,
        "points": 85
      },
      {
        "name": "Devonport",
        "id": "64a9eae8a7e5d206ad4a69ce",
        "description": "Exercitation mollit culpa incididunt est. Veniam labore duis anim aliqua irure pariatur reprehenderit adipisicing sunt. Id ullamco dolor deserunt aliquip aliqua incididunt exercitation ex nulla. Sit ad ullamco aute aliqua veniam adipisicing deserunt laborum culpa qui officia. Sit minim ullamco tempor aute. Velit deserunt officia incididunt eiusmod officia ea laboris consequat cupidatat. Sint anim quis et nostrud voluptate do aliqua sunt.\r\n",
        "time": 95.3817,
        "completed": true,
        "points": 89
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae8aa8e51f6a370d7ab",
        "description": "Ex veniam aliquip nulla occaecat ut ad eu excepteur qui. Sint pariatur et ex in et ipsum tempor consectetur cillum. Labore nulla ullamco officia anim mollit irure aliquip ullamco commodo Lorem sunt aliquip proident cillum. Eu anim eu esse qui excepteur ut consectetur et tempor ex mollit id in. Pariatur magna ad sit non. Adipisicing anim culpa dolore elit dolore nostrud commodo sint id tempor in quis. Aliqua nostrud aute incididunt pariatur.\r\n",
        "time": 91.4075,
        "completed": true,
        "points": 64
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae81612beef73c672f6",
        "description": "Id anim veniam minim esse nulla mollit minim id ad amet consequat non anim exercitation. Id deserunt consectetur id aute ex cupidatat quis mollit. Consequat commodo aute do adipisicing elit aliquip incididunt ex Lorem voluptate cupidatat. Do excepteur sit commodo veniam non pariatur commodo cupidatat cupidatat minim consectetur deserunt. Mollit anim nostrud consectetur commodo eiusmod do consequat pariatur laborum laborum. Reprehenderit velit ex deserunt ad. Id cillum adipisicing qui ea amet eiusmod ipsum.\r\n",
        "time": 82.5733,
        "completed": true,
        "points": 87
      }
    ]
  },
  {
    "id": "64a9eae841f369ca2a132a7e",
    "name": "Ingrid Burch",
    "steps": 65869,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae8ab7fea884861ae22",
        "description": "Cillum anim ad cupidatat ut dolor reprehenderit. Incididunt ad labore sunt voluptate officia excepteur in Lorem eu minim ad laboris. Velit sint est enim aliquip ex pariatur ex. Eu excepteur aute quis dolor consectetur culpa proident velit esse eu. Proident ex qui enim nisi ut sunt aliquip reprehenderit occaecat ut amet sit. Dolor reprehenderit magna velit enim cillum id tempor qui mollit eiusmod velit nulla ut. Duis est occaecat ipsum qui laborum excepteur aliqua culpa magna.\r\n",
        "time": 197.1071,
        "completed": true,
        "points": 49
      },
      {
        "name": "Auckland Domain",
        "id": "64a9eae8db729034c6733214",
        "description": "Ad minim cillum occaecat nostrud pariatur fugiat anim nisi laborum adipisicing. Eiusmod pariatur nostrud velit veniam eiusmod magna consectetur anim amet. Quis veniam non cillum incididunt pariatur eiusmod veniam enim adipisicing ea nostrud adipisicing duis ex. Cupidatat enim irure id do sint. Sit magna fugiat culpa ipsum deserunt fugiat labore sint exercitation occaecat. Irure pariatur esse labore mollit cillum occaecat in consectetur cupidatat id ex proident minim dolor. Ut laborum nisi eu occaecat et aute cillum consectetur est do voluptate mollit deserunt.\r\n",
        "time": 94.728,
        "completed": true,
        "points": 52
      },
      {
        "name": "Wynyard Quarter",
        "id": "64a9eae8bfb1212517d2dd95",
        "description": "Veniam ad magna aliqua mollit excepteur. Quis elit dolor sit sit nulla anim. Consequat aliquip irure eu enim ullamco consequat anim anim irure eu dolor elit Lorem irure. Pariatur Lorem aute nisi nulla ipsum in duis. Labore minim Lorem ad ipsum est consequat ea officia sunt pariatur officia anim pariatur. Anim ullamco adipisicing laboris velit in.\r\n",
        "time": 181.6033,
        "completed": true,
        "points": 96
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae89661c3f5be312e4f",
        "description": "Nulla incididunt voluptate cupidatat elit deserunt cillum ut proident. In laborum quis proident dolore. Magna ullamco eu cupidatat labore consequat. Laboris ea sit consequat est. Ut ex occaecat ut enim proident eiusmod sunt officia fugiat minim incididunt non incididunt culpa. Velit excepteur ea laborum fugiat laboris.\r\n",
        "time": 9.3088,
        "completed": true,
        "points": 25
      },
      {
        "name": "Silo Park",
        "id": "64a9eae8c4308ed4e773c28b",
        "description": "Amet consectetur sunt esse dolore ad officia do veniam. Ad sit enim irure veniam incididunt nisi pariatur ipsum enim exercitation aliquip consequat ea enim. Aliqua non voluptate reprehenderit anim ipsum commodo culpa exercitation dolor excepteur culpa sunt cillum mollit. Excepteur nostrud elit officia excepteur irure consectetur amet qui. Excepteur exercitation enim adipisicing officia non mollit nulla consectetur est nulla tempor. Pariatur ex nostrud dolore nostrud elit occaecat sint excepteur dolore. Occaecat qui ad ipsum nisi ea officia laboris esse est cillum Lorem aute.\r\n",
        "time": 190.114,
        "completed": true,
        "points": 45
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae82b0881baaae49651",
        "description": "Irure id veniam esse reprehenderit proident enim mollit Lorem excepteur. Sunt nostrud eu qui eu ex elit consectetur. Aliqua laboris proident dolore esse ut esse minim tempor nulla enim dolore nostrud ex. Eu Lorem enim ea ea minim in nulla. Sunt ullamco elit voluptate ullamco labore laboris laborum esse. Nulla officia sunt amet irure. Culpa et elit amet adipisicing officia anim fugiat ex ut.\r\n",
        "time": 112.9706,
        "completed": true,
        "points": 93
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9eae85832add3ec709374",
        "description": "Aute dolor cupidatat qui et cupidatat sit proident officia magna tempor anim commodo sint consectetur. Nostrud velit labore duis id cupidatat consectetur commodo adipisicing et cupidatat exercitation proident. Sunt aliqua labore sint sint nulla adipisicing consequat.\r\n",
        "time": 198.8178,
        "completed": true,
        "points": 65
      },
      {
        "name": "Parnell",
        "id": "64a9eae8c12839052868ea4f",
        "description": "Minim qui ex exercitation consectetur nulla cillum adipisicing aliquip esse. Nulla excepteur sunt est cillum et eu do est. Sunt ullamco anim magna ipsum tempor quis pariatur velit amet excepteur minim incididunt velit. Nisi laborum ex proident veniam dolore sint anim ex ex nulla.\r\n",
        "time": 3.9701,
        "completed": true,
        "points": 61
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae8cbc668554ccb3948",
        "description": "Cupidatat sunt magna velit culpa pariatur non dolore. Est cillum occaecat occaecat tempor ad. Sit aliqua nisi fugiat excepteur proident irure aliquip tempor do velit. Ut esse velit et ex sunt non culpa minim anim fugiat nisi aliquip commodo. Commodo sint aliqua irure voluptate excepteur.\r\n",
        "time": 191.0837,
        "completed": true,
        "points": 60
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9eae88ae6f85ddf1d2dce",
        "description": "Elit proident ipsum reprehenderit sunt cillum est est elit et ipsum. Amet eiusmod minim labore nisi veniam consectetur. Pariatur Lorem incididunt voluptate reprehenderit tempor amet dolore aliqua excepteur commodo ipsum ex Lorem irure. Tempor aliquip sunt proident Lorem ipsum labore id exercitation consequat pariatur laborum id veniam.\r\n",
        "time": 104.6016,
        "completed": true,
        "points": 58
      }
    ]
  },
  {
    "id": "64a9eae82d9f918cd107b826",
    "name": "Mills Poole",
    "steps": 98736,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Karekare",
        "id": "64a9eae819b56cffbf8de2ce",
        "description": "Et dolore laborum voluptate ipsum eu minim nostrud incididunt. Ipsum non adipisicing id nostrud cillum aliquip consequat. Deserunt dolor anim Lorem cillum eu deserunt ut. Nostrud ipsum aliquip velit irure proident enim enim incididunt.\r\n",
        "time": 176.9751,
        "completed": true,
        "points": 10
      },
      {
        "name": "Mount Eden",
        "id": "64a9eae81efb4dbb27b01d9c",
        "description": "Labore mollit dolore eiusmod commodo fugiat ex occaecat. Quis pariatur aliqua nisi culpa non magna voluptate aliqua nostrud. Eu deserunt velit do dolor ullamco consequat. Cillum est minim Lorem laborum. Amet pariatur proident ullamco exercitation sit ut proident anim dolor voluptate Lorem.\r\n",
        "time": 78.2553,
        "completed": true,
        "points": 58
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae81c494cafab33747d",
        "description": "Ipsum esse officia elit duis eiusmod Lorem nostrud voluptate labore veniam aliquip consequat mollit et. Excepteur duis id occaecat dolore consectetur anim exercitation veniam sit nulla elit dolor. Lorem nulla voluptate in aliquip consectetur ipsum sit quis eu in ipsum non magna qui.\r\n",
        "time": 18.2233,
        "completed": true,
        "points": 87
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9eae8edbb7af9d5f879cb",
        "description": "Dolor dolore sit deserunt magna ex officia laborum exercitation dolor proident. Non quis mollit sint laborum. Excepteur ad in occaecat officia amet sint occaecat tempor deserunt do. Non laboris tempor officia tempor veniam sunt ullamco dolore pariatur dolore ut. Fugiat irure minim amet minim exercitation reprehenderit sit irure. Ipsum reprehenderit consectetur aliqua deserunt commodo veniam cupidatat.\r\n",
        "time": 53.2545,
        "completed": true,
        "points": 57
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9eae814b1373ddf38e8fb",
        "description": "Aute sint consequat ea cupidatat ipsum minim incididunt. Mollit dolor ad est eu dolor cillum Lorem aute. Nulla cillum in enim ullamco dolor elit irure culpa dolore magna proident. Cupidatat ex exercitation sint proident nisi eu incididunt do occaecat officia cupidatat cillum reprehenderit.\r\n",
        "time": 37.2157,
        "completed": true,
        "points": 74
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae847a8b441c17db67d",
        "description": "Dolor non ut ad eu eu cillum. Nulla incididunt exercitation qui sint ad officia pariatur est magna proident. Tempor veniam aliqua deserunt non nulla laborum in laboris non velit. Laborum commodo veniam reprehenderit ea ex fugiat occaecat ea nisi incididunt.\r\n",
        "time": 164.6864,
        "completed": true,
        "points": 45
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8e3446b603448d284",
        "description": "Incididunt nulla minim dolore Lorem reprehenderit voluptate veniam reprehenderit laborum ut et sunt non. Laboris do non cillum sit laboris culpa duis. Do quis in ipsum laborum irure elit nostrud dolore elit incididunt adipisicing. Cupidatat cillum nostrud eiusmod sit.\r\n",
        "time": 35.6043,
        "completed": true,
        "points": 95
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae8693d8e7414e79992",
        "description": "Ex in exercitation ex in dolore magna ad. Ad nostrud ipsum eiusmod dolor esse eu fugiat pariatur proident. Dolore minim adipisicing est exercitation nisi non proident sint sit incididunt aute. Veniam elit ad mollit duis nostrud adipisicing dolor sit pariatur proident aute dolore in.\r\n",
        "time": 199.1337,
        "completed": true,
        "points": 58
      },
      {
        "name": "Waiheke Island",
        "id": "64a9eae88e06eb18b6d9f89d",
        "description": "Pariatur nulla laboris minim nisi amet nostrud ex nostrud occaecat est incididunt. Commodo commodo minim ipsum cillum veniam aliquip sunt anim. Sunt exercitation proident exercitation consectetur. Deserunt occaecat qui in minim minim eu quis ea. Do commodo ipsum laboris do laboris in est aliquip tempor consectetur magna voluptate irure.\r\n",
        "time": 165.0682,
        "completed": true,
        "points": 91
      }
    ]
  },
  {
    "id": "64a9eae8afe9cf0d20e1c553",
    "name": "Ladonna Webb",
    "steps": 19827,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Aotea Square",
        "id": "64a9eae872e406caf504864a",
        "description": "Occaecat nulla minim Lorem consectetur quis in consectetur proident. Laboris officia aliqua ut pariatur. Incididunt deserunt velit cupidatat pariatur voluptate. Quis ad officia eiusmod cupidatat labore occaecat.\r\n",
        "time": 160.292,
        "completed": true,
        "points": 85
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9eae899a39cec33998de6",
        "description": "Nostrud laboris nostrud eu excepteur sit mollit culpa qui dolore magna officia velit incididunt velit. Aute enim ipsum cillum culpa sint anim sunt minim dolore ut est. Ea reprehenderit cillum labore laboris aliquip aute ex dolore laboris enim dolor do deserunt magna. Sunt culpa ipsum ex reprehenderit occaecat et in ipsum minim consequat. Ipsum consectetur in magna proident laboris qui fugiat do sit.\r\n",
        "time": 67.9404,
        "completed": true,
        "points": 39
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae82c30575e94de6f6a",
        "description": "Irure incididunt sit adipisicing incididunt officia aute excepteur commodo ex. Sit nisi consectetur culpa velit consequat eu voluptate. Dolor adipisicing sint proident aliquip minim elit. Duis occaecat ea duis dolor aliqua excepteur qui. Deserunt laborum do reprehenderit aute fugiat id. Sit ad qui voluptate ad nostrud. In nulla duis commodo velit dolore pariatur eu.\r\n",
        "time": 96.8455,
        "completed": true,
        "points": 34
      },
      {
        "name": "Mount Eden",
        "id": "64a9eae8f16d6b31ee24d18f",
        "description": "Aute non Lorem officia elit voluptate. In eu nisi exercitation incididunt deserunt culpa duis. Voluptate non sit quis dolore ullamco irure officia fugiat magna exercitation occaecat. Dolor ullamco commodo elit officia cupidatat dolor consequat.\r\n",
        "time": 130.0248,
        "completed": true,
        "points": 83
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae8df18914cdd42339e",
        "description": "Consequat qui consectetur deserunt consectetur. Reprehenderit adipisicing in deserunt fugiat laborum ut cupidatat. Culpa occaecat esse voluptate esse eu sint amet culpa. Ullamco ullamco ad occaecat deserunt est do occaecat et cupidatat non. Id ipsum magna ut aute est.\r\n",
        "time": 71.6748,
        "completed": true,
        "points": 59
      },
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9eae802ee084df083d77e",
        "description": "Eiusmod exercitation velit enim ipsum eiusmod reprehenderit ea cillum tempor voluptate ipsum aliqua. Ipsum est id consequat tempor nostrud adipisicing anim sit consectetur et irure eiusmod duis. Mollit proident sit fugiat proident. Qui in eu do ipsum nostrud labore consequat dolore.\r\n",
        "time": 186.4045,
        "completed": true,
        "points": 39
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae89798be2cb7c4d881",
        "description": "Velit exercitation laborum magna et elit. Excepteur irure cupidatat cillum eiusmod ullamco. Nisi fugiat enim consectetur ea dolor pariatur in amet exercitation aliqua.\r\n",
        "time": 162.1714,
        "completed": true,
        "points": 79
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9eae8aa230aa3d7a67c69",
        "description": "Ipsum enim et proident dolor. Deserunt laborum tempor minim nulla consectetur labore culpa duis elit et dolore laboris elit laboris. Proident est consequat irure exercitation Lorem eiusmod. Labore quis veniam sunt reprehenderit deserunt esse. Id nulla adipisicing ipsum consequat occaecat aliquip eiusmod ex elit enim laborum veniam.\r\n",
        "time": 8.9032,
        "completed": true,
        "points": 23
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae85d969d69bb4db7a1",
        "description": "Deserunt minim esse eu Lorem exercitation culpa irure sint exercitation officia aliqua. Duis nisi commodo incididunt duis do velit duis. Nulla ex eu commodo duis fugiat ad commodo do occaecat exercitation duis exercitation anim sunt. Culpa nostrud incididunt minim dolor non veniam proident commodo Lorem ut pariatur sit exercitation ut. Labore ipsum qui id Lorem irure. Ut sint fugiat cillum duis deserunt ex consectetur.\r\n",
        "time": 130.4148,
        "completed": true,
        "points": 95
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae865baa28d360a77b4",
        "description": "In sunt Lorem est quis est laboris eu nulla anim ea culpa. Non commodo mollit ex sint consequat. Ut aliqua laboris aliqua excepteur culpa do adipisicing consequat in ipsum.\r\n",
        "time": 7.9099,
        "completed": true,
        "points": 58
      }
    ]
  },
  {
    "id": "64a9eae8c67b7a947b656117",
    "name": "Francine Compton",
    "steps": 63663,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Matakana",
        "id": "64a9eae88c775b5d08c18353",
        "description": "Eiusmod pariatur officia exercitation esse. Sit incididunt adipisicing non labore exercitation enim ex ipsum minim sint dolore. Laboris Lorem id reprehenderit et nisi cupidatat consequat ullamco magna occaecat pariatur. Id est proident sunt laboris sunt mollit. Consequat nisi sint qui tempor.\r\n",
        "time": 36.6525,
        "completed": true,
        "points": 46
      },
      {
        "name": "Hunua Falls",
        "id": "64a9eae86b530e2ffc58473a",
        "description": "Laborum est non eu elit ipsum aliqua ea dolor incididunt magna sunt tempor sint laboris. Qui id exercitation tempor Lorem. Occaecat do qui consequat ipsum laborum in dolore ad irure eiusmod elit. Deserunt aliqua consectetur do minim enim anim et sint id mollit sint sunt laborum.\r\n",
        "time": 80.0883,
        "completed": true,
        "points": 99
      },
      {
        "name": "Maraetai Beach",
        "id": "64a9eae8ef00ec75138dc62f",
        "description": "Et ex tempor ipsum dolore culpa voluptate ex id duis. Consequat sit sit cupidatat non in nisi. Aliqua culpa officia culpa magna officia. Eu ipsum commodo et minim elit ut eiusmod pariatur duis anim nisi enim pariatur deserunt. Sunt voluptate sunt enim laboris non Lorem occaecat anim non consequat. Esse deserunt non in tempor quis nisi duis labore incididunt anim est.\r\n",
        "time": 21.4421,
        "completed": true,
        "points": 24
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae86729c63428c9822c",
        "description": "Irure pariatur esse occaecat nisi reprehenderit officia in velit sunt consequat. Sit labore minim aute ad velit elit laboris ullamco duis. Nisi et esse tempor fugiat ipsum ullamco dolore.\r\n",
        "time": 145.8679,
        "completed": true,
        "points": 60
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae89a2c8a63d0c5eee9",
        "description": "Exercitation eiusmod deserunt occaecat fugiat aute labore reprehenderit. Ut exercitation sint mollit culpa. Laborum nulla laborum et id id incididunt minim fugiat adipisicing duis enim veniam.\r\n",
        "time": 158.1993,
        "completed": true,
        "points": 87
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9eae88ce0945637ee111b",
        "description": "Lorem magna ipsum do est sint elit nostrud culpa laborum ullamco eiusmod irure incididunt. Labore aute deserunt ipsum consectetur labore est ipsum qui do tempor aliqua. Dolor aute eiusmod esse laborum sunt non. Ut nisi et exercitation dolore laboris exercitation reprehenderit culpa ullamco dolore quis.\r\n",
        "time": 198.3097,
        "completed": true,
        "points": 90
      },
      {
        "name": "Maraetai Beach",
        "id": "64a9eae85983468d260fa402",
        "description": "Ut enim nulla labore enim sint. Laboris exercitation duis non ipsum sint duis proident. Veniam incididunt enim ea ad cillum cillum incididunt nostrud non nulla consectetur nisi. Excepteur Lorem aliquip id laborum aute nulla laboris ullamco in. Excepteur ut enim exercitation proident aute non proident. In occaecat est aliquip incididunt tempor occaecat et veniam labore duis id laboris quis enim. Voluptate Lorem dolore cillum cillum laborum reprehenderit commodo cillum.\r\n",
        "time": 153.556,
        "completed": true,
        "points": 62
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9eae8c69267108b547bbb",
        "description": "In duis commodo mollit enim nostrud sit. Irure pariatur pariatur commodo quis. Veniam qui pariatur nostrud adipisicing. Cupidatat magna sunt nostrud consequat exercitation tempor sit aliqua in voluptate.\r\n",
        "time": 16.8898,
        "completed": true,
        "points": 94
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9eae8af9e13bcc4c0892f",
        "description": "Nisi non et nulla cupidatat sint culpa aliquip. Sit ex excepteur laboris ullamco Lorem reprehenderit occaecat magna est. Et incididunt anim est aute esse duis non veniam proident sunt dolore ad amet.\r\n",
        "time": 183.0531,
        "completed": true,
        "points": 97
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9eae84823f4526b5fc202",
        "description": "Quis cillum est tempor pariatur incididunt ipsum. Culpa laborum reprehenderit sit dolore. Ipsum pariatur labore id cupidatat non ad sint aliqua nisi aliqua proident reprehenderit deserunt exercitation.\r\n",
        "time": 146.7662,
        "completed": true,
        "points": 85
      }
    ]
  },
  {
    "id": "64a9eae88071538b9e415345",
    "name": "Katie Reed",
    "steps": 95459,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Rangitoto Island",
        "id": "64a9eae8d3796fdb7b99bac2",
        "description": "Aliqua sunt ipsum culpa nostrud do minim est cupidatat minim sint amet. Sunt mollit nisi Lorem excepteur esse laborum quis commodo incididunt. Ea aute duis eu veniam. Ex eu ipsum quis enim enim in enim proident pariatur deserunt laboris dolore do. Magna est magna culpa quis excepteur qui amet excepteur enim fugiat pariatur Lorem eu esse. Dolor proident nulla proident cillum irure sit enim cupidatat veniam cillum in aliquip.\r\n",
        "time": 172.2376,
        "completed": true,
        "points": 22
      },
      {
        "name": "Silo Park",
        "id": "64a9eae8e82043b8c20fd299",
        "description": "Lorem reprehenderit reprehenderit ullamco velit cillum officia fugiat. Cillum aliquip velit eiusmod minim voluptate aliquip do. Adipisicing ex do enim ea qui consectetur laboris adipisicing aliquip pariatur proident voluptate officia. Deserunt pariatur magna ad ad esse pariatur anim cillum reprehenderit incididunt. Sunt nostrud sunt et Lorem exercitation dolor amet.\r\n",
        "time": 103.5225,
        "completed": true,
        "points": 55
      },
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9eae8aca3605993bfaa50",
        "description": "Nisi consectetur id veniam proident sint officia et ipsum. Tempor amet non aliqua velit officia officia excepteur enim non veniam pariatur esse. Mollit ipsum eu cillum commodo id enim voluptate deserunt qui tempor deserunt nisi irure. Ex amet non excepteur proident tempor. Elit excepteur ad aliqua veniam ut ad culpa ut aute cupidatat irure. Fugiat do commodo laborum veniam consequat dolor eiusmod qui reprehenderit culpa nisi adipisicing.\r\n",
        "time": 45.8073,
        "completed": true,
        "points": 87
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9eae811400f1ca6b76cc8",
        "description": "Ex anim ipsum anim elit. Irure anim id non sit tempor fugiat ullamco elit id qui aliqua. Adipisicing enim esse esse mollit ut.\r\n",
        "time": 197.9037,
        "completed": true,
        "points": 45
      },
      {
        "name": "Parnell",
        "id": "64a9eae8f7c99852e176cc68",
        "description": "Irure nostrud elit laborum non officia deserunt cillum mollit anim minim fugiat. In adipisicing laboris consequat enim laboris nulla sunt incididunt voluptate nulla. Nostrud fugiat anim ullamco ad enim cupidatat ex elit id. In occaecat incididunt dolore aute Lorem officia esse eu non laboris consectetur deserunt fugiat. Quis eiusmod qui eu eiusmod occaecat excepteur dolore Lorem cupidatat in qui. Incididunt est eu ex pariatur anim qui reprehenderit deserunt.\r\n",
        "time": 0.0154,
        "completed": true,
        "points": 87
      },
      {
        "name": "Karekare",
        "id": "64a9eae8ffa8fa8ee77e147c",
        "description": "Nulla veniam qui officia voluptate qui exercitation. Deserunt ex Lorem occaecat consequat do incididunt elit excepteur laboris qui enim. Veniam consequat consequat eu esse mollit in eiusmod. Eiusmod in amet nostrud cupidatat. Aliqua sint sint sunt est ullamco adipisicing.\r\n",
        "time": 154.5295,
        "completed": true,
        "points": 67
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae859465cb081e0fa0c",
        "description": "Occaecat veniam laboris qui sunt deserunt excepteur cupidatat fugiat eu aute in. Ipsum nisi consequat commodo eu magna fugiat nostrud minim elit excepteur reprehenderit qui proident velit. Voluptate nulla duis tempor incididunt laboris veniam nostrud deserunt in. Anim nostrud nostrud enim eu minim occaecat excepteur nisi aute dolor officia id proident reprehenderit. Officia Lorem consectetur excepteur labore sint qui incididunt nisi cupidatat veniam fugiat. Elit occaecat est dolor commodo excepteur ea proident ea ipsum.\r\n",
        "time": 92.4763,
        "completed": true,
        "points": 63
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae85f70c0c84d315c8e",
        "description": "Quis duis amet aliqua dolor do deserunt pariatur reprehenderit cupidatat do. Laborum magna incididunt nulla qui et minim ea Lorem amet sint labore aliqua magna. Anim est adipisicing sit occaecat fugiat. Commodo ipsum ex tempor labore eu.\r\n",
        "time": 4.769,
        "completed": true,
        "points": 50
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae8bd7c9a0c2f4777e2",
        "description": "Elit eiusmod qui sunt commodo dolore ad veniam aute irure sit consectetur proident. Lorem aute et Lorem tempor qui laboris ullamco adipisicing aliqua ea nostrud voluptate occaecat ut. Nisi amet nulla aute et voluptate reprehenderit veniam. Reprehenderit fugiat sit consequat nostrud do in aliqua do aliqua aute. Exercitation tempor cillum ad non sit eu incididunt. Est cillum fugiat magna commodo consequat id quis voluptate tempor est velit officia. Labore aliquip ea non ipsum consectetur est magna aliqua.\r\n",
        "time": 142.8634,
        "completed": true,
        "points": 35
      }
    ]
  },
  {
    "id": "64a9eae83caec0b256ec95a8",
    "name": "Hogan Garrett",
    "steps": 76203,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae814cd3ce82836f142",
        "description": "Sunt cupidatat amet Lorem ad ex veniam irure sint pariatur in voluptate aute. Esse occaecat dolore officia aute exercitation. Quis tempor veniam sint aliqua duis incididunt in do nostrud veniam incididunt. Excepteur id cupidatat cillum laborum nostrud consequat voluptate.\r\n",
        "time": 134.6541,
        "completed": true,
        "points": 91
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae8116ff6a41b8f38fe",
        "description": "Incididunt ea eiusmod commodo deserunt labore irure non consectetur exercitation duis reprehenderit sint velit mollit. Fugiat velit in culpa ullamco. Quis sunt cillum irure esse. Ea est id non quis non anim tempor amet anim eu reprehenderit occaecat qui sint. Tempor excepteur anim ut sit cupidatat.\r\n",
        "time": 97.1222,
        "completed": true,
        "points": 41
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae88ed3265bee2e3675",
        "description": "Sint quis in non ut aliqua sit et voluptate. Lorem ut aute sit eiusmod excepteur dolore. Deserunt voluptate aliqua officia do. Nostrud aliqua irure ex sint ea occaecat adipisicing ex velit dolore.\r\n",
        "time": 143.1624,
        "completed": true,
        "points": 14
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae8953cb3995caa4304",
        "description": "Dolore mollit laborum esse velit irure in id ipsum sint adipisicing veniam consectetur nostrud. In veniam magna aliquip ea mollit voluptate commodo ad sunt. Fugiat laborum proident ut velit incididunt eiusmod ad Lorem quis proident. Ex tempor tempor ad est enim occaecat nisi deserunt esse magna. Culpa ipsum ex velit velit qui sit occaecat eu est incididunt ipsum irure amet. Nisi ea velit pariatur adipisicing aliquip est mollit id deserunt amet enim reprehenderit ad laborum.\r\n",
        "time": 100.8908,
        "completed": true,
        "points": 76
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae83d867ea204872335",
        "description": "Cupidatat ex pariatur esse ea mollit dolore. Et magna est velit aliquip consequat eu est aute nulla. Ipsum aliquip esse magna qui officia sunt consectetur dolore proident quis.\r\n",
        "time": 67.8501,
        "completed": true,
        "points": 30
      },
      {
        "name": "Kawau Island",
        "id": "64a9eae8db51985037280702",
        "description": "Reprehenderit aute dolore id est cupidatat do sit magna elit qui. Ea esse cupidatat officia fugiat adipisicing est minim quis velit ea ut. Dolore esse dolore eu nostrud cupidatat eu est dolor labore deserunt quis. Dolor ea ut ut labore do. Deserunt do adipisicing non ut Lorem enim id quis incididunt. Excepteur fugiat nulla anim veniam et sint aute. Labore mollit eiusmod incididunt commodo veniam esse culpa excepteur cupidatat magna Lorem cillum.\r\n",
        "time": 138.0651,
        "completed": true,
        "points": 76
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae89ae0dcfe89518523",
        "description": "Deserunt veniam mollit excepteur et incididunt ipsum id id. Sunt non cupidatat velit magna. Incididunt adipisicing esse cillum sit cillum magna quis elit pariatur proident laborum. Exercitation ea laboris irure ullamco eu dolor ullamco. Non consectetur excepteur tempor cillum proident ut ea ad commodo ex nisi reprehenderit cillum.\r\n",
        "time": 109.5852,
        "completed": true,
        "points": 16
      },
      {
        "name": "Auckland Museum",
        "id": "64a9eae8ba0ac263450e7405",
        "description": "Minim et sunt aute ex magna laborum proident aliquip eu minim. Officia tempor minim mollit enim ut eiusmod. Commodo dolore dolor cillum consectetur reprehenderit cupidatat enim minim adipisicing esse. Adipisicing laboris dolore voluptate dolor duis. Minim aliqua cillum enim duis anim eiusmod do Lorem nulla adipisicing fugiat. Aliqua nulla veniam esse sint proident tempor consequat aute et. Sit ullamco duis deserunt magna occaecat amet culpa culpa qui fugiat.\r\n",
        "time": 17.6594,
        "completed": true,
        "points": 12
      }
    ]
  },
  {
    "id": "64a9eae8dc87035140d45f8a",
    "name": "Sims Cummings",
    "steps": 5859,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Mangere Mountain",
        "id": "64a9eae831afd4dd535004e4",
        "description": "Ex enim sunt mollit consectetur commodo duis elit. Magna dolor deserunt proident ad ex commodo cillum ad. In sunt laboris commodo nostrud est. Aliqua pariatur Lorem ex esse eiusmod aliquip fugiat non et est et tempor. Anim cillum excepteur nisi minim. Aliquip laborum aliquip ipsum minim.\r\n",
        "time": 111.1883,
        "completed": true,
        "points": 40
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae87ce44d9e27d6fc52",
        "description": "Consectetur ad proident cupidatat ipsum laborum irure ex duis nostrud. Non veniam exercitation ullamco id irure magna exercitation. Nulla minim adipisicing consequat eu esse et veniam non. Enim est ea consectetur incididunt nisi aliqua labore officia amet voluptate tempor Lorem consectetur. Fugiat cupidatat dolore eu aliquip quis ipsum consectetur et tempor laboris anim id tempor velit.\r\n",
        "time": 38.5321,
        "completed": true,
        "points": 13
      },
      {
        "name": "Auckland Museum",
        "id": "64a9eae8ca4a49c865dddad5",
        "description": "Qui et consequat esse qui occaecat adipisicing laborum culpa et eu nulla minim ipsum. Sint voluptate eu esse Lorem veniam. Aliqua ex ut laborum laborum enim ad voluptate magna et sunt dolor. Tempor in ad nostrud ad pariatur adipisicing labore enim ad enim.\r\n",
        "time": 24.7217,
        "completed": true,
        "points": 85
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9eae8965b98635c549589",
        "description": "Excepteur do fugiat ea tempor est sit. Ad deserunt elit minim non irure magna dolor non consectetur officia magna voluptate. Pariatur aliqua elit sunt minim id ea amet irure duis laborum qui.\r\n",
        "time": 62.8585,
        "completed": true,
        "points": 17
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae89b2cc84a41cca746",
        "description": "Eiusmod elit tempor commodo dolore sit adipisicing ea ipsum et. Anim exercitation qui laborum ad cupidatat. Aute velit culpa tempor consectetur elit amet est sunt exercitation enim fugiat ullamco veniam. Eiusmod adipisicing et eiusmod do mollit id aliqua eu.\r\n",
        "time": 185.8474,
        "completed": true,
        "points": 31
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae8c25ab78017fb8414",
        "description": "Ea in anim exercitation aliqua sunt ex aute enim dolore nostrud velit eiusmod esse mollit. Et est occaecat fugiat officia est esse non qui magna minim id nisi. Adipisicing fugiat ad reprehenderit laborum labore dolore ullamco mollit. Ullamco ad magna minim irure adipisicing laborum ea aliquip officia.\r\n",
        "time": 54.6061,
        "completed": true,
        "points": 19
      },
      {
        "name": "Devonport",
        "id": "64a9eae85a631359592f379c",
        "description": "Sit elit et sunt officia elit duis. Qui exercitation aliquip Lorem fugiat aute pariatur tempor Lorem anim ut. Aute cillum incididunt amet tempor et laboris nostrud nisi eiusmod enim laborum laboris reprehenderit. Deserunt ea enim irure mollit aute aliquip et in officia. Incididunt deserunt ex tempor nulla elit. Laboris do voluptate non aliqua consequat. Commodo est quis non occaecat ea fugiat Lorem ullamco sint adipisicing aute mollit qui non.\r\n",
        "time": 46.0372,
        "completed": true,
        "points": 27
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8c53183450c319c85",
        "description": "Sunt tempor dolore proident magna est occaecat reprehenderit cupidatat aliqua Lorem qui. Consectetur veniam ea nostrud labore et. Consequat culpa duis consectetur sit exercitation consectetur consequat.\r\n",
        "time": 1.857,
        "completed": true,
        "points": 19
      }
    ]
  },
  {
    "id": "64a9eae83a36474e064fe69c",
    "name": "Edna Riddle",
    "steps": 8965,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Karekare Beach",
        "id": "64a9eae843d901d75bbb1f79",
        "description": "Ut consequat esse nulla commodo. Elit tempor esse elit laborum incididunt eu sint mollit fugiat laboris. Ipsum ex excepteur pariatur deserunt nisi dolore cillum esse aute ea ipsum esse duis duis. Id excepteur ullamco amet sint reprehenderit elit commodo fugiat id. Qui veniam aute aliqua laborum duis duis in cillum ex qui aute et occaecat qui. Velit dolor dolore ea aute aliqua.\r\n",
        "time": 185.4021,
        "completed": true,
        "points": 39
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9eae8ea51929147c49210",
        "description": "Ut eiusmod ea consectetur mollit ullamco aliqua reprehenderit id aliquip fugiat eu aliquip magna exercitation. Et ea quis nisi amet aute eiusmod cillum ad amet veniam labore nulla. Amet duis nisi id tempor mollit. Quis voluptate Lorem cupidatat duis pariatur consequat aliqua consequat quis culpa magna anim sint. Duis quis amet reprehenderit deserunt nostrud ipsum excepteur quis ut.\r\n",
        "time": 169.7283,
        "completed": true,
        "points": 51
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9eae85bc44049aeb8f5ad",
        "description": "Mollit commodo qui sit reprehenderit esse reprehenderit amet minim est. Sit nisi non exercitation incididunt incididunt laboris sint elit fugiat laboris velit. Quis nulla velit occaecat id elit reprehenderit mollit est. Do cillum culpa cillum ex irure do laboris velit aliqua pariatur cupidatat dolor. Nostrud sunt duis dolor do nostrud cillum irure sit ipsum amet aliqua nostrud. Id sint laborum nulla id deserunt exercitation consequat ullamco non officia duis ipsum reprehenderit.\r\n",
        "time": 152.6696,
        "completed": true,
        "points": 59
      },
      {
        "name": "Eden Park",
        "id": "64a9eae880237a6a1084b722",
        "description": "Velit enim anim nulla mollit et consectetur irure incididunt dolore. Sit laborum reprehenderit aliqua esse exercitation. Aliqua commodo enim reprehenderit in. Dolore incididunt sunt eiusmod qui. Eu exercitation elit quis incididunt ea est magna nulla incididunt esse ullamco mollit cupidatat sint.\r\n",
        "time": 138.0129,
        "completed": true,
        "points": 98
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae81de7874c6378cc7c",
        "description": "Tempor pariatur laboris elit ad exercitation. Reprehenderit est irure dolore pariatur aliqua fugiat. Occaecat consectetur ex tempor nulla incididunt laboris adipisicing proident anim adipisicing laboris incididunt veniam nulla. Adipisicing laborum cillum tempor eu eu in deserunt fugiat ullamco. Qui elit labore sit culpa voluptate pariatur ut enim amet.\r\n",
        "time": 63.671,
        "completed": true,
        "points": 88
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae8da1d0e966b1129e6",
        "description": "Consectetur laboris aute Lorem veniam ut enim Lorem. Sunt dolor eu sit reprehenderit minim. Cupidatat aliquip veniam anim pariatur mollit anim et.\r\n",
        "time": 33.9015,
        "completed": true,
        "points": 97
      },
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9eae8908e4706866a15c9",
        "description": "Quis mollit reprehenderit nisi minim Lorem amet amet duis et Lorem labore incididunt nisi elit. Cillum est ex aliquip eu nulla et occaecat tempor duis. Veniam anim dolor aliquip sunt enim proident laboris. Eu voluptate adipisicing dolore ipsum proident occaecat commodo fugiat ut laboris. Anim nostrud aliqua in qui commodo culpa voluptate ea aliqua labore pariatur duis ea reprehenderit. Consequat elit do magna elit ex occaecat ut et fugiat elit ut veniam est velit. Nisi dolor amet do dolor consequat laboris sint.\r\n",
        "time": 199.7015,
        "completed": true,
        "points": 73
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae87c2cd38cfdbab376",
        "description": "Elit labore nostrud aliquip duis est cupidatat cupidatat labore incididunt cupidatat laboris officia qui in. Consectetur nostrud occaecat mollit ad eiusmod ad exercitation est eu. Ullamco irure est nulla culpa tempor minim minim nostrud aliquip voluptate veniam velit aliquip consequat. Excepteur nostrud tempor id occaecat qui sint aute incididunt proident.\r\n",
        "time": 105.344,
        "completed": true,
        "points": 25
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae8b1359901fb58db93",
        "description": "Esse ut culpa eiusmod laboris aute officia est dolor id amet. Laborum do incididunt fugiat cupidatat. Sit duis dolor sint eiusmod incididunt amet mollit reprehenderit.\r\n",
        "time": 120.672,
        "completed": true,
        "points": 80
      },
      {
        "name": "Maraetai Beach",
        "id": "64a9eae869b9608b0350d15e",
        "description": "Irure officia officia sunt dolore deserunt aliqua. Enim officia nostrud dolor aliqua fugiat est aute ad et nostrud eu ipsum enim. Incididunt et ad aliquip minim non est dolore. Enim anim commodo voluptate consectetur veniam anim reprehenderit eu duis ex anim ex ut. Irure cillum et irure voluptate voluptate proident pariatur nostrud ipsum quis qui. Fugiat consectetur deserunt ipsum amet reprehenderit. Anim incididunt do proident non.\r\n",
        "time": 196.1684,
        "completed": true,
        "points": 20
      }
    ]
  },
  {
    "id": "64a9eae84c06375d25006913",
    "name": "Terrell Barker",
    "steps": 59013,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Kitekite Falls",
        "id": "64a9eae87e308fed09263613",
        "description": "Labore tempor fugiat tempor ut elit magna ad aute proident deserunt elit. Mollit est minim do aute exercitation quis amet sunt dolor esse consequat. Amet culpa in irure sit non proident non id cillum qui dolore ut.\r\n",
        "time": 88.8451,
        "completed": true,
        "points": 77
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8d7ba4041b520a200",
        "description": "Cillum velit elit nisi elit mollit. In sit dolore consectetur officia est est irure cupidatat elit mollit ut nulla officia. Magna occaecat eiusmod laborum reprehenderit nisi esse ullamco ut culpa. Sit eiusmod veniam id pariatur tempor nisi veniam pariatur cillum dolore do reprehenderit. Eu ex culpa voluptate ut mollit reprehenderit fugiat officia est.\r\n",
        "time": 94.0726,
        "completed": true,
        "points": 28
      },
      {
        "name": "Piha Beach",
        "id": "64a9eae83fd25515e9f8d5b4",
        "description": "Velit et proident ipsum ipsum ad mollit Lorem. Adipisicing fugiat Lorem exercitation reprehenderit sit occaecat duis anim. Incididunt enim cupidatat magna nostrud velit veniam qui quis. Ex non Lorem qui mollit anim enim. Est sint anim nostrud ad laboris tempor magna.\r\n",
        "time": 78.8492,
        "completed": true,
        "points": 54
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae8e4dc3ec94f020d69",
        "description": "Esse duis nulla pariatur irure aliquip. Non Lorem id enim mollit qui. Ex excepteur deserunt deserunt exercitation in laborum sunt officia tempor voluptate eu ad. Ea adipisicing pariatur laboris officia cupidatat Lorem. Exercitation commodo nisi esse non. Ut occaecat duis consequat enim mollit in sit nostrud excepteur eiusmod officia esse enim.\r\n",
        "time": 79.8077,
        "completed": true,
        "points": 49
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9eae89690f33b464a6e44",
        "description": "Fugiat voluptate minim do duis cupidatat. Dolor cillum qui anim ut fugiat qui quis fugiat consequat eiusmod ipsum do cupidatat. Pariatur minim ipsum incididunt veniam proident reprehenderit sint pariatur sunt id ipsum incididunt ipsum esse.\r\n",
        "time": 95.1623,
        "completed": true,
        "points": 86
      },
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9eae8df30aa688d59ab7b",
        "description": "Elit esse enim et amet esse proident. Velit ad nisi aliquip nostrud mollit do. Mollit aliquip irure do voluptate officia eiusmod laborum aute labore minim consequat. Ipsum irure proident ipsum sint non.\r\n",
        "time": 140.5413,
        "completed": true,
        "points": 90
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9eae864a784e959991bf1",
        "description": "Nulla non excepteur dolor officia esse ipsum ipsum eiusmod nostrud dolore non ut sunt mollit. Tempor aute laborum laboris proident ad adipisicing officia deserunt id eiusmod consectetur voluptate officia aliquip. Excepteur ipsum enim adipisicing exercitation.\r\n",
        "time": 0.3395,
        "completed": true,
        "points": 74
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9eae8ceed247604083d73",
        "description": "Qui duis dolor esse nulla quis voluptate amet pariatur aliqua nisi velit Lorem irure id. Eiusmod magna nulla non ipsum aute culpa aute officia irure adipisicing pariatur consectetur. Nostrud et dolore ea ullamco eu amet.\r\n",
        "time": 159.5401,
        "completed": true,
        "points": 17
      },
      {
        "name": "Western Springs",
        "id": "64a9eae8e47782877562eba8",
        "description": "Non ut reprehenderit ipsum proident et cupidatat ullamco id eu do velit non adipisicing sit. Occaecat in qui ex dolor pariatur et. Nulla ipsum ut non sunt est nulla magna adipisicing aliquip incididunt. Reprehenderit qui ullamco nostrud commodo elit nostrud aute quis.\r\n",
        "time": 27.5823,
        "completed": true,
        "points": 42
      }
    ]
  },
  {
    "id": "64a9eae8431ac2a78ad629ea",
    "name": "Henrietta Gates",
    "steps": 28501,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae80690a5f3721da963",
        "description": "Consequat excepteur ea minim aliquip cillum officia do quis labore consequat esse ut pariatur reprehenderit. Est id incididunt fugiat aute esse irure dolor consequat. Sit officia veniam occaecat voluptate esse et labore. Id fugiat id magna labore occaecat incididunt. Quis eiusmod incididunt dolor eiusmod nulla voluptate incididunt labore minim. Dolor in sunt dolor aliqua deserunt aliqua mollit commodo id est fugiat esse dolore adipisicing. Et sint id veniam elit eu amet culpa qui.\r\n",
        "time": 176.9438,
        "completed": true,
        "points": 22
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8bd7a1738cb8c3f76",
        "description": "Fugiat ad non enim aliqua. Ex incididunt eiusmod aliqua sunt minim. Ad nisi laboris velit magna ex commodo ea consequat anim ut voluptate occaecat. Mollit non eu duis incididunt proident ipsum enim qui adipisicing aute labore. Ad elit commodo nulla officia. Reprehenderit sit duis aliquip minim id deserunt ad adipisicing occaecat dolore veniam ea cupidatat et. Anim Lorem ex dolor esse aliqua ullamco.\r\n",
        "time": 64.5099,
        "completed": true,
        "points": 92
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9eae8c43d66361e5d4e3f",
        "description": "Ut et consequat sint magna nostrud incididunt elit adipisicing ad deserunt esse pariatur magna aliquip. Duis elit est quis reprehenderit non. Non occaecat in aute laboris consequat aliquip aute fugiat esse incididunt consectetur. Id magna Lorem non amet cupidatat ullamco excepteur ullamco occaecat sint aute nostrud exercitation. Ex ad occaecat ad excepteur cupidatat duis. Mollit aliqua pariatur velit pariatur duis mollit id eiusmod commodo tempor dolor quis laborum.\r\n",
        "time": 1.0677,
        "completed": true,
        "points": 66
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae815370f60a10f91b1",
        "description": "Pariatur consectetur enim aliquip velit ut tempor est laboris. Amet consectetur veniam enim non veniam occaecat ipsum. In laboris veniam Lorem sit aliquip qui. Pariatur nostrud reprehenderit magna est laborum nulla irure officia tempor quis. Consectetur cupidatat id commodo laborum fugiat cupidatat. Esse aliqua consequat nulla ad sint consequat. Ut ea officia Lorem dolor laboris proident nostrud incididunt incididunt dolore consequat amet cillum sunt.\r\n",
        "time": 175.958,
        "completed": true,
        "points": 78
      },
      {
        "name": "Devonport",
        "id": "64a9eae8a21149432809144b",
        "description": "Fugiat reprehenderit enim ipsum esse laborum pariatur esse et qui et et. Nisi et aliqua id aute aute id fugiat incididunt velit voluptate. Ea officia consectetur dolor ea elit aute ex amet Lorem culpa aute velit. Deserunt sint ad dolore culpa non commodo est ipsum tempor dolore. Duis minim culpa esse eu qui adipisicing cillum commodo.\r\n",
        "time": 83.5832,
        "completed": true,
        "points": 14
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9eae87241742cbd4df928",
        "description": "Magna commodo et quis mollit fugiat. Velit est do nulla proident anim mollit labore cupidatat enim amet. Aute nulla laboris minim aliquip nulla aute quis quis voluptate aliquip duis Lorem excepteur. Commodo velit mollit do ex est qui aute.\r\n",
        "time": 174.9014,
        "completed": true,
        "points": 33
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8cb619f64f9fc0cfd",
        "description": "Excepteur esse consectetur magna exercitation. Ea ea culpa ex proident do est irure. Quis excepteur nulla dolor nostrud dolore reprehenderit ea do voluptate. Ad occaecat quis irure minim pariatur. Voluptate magna do nisi et irure proident sunt sunt dolor labore dolor laboris veniam laboris. Commodo incididunt duis ea elit aute nulla velit sunt cillum. Est reprehenderit velit dolore deserunt officia.\r\n",
        "time": 71.5162,
        "completed": true,
        "points": 12
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae8eeb7e458c41b22bb",
        "description": "Fugiat officia qui anim aute aliqua. Non Lorem consequat aliqua nisi et tempor voluptate consequat. Minim esse non voluptate dolor dolore est quis cillum irure excepteur adipisicing nisi consectetur dolor. Exercitation occaecat nostrud enim nulla.\r\n",
        "time": 104.2107,
        "completed": true,
        "points": 21
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae899574144f8bee5c9",
        "description": "Aliqua duis aliquip do occaecat velit deserunt officia adipisicing aliquip. Velit ea id nisi voluptate. Laboris ipsum officia ipsum id est dolor labore culpa nisi et eiusmod.\r\n",
        "time": 73.7012,
        "completed": true,
        "points": 25
      }
    ]
  },
  {
    "id": "64a9eae8ab873131a00bafa6",
    "name": "Gail Barnett",
    "steps": 76988,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Mount Eden",
        "id": "64a9eae88bc1460ea206f019",
        "description": "Proident eu do qui non id laboris duis exercitation velit ex. Aliqua anim ipsum veniam quis ea laborum. Magna minim dolore Lorem sit nulla Lorem consequat occaecat sit adipisicing culpa. Fugiat consectetur ut non nostrud ullamco velit. Anim velit excepteur id reprehenderit velit magna duis consectetur laboris velit nisi. Non cupidatat eiusmod pariatur dolore ad aliquip minim incididunt deserunt esse sit adipisicing exercitation ea. Aute amet laborum labore quis mollit culpa excepteur mollit magna mollit sint et anim.\r\n",
        "time": 20.995,
        "completed": true,
        "points": 94
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8b29c20674ff42e76",
        "description": "Id qui minim eu dolore officia Lorem ut reprehenderit qui do pariatur ut esse tempor. Non nisi est aute officia commodo ut. Tempor incididunt mollit minim ex eu ullamco aute. Magna aliquip excepteur excepteur adipisicing ad consequat officia duis pariatur commodo. Ut reprehenderit velit est nostrud. Elit sint reprehenderit tempor minim est eiusmod id nisi est amet dolor exercitation.\r\n",
        "time": 117.0299,
        "completed": true,
        "points": 66
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae890a8c2467d08d852",
        "description": "Dolore quis tempor tempor id excepteur duis dolore occaecat nostrud nulla. Id tempor proident ad deserunt Lorem commodo laboris nostrud in et anim. Et laborum officia reprehenderit aliquip pariatur eu ipsum.\r\n",
        "time": 193.8154,
        "completed": true,
        "points": 27
      },
      {
        "name": "Waiheke Island",
        "id": "64a9eae8ee5330f7898de845",
        "description": "Ullamco exercitation sint eu exercitation aliqua. Nostrud reprehenderit cupidatat amet aliqua. Ipsum nulla duis non aute anim laborum officia pariatur. Irure commodo adipisicing nulla eiusmod ipsum occaecat quis labore mollit tempor officia id consequat anim. Velit pariatur aliquip sint nostrud tempor excepteur sit pariatur labore ex exercitation. Ex nostrud laboris minim do. Sunt aliquip nostrud est in laborum labore ea.\r\n",
        "time": 128.3243,
        "completed": true,
        "points": 92
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae8e8773f2f1fe1cc97",
        "description": "Ad exercitation commodo cupidatat ullamco culpa esse culpa sit qui anim elit. Ex non est anim elit eu qui excepteur eu reprehenderit magna aliquip. Velit laborum tempor consequat aute. Voluptate consequat exercitation cupidatat nulla reprehenderit nulla commodo laboris quis sint exercitation cupidatat.\r\n",
        "time": 126.7265,
        "completed": true,
        "points": 35
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9eae808b91090d9715425",
        "description": "Commodo irure ex aliqua reprehenderit eu. Culpa mollit laborum cillum ad veniam. Nulla minim magna Lorem nulla ad. Sunt cupidatat eu reprehenderit occaecat cillum labore laboris dolor velit dolore. Fugiat consectetur sit laborum voluptate adipisicing fugiat eiusmod non laborum cillum qui magna enim.\r\n",
        "time": 90.7579,
        "completed": true,
        "points": 95
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae8e217a9a38fbd19d3",
        "description": "Ex pariatur est nostrud ipsum cillum enim exercitation commodo id incididunt dolor magna. Sit aute cupidatat quis ullamco pariatur sit dolor dolore sunt ullamco ut dolore quis sit. Tempor esse qui exercitation sint.\r\n",
        "time": 119.5267,
        "completed": true,
        "points": 53
      },
      {
        "name": "Western Springs",
        "id": "64a9eae8a99aeef1873378b0",
        "description": "Fugiat nisi nulla mollit cupidatat. Anim ad enim et laborum aliqua minim id sit enim commodo officia irure esse velit. Deserunt commodo est veniam dolore culpa. Occaecat commodo consectetur esse minim minim. Incididunt officia id velit voluptate enim voluptate commodo ullamco.\r\n",
        "time": 56.7714,
        "completed": true,
        "points": 71
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae80842978c854a3e5c",
        "description": "Sint laboris adipisicing voluptate id consequat id veniam et mollit commodo dolore voluptate exercitation minim. Ut do officia proident aliquip ipsum occaecat ea laboris dolor incididunt eu. Sint incididunt anim reprehenderit ad cillum. Ipsum pariatur nulla culpa ad eu aliquip incididunt ipsum magna nostrud. Dolore esse exercitation exercitation amet esse id excepteur officia ullamco exercitation consequat aute velit ipsum. Duis dolore ex esse irure. Incididunt commodo laboris occaecat est quis.\r\n",
        "time": 104.4067,
        "completed": true,
        "points": 23
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae82cac1920fb6eea2a",
        "description": "Culpa voluptate officia sit voluptate. Dolore eu do nisi quis aliqua pariatur quis ipsum et enim eu. Deserunt non ea pariatur et duis enim occaecat id sit deserunt. Eu magna est ad consequat eiusmod culpa ut eu reprehenderit sint.\r\n",
        "time": 66.4602,
        "completed": true,
        "points": 25
      }
    ]
  },
  {
    "id": "64a9eae8de33cb0abec978f8",
    "name": "Morrison Russo",
    "steps": 70860,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Gulf Harbour",
        "id": "64a9eae85a661f25ed9f984f",
        "description": "Ut cupidatat commodo quis nisi eiusmod voluptate occaecat fugiat. Magna sint officia veniam excepteur cupidatat aliquip ullamco sit pariatur sint proident. Culpa dolor consectetur irure aliqua cupidatat qui ipsum non sit ipsum.\r\n",
        "time": 83.6244,
        "completed": true,
        "points": 54
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae8279abdd0d118e886",
        "description": "Cupidatat mollit ea mollit labore mollit velit irure eu. Dolore ea Lorem labore cillum irure pariatur elit labore ipsum. Do labore ut mollit labore elit irure voluptate voluptate. Tempor amet do labore nulla nisi consequat ea. Non magna esse amet duis exercitation irure pariatur ipsum excepteur.\r\n",
        "time": 135.3721,
        "completed": true,
        "points": 21
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae88074e15ad2513c14",
        "description": "Laboris ex veniam laboris in cupidatat. Pariatur officia sit tempor et dolore est anim aute proident fugiat voluptate nostrud quis. Nulla magna ullamco enim do esse quis cupidatat tempor est amet Lorem duis id est.\r\n",
        "time": 179.0197,
        "completed": true,
        "points": 34
      },
      {
        "name": "Karekare",
        "id": "64a9eae808ef8ce139e3b9ac",
        "description": "Dolore exercitation esse sunt id ut do adipisicing irure sit minim nulla Lorem officia est. Dolore et et ipsum eu quis tempor ad. Laborum irure deserunt ullamco ad consequat qui sunt labore consectetur.\r\n",
        "time": 99.1405,
        "completed": true,
        "points": 50
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae8558a87145ae2a811",
        "description": "Proident amet in labore aliquip in est adipisicing. Est id do et et laborum sit. Qui aliquip id deserunt cillum esse reprehenderit ut eiusmod consectetur sunt consequat cupidatat. Elit irure et eu aliqua labore. Mollit ad nulla ad qui velit culpa veniam est aliqua elit. Consequat sunt cillum officia quis non in.\r\n",
        "time": 127.6407,
        "completed": true,
        "points": 60
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae83eb6c10df38e5b9a",
        "description": "Laborum consectetur in qui incididunt ipsum officia aute. Nulla minim duis mollit sit et. Mollit ea commodo tempor laborum magna commodo commodo incididunt exercitation ea. Nulla culpa excepteur amet duis. Tempor exercitation deserunt est aliqua. Adipisicing pariatur nostrud aliqua anim pariatur sunt deserunt minim deserunt aliqua proident sit.\r\n",
        "time": 79.1476,
        "completed": true,
        "points": 88
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae86bb3342d5e9cf689",
        "description": "Dolore commodo exercitation laboris minim pariatur magna laborum laboris proident nulla proident veniam. Dolor sunt ullamco amet irure cillum cillum id dolore. Laborum ad laborum magna duis.\r\n",
        "time": 87.2031,
        "completed": true,
        "points": 68
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae8bb6e8ad7e2698cb1",
        "description": "Ut ullamco magna laboris adipisicing dolore adipisicing excepteur consectetur minim do cillum qui reprehenderit. Consequat do elit duis irure velit fugiat velit aute deserunt velit nostrud amet. Id consequat excepteur sit do. Do mollit nostrud cillum ut ex cillum minim et. Cupidatat mollit ea anim sunt occaecat cillum id est sunt id sit esse culpa. Aliquip mollit reprehenderit est consectetur incididunt sint occaecat ad laborum adipisicing ex minim ea est. Magna quis nisi excepteur excepteur tempor ipsum officia nostrud labore cupidatat proident enim culpa.\r\n",
        "time": 162.2329,
        "completed": true,
        "points": 85
      },
      {
        "name": "Queen Street",
        "id": "64a9eae89cd99a1a6c07bbe6",
        "description": "Occaecat sit do ipsum qui aute sint excepteur aliquip qui esse irure tempor. Irure aute nostrud ut incididunt Lorem ut. Laborum eiusmod pariatur adipisicing pariatur.\r\n",
        "time": 141.8501,
        "completed": true,
        "points": 70
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae87328e60e383b6ac6",
        "description": "Ex proident ut exercitation ullamco elit pariatur ex elit laboris culpa commodo. Eiusmod velit id esse minim laborum nostrud irure consequat sint velit esse cillum. Eu aliquip pariatur ipsum commodo ut veniam non laborum dolore sit nostrud culpa magna elit.\r\n",
        "time": 66.3851,
        "completed": true,
        "points": 95
      }
    ]
  },
  {
    "id": "64a9eae82d874c57002ac91b",
    "name": "Ilene Parks",
    "steps": 60856,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8b5eac7a4314aaa62",
        "description": "Labore sint tempor veniam commodo deserunt pariatur sit non do qui eiusmod fugiat amet. Consectetur ipsum mollit quis amet aliquip est pariatur. Sit amet cillum amet aliquip nulla reprehenderit. Ea duis mollit tempor eu deserunt cupidatat eu culpa pariatur. Nisi nisi deserunt do ut in voluptate do in consequat et dolor adipisicing excepteur. Consequat eu officia sunt officia laboris deserunt aliqua laboris do nisi sit officia laborum. Sint id ea nulla id et magna labore ex sit ullamco enim nostrud.\r\n",
        "time": 80.465,
        "completed": true,
        "points": 27
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae859b2efa04d39d949",
        "description": "Irure est sint cillum proident est quis qui labore ex occaecat pariatur. Mollit Lorem nisi in reprehenderit laborum culpa aute id. Amet ea irure aliquip officia enim esse. Sit deserunt proident dolor magna est proident culpa eu ut. Nisi voluptate aliquip ea incididunt aliquip non duis culpa quis eiusmod laborum est. Excepteur id anim non nostrud adipisicing Lorem. Occaecat in esse ipsum incididunt anim quis excepteur aliquip ipsum reprehenderit occaecat et reprehenderit consectetur.\r\n",
        "time": 38.2632,
        "completed": true,
        "points": 48
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9eae8c89eade2ee5ee899",
        "description": "Dolore est cupidatat adipisicing cupidatat proident magna do do nisi excepteur adipisicing aliqua. Aliquip mollit pariatur sit consequat nulla culpa. Sunt ipsum consectetur nisi quis. Ullamco dolor sint magna proident ipsum velit commodo incididunt sint irure.\r\n",
        "time": 4.7172,
        "completed": true,
        "points": 59
      },
      {
        "name": "Albert Park",
        "id": "64a9eae8a22e36b38a2ede0c",
        "description": "Consequat dolore aliquip fugiat dolore cillum commodo aute aliquip fugiat cupidatat enim. Duis magna irure qui velit adipisicing voluptate do amet. Cupidatat culpa ea occaecat aliqua.\r\n",
        "time": 158.8836,
        "completed": true,
        "points": 92
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae810fbe77529eecccc",
        "description": "Deserunt esse adipisicing exercitation labore voluptate fugiat nulla. Cupidatat reprehenderit consectetur officia amet ut ea velit duis enim dolor. Adipisicing dolor duis eiusmod cillum sunt aliqua ad duis mollit laboris ex sit velit aliquip. Labore nostrud reprehenderit culpa reprehenderit esse qui eiusmod laboris magna. Amet pariatur in veniam tempor velit et aute laborum pariatur fugiat culpa anim id. Pariatur fugiat sunt aute fugiat sint elit exercitation laborum adipisicing minim et commodo.\r\n",
        "time": 103.1418,
        "completed": true,
        "points": 15
      },
      {
        "name": "Auckland Domain",
        "id": "64a9eae8b9c21360f3993c23",
        "description": "Laborum do laborum ullamco eiusmod. In est adipisicing ea dolore ad. Ex esse reprehenderit in anim veniam commodo consequat cupidatat. Ex sit aute et labore labore incididunt quis id eu.\r\n",
        "time": 56.4621,
        "completed": true,
        "points": 85
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae84bfa46a6ce541af8",
        "description": "Laborum quis magna duis pariatur anim ipsum ea ipsum eiusmod nostrud sunt. Enim excepteur cillum sint proident id est ad veniam in. Tempor quis nulla cillum pariatur dolor consequat fugiat. Qui aliqua labore amet cillum do laborum nostrud aliqua non laborum. Quis tempor eiusmod dolor sint commodo ad aliquip cillum aliqua Lorem adipisicing do velit. Magna quis cupidatat laboris sint. Eiusmod non qui nisi cupidatat aute commodo nulla commodo et consectetur voluptate.\r\n",
        "time": 10.1977,
        "completed": true,
        "points": 86
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae8685c1af0859d145f",
        "description": "Cupidatat do deserunt qui irure commodo anim. Enim amet culpa ex et reprehenderit ad sint. Nisi incididunt excepteur eiusmod minim enim enim ullamco dolor sint ipsum dolor. Reprehenderit quis voluptate nisi voluptate. Et quis reprehenderit pariatur aliquip.\r\n",
        "time": 39.0884,
        "completed": true,
        "points": 15
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae877b65a080333199a",
        "description": "Officia ipsum mollit ullamco quis ad ipsum magna velit sint cillum est id. Do fugiat fugiat qui dolor culpa sunt. Nostrud ullamco ea reprehenderit Lorem velit nisi est. Et est non sint reprehenderit excepteur consectetur. Anim sint deserunt id culpa consectetur officia do.\r\n",
        "time": 60.1711,
        "completed": true,
        "points": 34
      }
    ]
  },
  {
    "id": "64a9eae8f0244966c3780b30",
    "name": "Herminia Wilcox",
    "steps": 88736,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae8881ef85a589f73a2",
        "description": "Est deserunt aliqua do ut ad est fugiat non reprehenderit excepteur. Labore occaecat consectetur cillum sunt non ad proident nisi ut fugiat. Culpa adipisicing ut proident in. Anim anim sit velit cupidatat cupidatat officia ipsum sunt sunt tempor tempor amet.\r\n",
        "time": 141.6879,
        "completed": true,
        "points": 73
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9eae84d10b37091e95b99",
        "description": "Dolore nulla proident laboris ex ut eiusmod cupidatat est eu et nostrud veniam mollit minim. Anim aliquip incididunt reprehenderit dolore adipisicing officia excepteur quis. Labore excepteur minim proident magna reprehenderit ut non sint cupidatat irure consectetur duis exercitation magna. Reprehenderit proident adipisicing aliqua Lorem excepteur tempor et aliquip. Nulla sunt cupidatat amet sint cillum velit.\r\n",
        "time": 45.2123,
        "completed": true,
        "points": 62
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8dc3b8b0d36a71995",
        "description": "Do exercitation occaecat deserunt ut. Laborum aliquip aliqua esse reprehenderit id pariatur elit labore. Labore deserunt laborum incididunt consequat qui ad id sunt aliqua id consequat magna irure. Commodo Lorem Lorem anim sunt excepteur. Occaecat voluptate nulla velit anim officia do et est et labore enim commodo fugiat duis. Ut aliquip ad do sit.\r\n",
        "time": 25.5803,
        "completed": true,
        "points": 62
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae84e7c4f41002a082d",
        "description": "Amet mollit aliqua sit nostrud deserunt ullamco commodo esse. Minim deserunt veniam exercitation deserunt magna tempor. Lorem mollit nostrud laborum quis sit aliquip esse cupidatat aute.\r\n",
        "time": 17.8311,
        "completed": true,
        "points": 31
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9eae8ec2c493336f29c59",
        "description": "Velit ut minim voluptate veniam fugiat. Anim aliquip sit veniam fugiat. Officia mollit minim dolor sunt culpa id officia. Non elit proident nulla cillum voluptate tempor tempor duis in laboris mollit non minim reprehenderit.\r\n",
        "time": 74.8775,
        "completed": true,
        "points": 31
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9eae80758e5fe486e0a75",
        "description": "Amet esse minim adipisicing ut enim sint ut duis aliqua consequat laboris laborum. Lorem id exercitation minim duis aliqua est adipisicing adipisicing ad eu officia anim ullamco. Fugiat ipsum minim excepteur est. Labore tempor ut aliqua commodo excepteur. Pariatur occaecat fugiat ullamco nostrud laboris nulla sint pariatur ea.\r\n",
        "time": 66.4577,
        "completed": true,
        "points": 27
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae8513db0187a2b2080",
        "description": "Fugiat voluptate ea reprehenderit nisi officia eu do irure laborum incididunt ea elit cillum aliquip. Nulla mollit id ea qui deserunt cupidatat ex ea et voluptate voluptate. Fugiat ullamco voluptate cillum eiusmod excepteur sit. Sunt ad cupidatat ea sit officia exercitation cillum ad. Mollit quis consectetur enim sunt. Et reprehenderit ea occaecat magna aliquip ipsum est consequat sint officia commodo excepteur nostrud qui. Veniam sit culpa enim aliquip velit eu tempor dolor quis.\r\n",
        "time": 8.2508,
        "completed": true,
        "points": 17
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9eae834a9f09fc87c06c5",
        "description": "Ut Lorem proident est et. Ut est in amet irure voluptate ipsum ex proident commodo sint dolore cupidatat occaecat aliqua. Excepteur aliqua aliquip sint pariatur Lorem. Culpa tempor magna sunt proident esse laboris culpa quis velit qui. Eiusmod esse id anim Lorem fugiat pariatur qui duis magna dolore commodo. Anim amet elit sunt adipisicing minim veniam labore officia ipsum exercitation.\r\n",
        "time": 54.8475,
        "completed": true,
        "points": 40
      }
    ]
  },
  {
    "id": "64a9eae88bbcc3ef63449a4d",
    "name": "Morin Stewart",
    "steps": 23823,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9eae8058a1127e285c662",
        "description": "Enim fugiat minim duis exercitation. Ut quis veniam cillum Lorem nostrud commodo aliquip. Voluptate tempor tempor sunt Lorem dolore aliquip enim. In minim magna aliquip velit deserunt in veniam incididunt. Dolor pariatur ad mollit labore voluptate reprehenderit velit cillum consectetur nulla. Ullamco enim velit aliqua reprehenderit eu exercitation aute. Eu elit Lorem esse occaecat.\r\n",
        "time": 32.1843,
        "completed": true,
        "points": 12
      },
      {
        "name": "Mount Eden",
        "id": "64a9eae8953dfcb270723294",
        "description": "Cupidatat labore deserunt pariatur quis est laboris cupidatat nisi. Magna pariatur pariatur id eiusmod duis esse eu officia velit Lorem qui consequat fugiat aliqua. Ex esse velit duis consectetur cupidatat reprehenderit eu amet consequat minim aliquip in. Cupidatat sit in deserunt consectetur dolor eu esse commodo duis qui nulla deserunt dolor.\r\n",
        "time": 111.6579,
        "completed": true,
        "points": 27
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae8f97b6abf7f960a94",
        "description": "Nostrud et ea ex laboris et irure eu consectetur. Ad anim pariatur aliqua amet consectetur sit consectetur exercitation sunt magna duis laboris cillum velit. Ut enim pariatur laborum exercitation nisi cupidatat esse id eu et nisi.\r\n",
        "time": 124.8863,
        "completed": true,
        "points": 48
      },
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9eae8808088c960ef624f",
        "description": "Commodo eu dolor magna do veniam nulla est deserunt eiusmod eu. Ullamco nostrud irure cupidatat reprehenderit non excepteur minim nulla consectetur aliquip duis. Consequat do in esse commodo et esse dolore ut sunt in reprehenderit veniam excepteur. Ipsum ex aliqua aute dolor et veniam officia enim cupidatat ipsum irure est.\r\n",
        "time": 105.3414,
        "completed": true,
        "points": 89
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae8b0ea81dcd880ce02",
        "description": "Sit Lorem dolor sint laborum Lorem aliqua consequat occaecat cillum laborum minim non deserunt eiusmod. Dolor deserunt ea velit sint. Labore adipisicing dolor aliquip laboris qui elit pariatur exercitation. Quis culpa ex nostrud labore duis non elit eiusmod ullamco ullamco culpa consectetur sunt. Dolore duis nulla magna magna Lorem aute ex officia laborum consectetur veniam sit ullamco.\r\n",
        "time": 108.4243,
        "completed": true,
        "points": 15
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9eae86facc61503ad588c",
        "description": "Magna voluptate sint commodo adipisicing sit officia. Nostrud ut laborum consectetur ea sunt aliqua velit dolore dolore ad incididunt ullamco irure. Occaecat quis sunt elit deserunt cillum mollit do velit veniam.\r\n",
        "time": 81.7345,
        "completed": true,
        "points": 12
      },
      {
        "name": "Karekare",
        "id": "64a9eae8919a6077c9de491a",
        "description": "In officia magna id mollit amet laboris proident occaecat voluptate ipsum voluptate. Qui ea nulla quis exercitation duis velit minim cupidatat. Elit esse dolor amet ex veniam non aliquip incididunt quis. Excepteur non in excepteur est. Eu consequat minim ad sunt cupidatat non.\r\n",
        "time": 158.4995,
        "completed": true,
        "points": 17
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae88f9fca14c52454ba",
        "description": "Enim deserunt incididunt consectetur tempor aute ut consequat laboris culpa ipsum occaecat Lorem. Cupidatat ullamco laboris laborum mollit in esse duis officia nulla ipsum et. Eu ullamco sint qui Lorem consectetur laborum labore cupidatat ut aliquip. Culpa consectetur est commodo minim sunt non adipisicing aute proident cillum. Quis reprehenderit in aliqua eu incididunt in proident pariatur laboris. Consequat consectetur nisi exercitation eiusmod proident in tempor non esse duis ut eiusmod minim.\r\n",
        "time": 128.1197,
        "completed": true,
        "points": 45
      }
    ]
  },
  {
    "id": "64a9eae86f434a65ef72b534",
    "name": "Mclean Sloan",
    "steps": 58435,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Western Springs",
        "id": "64a9eae8c11b578be65c3ba0",
        "description": "Irure adipisicing magna sunt amet excepteur dolore exercitation amet est. Excepteur exercitation amet adipisicing exercitation enim nostrud amet qui. Sit ut deserunt eu consequat et. Voluptate nisi commodo laborum aliqua enim do proident consequat minim ut.\r\n",
        "time": 152.8723,
        "completed": true,
        "points": 62
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae8e62bc41000250c0c",
        "description": "Pariatur irure Lorem officia duis officia ut velit ipsum. Nisi quis mollit reprehenderit consectetur anim occaecat qui sit nulla consectetur do. Est exercitation aute voluptate elit. Minim elit non eiusmod mollit Lorem laboris ex quis cillum id adipisicing. Irure dolore fugiat enim eu reprehenderit sunt occaecat fugiat minim. Aliquip deserunt veniam et sunt excepteur.\r\n",
        "time": 19.9912,
        "completed": true,
        "points": 27
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae821993f5afa0fc460",
        "description": "Voluptate anim commodo Lorem est officia sunt deserunt. Anim Lorem consequat velit mollit laboris. Cupidatat et nisi laborum nisi aute Lorem culpa velit laborum consequat aliquip eiusmod est ipsum. Sit aliqua ullamco cillum eiusmod eiusmod esse aliquip deserunt sint.\r\n",
        "time": 70.14,
        "completed": true,
        "points": 97
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae872ae70150a719739",
        "description": "Ad adipisicing cupidatat elit id eu nisi excepteur culpa. Laborum ex eiusmod officia sit eiusmod id nostrud nostrud sunt duis non. Sunt velit eiusmod fugiat eiusmod commodo est. Pariatur eiusmod minim dolore cillum eu anim dolore duis ex aute qui. Deserunt minim do pariatur et eu voluptate consectetur proident do ea. Exercitation officia consequat dolore dolore in occaecat tempor labore laborum ea. Aliqua proident amet id veniam.\r\n",
        "time": 65.12,
        "completed": true,
        "points": 68
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8eed116792d9fe52e",
        "description": "Elit mollit ullamco est duis laborum ad officia. Aliqua officia velit culpa aliqua cupidatat. Eu proident proident anim voluptate ad occaecat ullamco proident in cupidatat ex. Aliqua officia proident eu ea dolor non consequat enim anim sint est exercitation deserunt. Officia fugiat sint dolor voluptate laborum eu culpa commodo cupidatat sunt voluptate sint cillum.\r\n",
        "time": 164.8649,
        "completed": true,
        "points": 40
      },
      {
        "name": "Albert Park",
        "id": "64a9eae895d6d9e5b034d47c",
        "description": "Exercitation amet ex pariatur incididunt excepteur aliquip veniam. Do mollit ex pariatur voluptate consectetur qui fugiat laborum reprehenderit dolore do eiusmod aliqua. Minim magna eu in qui dolor Lorem commodo ullamco enim. Aliqua esse officia sit fugiat do officia ea aute veniam eu magna culpa dolor. Incididunt mollit cupidatat mollit aliqua veniam deserunt. Quis et cupidatat cillum velit eiusmod deserunt.\r\n",
        "time": 80.7575,
        "completed": true,
        "points": 18
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae81e6bb05701be5132",
        "description": "Fugiat Lorem aliquip anim id irure voluptate sint est ea consequat adipisicing duis. Id do minim veniam officia sit aliqua et in. Aute commodo velit cupidatat aute. Tempor ipsum sunt est duis eiusmod. Fugiat sint ad ut pariatur labore dolore sint magna est ipsum veniam aliqua. Duis ut eu aute occaecat commodo tempor sint.\r\n",
        "time": 97.6088,
        "completed": true,
        "points": 17
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8307ce75703263285",
        "description": "Velit id nisi aliquip ex anim laboris adipisicing dolor nisi ea cupidatat voluptate et. Consectetur amet et pariatur enim tempor laborum fugiat culpa. Reprehenderit exercitation sunt cillum et laborum mollit. Laborum fugiat et sit do aliqua qui ex.\r\n",
        "time": 127.1707,
        "completed": true,
        "points": 54
      }
    ]
  },
  {
    "id": "64a9eae8b09b2ecb1ed574ee",
    "name": "Pena Herman",
    "steps": 93273,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Maraetai Beach",
        "id": "64a9eae8ae43378645df3fe7",
        "description": "Non voluptate cupidatat id aute mollit commodo irure veniam duis commodo consectetur duis. Mollit laborum Lorem occaecat voluptate amet deserunt culpa minim nisi voluptate. Voluptate deserunt elit esse velit veniam ut amet esse ipsum laborum ipsum quis ipsum exercitation. Laborum eu cupidatat fugiat culpa sit dolor est dolor velit ea ad.\r\n",
        "time": 169.5012,
        "completed": true,
        "points": 82
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9eae82fba5b3087a95564",
        "description": "Id aliquip anim veniam non non ea duis anim. Ut Lorem minim non magna adipisicing mollit voluptate elit culpa laboris dolore dolore. Aliqua do minim do voluptate officia minim in. Elit eiusmod aliqua ut excepteur fugiat fugiat ad non.\r\n",
        "time": 51.3782,
        "completed": true,
        "points": 61
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9eae844f3f93298e4964a",
        "description": "Magna tempor fugiat dolore cillum in occaecat commodo officia ut amet. Nisi duis do labore ad veniam commodo cillum et sunt ex officia ex id ut. Qui exercitation ullamco sit Lorem ea officia cupidatat. Ad labore fugiat amet nulla irure id cillum enim. Qui tempor incididunt qui sint do qui.\r\n",
        "time": 128.1955,
        "completed": true,
        "points": 66
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae8edf0287a76e5ea50",
        "description": "Deserunt proident ea quis tempor dolor irure. Nostrud dolore nulla eu do. Voluptate occaecat aliquip ad voluptate ut reprehenderit aliquip officia culpa nulla ipsum cupidatat aliquip. Ullamco cillum veniam voluptate non proident ea cillum sunt ex irure adipisicing ut. Dolore pariatur excepteur esse dolore officia esse eu. Mollit nostrud ut sit duis adipisicing cillum magna sit ea.\r\n",
        "time": 63.9569,
        "completed": true,
        "points": 61
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9eae8fed1a9fdc2755fc6",
        "description": "Aliquip eu ad labore aliqua proident elit reprehenderit. Eu aliqua reprehenderit amet dolor. Excepteur ut ea et amet nulla proident sit irure tempor adipisicing consequat consectetur.\r\n",
        "time": 139.6192,
        "completed": true,
        "points": 40
      },
      {
        "name": "Takapuna",
        "id": "64a9eae8da5867faa9ad799c",
        "description": "Irure in qui fugiat sint consectetur irure Lorem anim cupidatat dolor esse culpa sunt. Do deserunt voluptate magna ut fugiat eu ea. Labore quis laboris tempor excepteur. Amet cupidatat amet sint Lorem deserunt in.\r\n",
        "time": 74.8595,
        "completed": true,
        "points": 11
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9eae869f18fa85d1d123e",
        "description": "Ea ad laboris fugiat ex id minim qui exercitation do officia cillum proident qui. Irure est nisi sit do ex tempor id reprehenderit adipisicing officia ut voluptate. Sint sunt consectetur sit culpa amet ipsum irure ex occaecat ut nostrud velit incididunt. Elit et aliquip sit anim labore non esse Lorem tempor. Do ex fugiat veniam magna minim ullamco excepteur labore veniam voluptate aliqua. Velit tempor aute irure nisi qui adipisicing dolore laboris.\r\n",
        "time": 32.9463,
        "completed": true,
        "points": 52
      },
      {
        "name": "Devonport",
        "id": "64a9eae84bac4861780bc39d",
        "description": "Aliqua culpa duis amet minim aliquip aliqua cupidatat officia velit. Laboris esse cupidatat excepteur mollit minim ullamco elit nostrud excepteur. Lorem nisi reprehenderit tempor laborum veniam dolore magna qui anim cillum cillum eiusmod excepteur nostrud. Esse do voluptate esse irure consequat. Officia aliqua nulla eu velit irure laborum id sunt. In laborum nisi proident exercitation proident laborum excepteur esse duis.\r\n",
        "time": 52.1092,
        "completed": true,
        "points": 50
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae8e027c29880ca6a11",
        "description": "In fugiat tempor Lorem nostrud laborum laborum occaecat commodo cillum laborum. Quis et quis id elit laborum commodo id. Aliqua velit nostrud magna adipisicing ea eu aliquip.\r\n",
        "time": 73.4164,
        "completed": true,
        "points": 49
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9eae822663bcbf98ad883",
        "description": "Amet incididunt excepteur duis enim elit fugiat nulla elit anim esse aliqua labore occaecat dolor. Aute quis mollit ullamco amet tempor aliqua. Veniam qui qui non consequat sunt enim in excepteur velit in deserunt culpa adipisicing dolore. Consequat do anim proident incididunt excepteur minim. Aute consectetur laborum aute enim duis duis tempor ut adipisicing elit. Amet magna qui quis veniam officia mollit et ea qui. Esse ad ut anim pariatur deserunt adipisicing anim consequat cillum ea in tempor deserunt.\r\n",
        "time": 71.8634,
        "completed": true,
        "points": 90
      }
    ]
  },
  {
    "id": "64a9eae8711d9a6ee3dbb48f",
    "name": "Lana Bowers",
    "steps": 49261,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Cornwall Park",
        "id": "64a9eae8c698559cdb17a1dd",
        "description": "Irure eiusmod veniam eiusmod eiusmod velit voluptate dolore veniam mollit fugiat sit quis duis. Magna duis mollit ea excepteur eiusmod aliqua. Eiusmod laborum veniam laboris aliquip excepteur.\r\n",
        "time": 185.5646,
        "completed": true,
        "points": 89
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae85dc74ec36b16fc94",
        "description": "Amet cupidatat nulla ut quis voluptate tempor laborum ex exercitation est do laborum consectetur. Laborum mollit duis laborum ex qui consequat laborum proident sit nisi eiusmod sint mollit. Labore aliquip ut aliqua Lorem ad et consectetur. Irure deserunt culpa veniam incididunt pariatur ad pariatur laborum elit pariatur qui. Ad pariatur dolore commodo ut culpa elit enim voluptate tempor adipisicing ad dolor. Proident mollit minim mollit laborum do aliqua laborum ea.\r\n",
        "time": 176.1093,
        "completed": true,
        "points": 49
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae8f92ee221015f072c",
        "description": "Est reprehenderit consectetur laborum aliqua ut commodo. Quis nostrud elit ea exercitation. Commodo anim do eiusmod fugiat cillum anim culpa laborum commodo occaecat cupidatat voluptate.\r\n",
        "time": 80.4786,
        "completed": true,
        "points": 76
      },
      {
        "name": "Devonport",
        "id": "64a9eae8a742ebff130f9188",
        "description": "Duis ea quis adipisicing enim eu ipsum est cillum cillum nisi. Incididunt proident incididunt id eiusmod cupidatat in do reprehenderit aute ut aute dolor pariatur occaecat. Labore aute eiusmod ex et velit officia tempor in nisi enim. Do aliquip eu elit eiusmod cupidatat.\r\n",
        "time": 129.9915,
        "completed": true,
        "points": 50
      },
      {
        "name": "Mount Eden",
        "id": "64a9eae8db473d87545a9951",
        "description": "Dolor tempor excepteur esse nisi qui in non enim eu excepteur eiusmod dolore. Esse et anim non commodo culpa anim culpa cillum ex nulla cupidatat. Nostrud veniam excepteur ad exercitation quis consectetur nostrud excepteur velit. Laborum dolore reprehenderit ullamco aliqua officia excepteur eu eiusmod consequat exercitation culpa. Quis ex tempor velit cillum. Voluptate culpa aliquip dolor est consectetur.\r\n",
        "time": 191.8271,
        "completed": true,
        "points": 73
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae87297fb9cded6f452",
        "description": "Eiusmod ut in ad in consectetur adipisicing magna magna laboris dolor amet. Consectetur est anim aliquip labore in minim ea ipsum laboris. Commodo veniam enim eiusmod anim id culpa ad incididunt eiusmod commodo ex culpa esse ullamco.\r\n",
        "time": 189.4681,
        "completed": true,
        "points": 99
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8306637ccf7776c81",
        "description": "Velit aliqua esse est labore laborum aute consectetur minim. Quis occaecat ipsum sit mollit occaecat sunt ea voluptate aute. Duis adipisicing exercitation elit incididunt dolore commodo. Officia laborum ea culpa amet consequat tempor id excepteur velit et dolore minim aliqua non. Do sint nisi incididunt id est duis ullamco adipisicing eu nulla reprehenderit ullamco esse est. Proident sunt id velit pariatur quis velit commodo. Ea anim fugiat adipisicing exercitation mollit ipsum.\r\n",
        "time": 71.4279,
        "completed": true,
        "points": 48
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae812b3d31d37dbd8b3",
        "description": "Ad aliqua esse cupidatat anim eiusmod ut. Incididunt id minim ipsum reprehenderit dolor nisi adipisicing. Cupidatat veniam est ex mollit duis aliqua laboris nulla. Eu mollit pariatur aute do aute fugiat commodo occaecat nisi deserunt ut. Exercitation elit deserunt elit esse consequat ut eiusmod sunt ea laboris deserunt est. Ea reprehenderit esse aliqua dolor voluptate non officia aliquip occaecat do elit.\r\n",
        "time": 142.5577,
        "completed": true,
        "points": 36
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae80f5fbcc26f6787c1",
        "description": "Sint sint do esse in exercitation laborum eiusmod cupidatat in sit laboris occaecat aliqua dolor. Reprehenderit culpa non laborum laborum irure aliquip. In nisi ullamco id aliqua. Commodo do consectetur enim cupidatat elit fugiat sit irure labore duis aute veniam do. Lorem magna esse eiusmod fugiat amet ex exercitation est laborum sint ipsum exercitation esse.\r\n",
        "time": 101.4918,
        "completed": true,
        "points": 80
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae84ad58b66cd75ac92",
        "description": "Tempor eu ut in labore sint. Qui incididunt sint reprehenderit cillum adipisicing. Ullamco sunt labore esse dolor officia eu sunt excepteur nulla laborum Lorem laboris exercitation. Esse culpa nostrud eu officia in reprehenderit mollit pariatur nostrud veniam deserunt officia.\r\n",
        "time": 181.6864,
        "completed": true,
        "points": 90
      }
    ]
  },
  {
    "id": "64a9eae8a33f264d7bf58157",
    "name": "Phelps Guerra",
    "steps": 10406,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Museum",
        "id": "64a9eae8cb27adbb4827a015",
        "description": "Officia cupidatat veniam commodo minim veniam magna. Voluptate nulla labore enim elit et et Lorem excepteur veniam. Anim elit est proident sit elit ex veniam. Sit sunt sint aliquip excepteur enim qui minim nulla tempor voluptate sit. Sint elit dolor amet culpa amet sint culpa proident pariatur cillum aliquip adipisicing.\r\n",
        "time": 64.64,
        "completed": true,
        "points": 26
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8afc32c3c8a055d2f",
        "description": "Commodo labore aliquip ad do exercitation aute id laborum eiusmod ut elit culpa est. Id in cupidatat reprehenderit proident dolor. Laboris consequat sint Lorem ut. Culpa reprehenderit amet do mollit nostrud velit magna. Eu pariatur consequat eiusmod veniam irure id Lorem laboris commodo consequat ullamco do deserunt duis. Est sint et laboris do Lorem Lorem.\r\n",
        "time": 194.0366,
        "completed": true,
        "points": 66
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9eae81f407764ca83c5ec",
        "description": "Laborum deserunt irure pariatur enim sit occaecat eiusmod anim velit laboris irure in sunt tempor. Minim consectetur sit magna sunt cillum tempor consequat ullamco. Est mollit Lorem tempor sunt magna. Fugiat qui laborum sit ad. Commodo sint deserunt cupidatat quis enim laborum.\r\n",
        "time": 192.1083,
        "completed": true,
        "points": 28
      },
      {
        "name": "Auckland Domain",
        "id": "64a9eae826544c60dc0e8ff5",
        "description": "Laboris commodo aliqua nostrud minim mollit mollit. Sunt ipsum in ut mollit. Ipsum ullamco veniam adipisicing aliqua magna quis nisi ea consequat non qui. Reprehenderit ex esse et officia adipisicing enim amet ad laboris exercitation.\r\n",
        "time": 107.6351,
        "completed": true,
        "points": 54
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae8b66678efecf581b2",
        "description": "Pariatur dolore aliquip ex exercitation nisi dolor nisi. Mollit fugiat excepteur quis sit ut aliquip eiusmod id eiusmod irure exercitation. Et eiusmod non do pariatur ipsum. Sint laboris quis commodo qui laborum eiusmod fugiat culpa veniam. Reprehenderit ipsum tempor fugiat labore. Cupidatat anim cillum dolor ea elit enim sit eu pariatur exercitation exercitation duis elit non. Consequat aliquip qui duis eu sit elit irure anim deserunt.\r\n",
        "time": 123.6677,
        "completed": true,
        "points": 40
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9eae842ad59fe627386c3",
        "description": "Ipsum fugiat sit dolor nulla ut laborum est nisi tempor. Esse velit deserunt fugiat ullamco. Officia aliqua mollit esse nisi deserunt labore pariatur. Tempor ullamco sit enim minim aliqua tempor ipsum labore sit magna ipsum. Non ipsum labore dolor magna non quis anim pariatur officia laboris ut anim amet sunt. Fugiat dolore qui laboris reprehenderit fugiat fugiat officia et dolor aliquip cupidatat voluptate do eiusmod.\r\n",
        "time": 7.9479,
        "completed": true,
        "points": 96
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae85b889b23c4c2988d",
        "description": "Aute nulla deserunt qui mollit eiusmod tempor cillum est elit laboris officia cillum. Proident culpa tempor aliqua velit est dolor non eiusmod proident et. Amet sunt pariatur incididunt velit laborum.\r\n",
        "time": 2.4319,
        "completed": true,
        "points": 56
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae82f3e9814a7e04610",
        "description": "Nisi tempor ea veniam et ex reprehenderit ut sit nostrud aliquip aliqua laboris. Consequat consectetur eiusmod fugiat Lorem duis laboris amet id cillum. Duis officia excepteur eu pariatur aliquip reprehenderit mollit officia ex anim. Sit nostrud officia elit anim duis excepteur sint incididunt ea pariatur non non nulla. Pariatur sint ea dolor enim. Dolor nulla ullamco deserunt incididunt nostrud qui non adipisicing in.\r\n",
        "time": 37.176,
        "completed": true,
        "points": 45
      },
      {
        "name": "Devonport",
        "id": "64a9eae8b3231fead9af263c",
        "description": "Ad eiusmod proident do mollit elit. Quis culpa magna aliqua culpa eiusmod. Exercitation est eu sunt eiusmod incididunt aute consequat reprehenderit minim eu. Veniam laboris officia et irure ex minim excepteur aute occaecat fugiat ad magna minim. Mollit quis deserunt ipsum aliquip. Elit ex in aute quis. Eu exercitation ullamco quis non in irure enim.\r\n",
        "time": 134.4432,
        "completed": true,
        "points": 25
      }
    ]
  },
  {
    "id": "64a9eae8bd2e293fbcc9d5a2",
    "name": "Mariana Cortez",
    "steps": 70651,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Parnell",
        "id": "64a9eae896ba3f04e95bbd8b",
        "description": "Incididunt qui dolor deserunt esse aliqua labore et fugiat adipisicing. Dolore excepteur et eu tempor fugiat ea sunt in laborum dolor Lorem consectetur nostrud. Voluptate non proident culpa do aliqua cupidatat veniam Lorem. Deserunt laboris sint cupidatat veniam.\r\n",
        "time": 48.4215,
        "completed": true,
        "points": 36
      },
      {
        "name": "Queen Street",
        "id": "64a9eae884e7c1a1dc7c2595",
        "description": "Ad consequat excepteur veniam sit et exercitation eiusmod. Dolor sint fugiat do ad velit veniam aliquip voluptate cupidatat anim adipisicing. Esse ea dolor fugiat cillum nostrud tempor incididunt minim quis anim veniam minim nisi. Do ut non pariatur dolor tempor dolor eiusmod voluptate ut eiusmod irure mollit minim. Magna laborum voluptate esse eu exercitation eu reprehenderit cillum pariatur esse laborum officia culpa elit.\r\n",
        "time": 164.0639,
        "completed": true,
        "points": 51
      },
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9eae8297b611a12425556",
        "description": "Minim magna labore exercitation adipisicing sint ullamco Lorem occaecat consectetur mollit veniam. Officia ea duis voluptate irure officia laboris nostrud labore. Nulla elit est eiusmod in dolor labore occaecat sunt laborum non. Aliquip qui id esse consequat enim laborum deserunt tempor proident. Minim velit mollit minim ut Lorem. Ex reprehenderit sunt ut nulla sunt non magna dolor nulla nostrud.\r\n",
        "time": 198.2922,
        "completed": true,
        "points": 42
      },
      {
        "name": "Orewa Beach",
        "id": "64a9eae83fbaadd605136016",
        "description": "Pariatur occaecat do exercitation dolore excepteur eu aliqua laborum et. Anim dolore eiusmod id cupidatat sit proident quis exercitation quis nostrud labore excepteur quis quis. Est ad officia magna labore esse incididunt do duis in velit consectetur adipisicing quis nisi. Enim consequat mollit mollit proident commodo magna esse anim pariatur. Exercitation enim sunt sint esse adipisicing.\r\n",
        "time": 23.0724,
        "completed": true,
        "points": 80
      },
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9eae8ca89c793787b4c03",
        "description": "Id occaecat nostrud nostrud voluptate exercitation ad mollit et ea adipisicing aliqua aliqua nulla eiusmod. Dolor labore aliquip occaecat mollit et. Et qui sunt exercitation nulla proident eu proident.\r\n",
        "time": 45.9495,
        "completed": true,
        "points": 70
      },
      {
        "name": "Piha Beach",
        "id": "64a9eae89fba89283a4aafef",
        "description": "Velit amet amet eu non do ex enim eu dolore minim proident occaecat. Magna cupidatat amet duis esse duis amet consequat ullamco occaecat ea officia. Dolor mollit quis dolore tempor quis culpa ex.\r\n",
        "time": 152.4016,
        "completed": true,
        "points": 85
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae8eee411c2ee68c609",
        "description": "Quis ex incididunt eiusmod nisi ad deserunt amet. Non Lorem esse laborum ex esse. Deserunt commodo ea proident minim dolore. Minim amet dolore ex ipsum commodo pariatur consequat. Enim anim est velit Lorem quis amet excepteur adipisicing incididunt. Consectetur tempor consequat do amet proident consequat veniam enim.\r\n",
        "time": 162.1776,
        "completed": true,
        "points": 48
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9eae8269a7547b94ee89c",
        "description": "Tempor amet dolore adipisicing ut. Incididunt fugiat minim sint occaecat ipsum irure. Irure aliquip do reprehenderit est sunt veniam. Quis sint ad occaecat aliquip non. Aute excepteur ipsum velit consequat aliquip minim fugiat nostrud ex cupidatat dolore voluptate amet. Dolore labore consectetur in occaecat quis. Anim irure labore excepteur excepteur in.\r\n",
        "time": 177.4828,
        "completed": true,
        "points": 25
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8149191903c852e28",
        "description": "Nisi enim laborum do eiusmod quis cillum amet aliquip. Ipsum ullamco eiusmod commodo eu minim cupidatat sint non eu laboris. Labore esse enim ullamco reprehenderit irure ut fugiat ullamco. Culpa nisi anim sint et anim incididunt voluptate fugiat tempor voluptate. Non exercitation eu fugiat cillum Lorem eu quis quis cillum cillum enim veniam commodo eu.\r\n",
        "time": 140.2678,
        "completed": true,
        "points": 64
      }
    ]
  },
  {
    "id": "64a9eae8c79652318de67f1c",
    "name": "Mercer Benton",
    "steps": 79956,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8408bdf690f36fa6f",
        "description": "Consequat culpa culpa cillum pariatur laborum cillum non nostrud. Enim proident duis sint nostrud officia ipsum culpa et quis consequat enim est. Ipsum cupidatat commodo aliqua commodo velit incididunt Lorem aute aliqua in commodo. Exercitation qui esse veniam sit irure qui tempor et voluptate nulla in ad excepteur sint. Do aliquip sunt elit irure voluptate est. Cupidatat eu enim duis duis adipisicing qui occaecat fugiat enim officia fugiat velit. Enim ut magna ex Lorem tempor Lorem incididunt labore deserunt ipsum ea nulla duis.\r\n",
        "time": 97.4887,
        "completed": true,
        "points": 92
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae8a28cfabd79a47535",
        "description": "Irure sunt cillum cupidatat fugiat. Quis in velit adipisicing minim adipisicing ipsum. Esse laboris consequat velit dolore exercitation deserunt. Anim sint veniam aliquip consectetur enim nulla magna esse proident qui officia. Enim nisi laborum tempor id dolor officia Lorem adipisicing Lorem labore esse mollit nostrud. Pariatur commodo consectetur reprehenderit velit occaecat.\r\n",
        "time": 22.1974,
        "completed": true,
        "points": 84
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae8e9c711ee66029ad5",
        "description": "Pariatur nostrud irure deserunt minim reprehenderit sunt qui voluptate elit. Ullamco eu officia anim cillum sint excepteur sunt non sint. Consectetur cillum ipsum ex proident sit laboris nostrud aliqua dolore enim. Fugiat eiusmod occaecat laboris est duis.\r\n",
        "time": 114.345,
        "completed": true,
        "points": 82
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8d6a7af538bd19760",
        "description": "Laborum sit aliqua sunt aliqua fugiat pariatur dolore eu nulla esse sunt excepteur. Eiusmod in est excepteur culpa proident excepteur exercitation esse reprehenderit nostrud amet incididunt in. Proident esse do ad irure eu in qui mollit exercitation esse amet proident aliqua culpa. Veniam cillum dolor mollit excepteur esse sit.\r\n",
        "time": 42.135,
        "completed": true,
        "points": 74
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8fb886141068ed15f",
        "description": "Lorem Lorem adipisicing officia aliqua. Laborum eu dolor aliquip adipisicing Lorem deserunt eiusmod qui. Voluptate elit qui culpa ad. Non consectetur Lorem velit reprehenderit sint pariatur. Incididunt do elit mollit nostrud est magna commodo. Officia amet nulla sint sit id nisi enim. Pariatur minim occaecat voluptate amet aute duis esse ex laborum amet laboris enim minim duis.\r\n",
        "time": 34.2265,
        "completed": true,
        "points": 40
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8797a36a729955f64",
        "description": "Magna eiusmod elit do pariatur do fugiat commodo mollit non. Velit consectetur do amet enim esse ipsum adipisicing dolore velit quis sint deserunt velit pariatur. Quis sint anim ullamco ex tempor ex tempor voluptate culpa incididunt incididunt quis eu cupidatat. Velit et cupidatat non sint occaecat officia eu aliquip esse magna elit veniam duis esse. Incididunt ex veniam nisi ad labore id esse minim cupidatat do do ipsum mollit.\r\n",
        "time": 119.3451,
        "completed": true,
        "points": 69
      },
      {
        "name": "Silo Park",
        "id": "64a9eae82547fde0d581b8a3",
        "description": "Ex ipsum veniam amet do dolor. Aliquip sunt labore adipisicing consequat do tempor nisi nisi mollit. Nulla do esse tempor aliqua. Id mollit sunt tempor in voluptate id aliqua ea reprehenderit ut laboris laboris magna.\r\n",
        "time": 63.2743,
        "completed": true,
        "points": 34
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9eae877a40f2db89aef8f",
        "description": "Velit est reprehenderit minim deserunt officia irure ad ipsum irure proident excepteur cupidatat. Occaecat nostrud nostrud enim laborum velit laboris aute tempor veniam ad consequat. Exercitation est proident eiusmod mollit nostrud aliqua adipisicing ut duis ex. Excepteur ad amet tempor laborum dolor nisi id culpa eu officia non ullamco non duis. Commodo deserunt cupidatat ex anim officia ullamco ullamco fugiat cupidatat reprehenderit in fugiat. Deserunt ex minim culpa amet minim qui mollit sunt ullamco proident ut.\r\n",
        "time": 31.9936,
        "completed": true,
        "points": 72
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae84c38dae8cf283efa",
        "description": "Ipsum ipsum sunt irure ea amet excepteur nostrud. Aliquip labore sunt minim et in Lorem ullamco non duis anim nostrud dolore ullamco. Culpa qui ex officia ex.\r\n",
        "time": 89.3586,
        "completed": true,
        "points": 48
      }
    ]
  },
  {
    "id": "64a9eae8e39d3c7467c56ee6",
    "name": "Jody Allison",
    "steps": 68350,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae8f0bcb0ae450c75b7",
        "description": "Elit ea labore mollit ad culpa consectetur occaecat anim amet eiusmod amet. Consequat voluptate et dolor id. Nisi id sint velit proident ex id irure.\r\n",
        "time": 136.1514,
        "completed": true,
        "points": 95
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8406239834df90601",
        "description": "Commodo cillum nisi commodo labore pariatur aliqua enim dolor. Qui dolor commodo sunt sit. Commodo exercitation adipisicing ipsum commodo adipisicing duis exercitation ea. Nulla veniam deserunt anim mollit ea qui aliquip veniam laborum officia voluptate occaecat sint Lorem. Magna minim nisi proident reprehenderit mollit id id fugiat. Mollit sunt non aute laborum exercitation laboris fugiat laborum aliquip.\r\n",
        "time": 187.6047,
        "completed": true,
        "points": 32
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae809edae9494f05b60",
        "description": "In enim ipsum occaecat ex exercitation reprehenderit reprehenderit in adipisicing incididunt ad ad. Laborum eiusmod nisi minim voluptate quis nostrud. Irure quis laboris aliqua in. Fugiat ex ad culpa amet. Cupidatat do incididunt ipsum aliqua cupidatat. Laboris excepteur voluptate officia tempor reprehenderit commodo commodo est mollit et velit adipisicing reprehenderit occaecat. Excepteur sunt reprehenderit mollit cillum deserunt proident aute voluptate cillum do qui.\r\n",
        "time": 104.8358,
        "completed": true,
        "points": 21
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae830f26f33dc99c398",
        "description": "Ea laboris irure Lorem esse incididunt amet enim velit amet sint minim. Exercitation sint irure nisi laborum sunt sit sint. Laborum duis ipsum ex ad aute anim consectetur ex enim commodo fugiat ullamco cupidatat. Enim ad aute tempor officia aliquip proident commodo velit nulla nisi dolor ea dolore.\r\n",
        "time": 77.0139,
        "completed": true,
        "points": 67
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8dbc2bd1a413b2789",
        "description": "Incididunt ea adipisicing irure mollit cupidatat. Est velit voluptate esse ipsum laborum incididunt exercitation. Consectetur sunt enim enim adipisicing. Lorem do Lorem mollit incididunt laborum excepteur ipsum occaecat elit magna ullamco. Dolore ipsum sit reprehenderit minim reprehenderit esse aute consequat ullamco. Aliqua aliquip enim irure adipisicing ea aliqua nostrud non.\r\n",
        "time": 116.8822,
        "completed": true,
        "points": 81
      },
      {
        "name": "Silo Park",
        "id": "64a9eae81d6580693614dcc1",
        "description": "Nostrud minim nostrud eiusmod labore pariatur labore est anim et id eiusmod do. Do irure magna aute sunt elit velit tempor. Aute qui sint enim anim. Ea sit magna laboris officia nostrud officia tempor minim.\r\n",
        "time": 134.8464,
        "completed": true,
        "points": 22
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae836651cd7c16334a3",
        "description": "Voluptate quis exercitation commodo qui aute deserunt cupidatat. Nisi deserunt qui ad incididunt quis aute ut culpa consectetur non exercitation aute. Qui minim adipisicing ut aliquip sunt sunt ullamco. Tempor amet do et tempor ex sit consectetur cillum ex elit commodo nostrud. Minim eu nostrud minim proident esse minim Lorem id.\r\n",
        "time": 167.6625,
        "completed": true,
        "points": 97
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae8dcd801ad20671142",
        "description": "Aliqua ea eu incididunt consectetur veniam magna. Excepteur aute adipisicing est occaecat laborum nostrud dolore tempor proident id commodo cillum commodo ipsum. Consectetur fugiat officia dolore veniam aliquip ipsum est et voluptate deserunt.\r\n",
        "time": 18.9091,
        "completed": true,
        "points": 97
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9eae836bf0c7a0531c1ef",
        "description": "Tempor amet aliquip pariatur ullamco reprehenderit. Sunt mollit non excepteur Lorem velit duis. Veniam id consequat non ex tempor fugiat reprehenderit. Eu do amet et aliqua. Lorem deserunt Lorem id aliqua non ut non voluptate laborum. Fugiat non labore ad dolore proident cillum ea occaecat voluptate pariatur. Officia quis culpa id nisi voluptate nisi.\r\n",
        "time": 68.965,
        "completed": true,
        "points": 62
      },
      {
        "name": "Western Springs",
        "id": "64a9eae82b83042296405327",
        "description": "Et sint commodo ad culpa duis. Exercitation quis aliqua sit sint reprehenderit. Irure consequat consectetur culpa velit consectetur id tempor veniam esse velit sint.\r\n",
        "time": 192.637,
        "completed": true,
        "points": 36
      }
    ]
  },
  {
    "id": "64a9eae8e6235252626058a4",
    "name": "Ruby Sweeney",
    "steps": 49040,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9eae8071b324a3fb76716",
        "description": "Deserunt deserunt veniam ad ad veniam sit Lorem exercitation reprehenderit sit nostrud enim magna. Consequat dolor ipsum Lorem sunt reprehenderit labore eiusmod ut minim aliquip exercitation duis nostrud. Fugiat sit duis pariatur incididunt occaecat. Dolor deserunt adipisicing et nulla amet.\r\n",
        "time": 0.5304,
        "completed": true,
        "points": 66
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9eae8e928e2e939a09798",
        "description": "Minim cillum aliqua reprehenderit pariatur exercitation. Aute adipisicing adipisicing cupidatat anim tempor elit ea mollit proident laborum consectetur amet nostrud. Nulla magna nisi tempor ea proident consequat veniam irure dolor minim dolore est ad Lorem. Occaecat occaecat aliquip sit do minim nulla culpa incididunt fugiat nostrud Lorem sit labore. Esse sunt nisi ex duis excepteur duis labore eiusmod anim sunt duis in exercitation. Amet mollit irure adipisicing anim. Reprehenderit minim ipsum sit reprehenderit dolore mollit commodo ea cillum deserunt exercitation.\r\n",
        "time": 130.5002,
        "completed": true,
        "points": 16
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae822e64567749cc8e4",
        "description": "Dolore cupidatat nulla minim elit veniam amet non reprehenderit cupidatat sint nulla dolor. Consequat ad incididunt ex eu reprehenderit officia eu aute ullamco. Ipsum aliquip amet proident officia mollit ut non sint anim officia consectetur ut reprehenderit tempor. Quis nulla proident cillum duis irure non dolor exercitation.\r\n",
        "time": 179.5675,
        "completed": true,
        "points": 60
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae8bc14432d5f3dbf9b",
        "description": "Amet consequat magna duis anim irure ipsum dolor aliquip laboris. Esse incididunt labore fugiat nostrud proident dolor excepteur sunt. Do est reprehenderit adipisicing velit. Veniam mollit sit laborum consectetur anim minim excepteur.\r\n",
        "time": 63.4655,
        "completed": true,
        "points": 82
      },
      {
        "name": "Devonport",
        "id": "64a9eae8c9a3a6f9cbd3dd72",
        "description": "Laborum id deserunt minim veniam sunt mollit eu esse velit fugiat aliqua. Dolore eu amet reprehenderit proident cupidatat adipisicing pariatur ea magna. Magna amet proident occaecat irure excepteur. Aliqua id quis ullamco excepteur consectetur ut aute mollit nostrud non. Est culpa proident incididunt pariatur cillum cupidatat et aute voluptate aliquip proident fugiat ad.\r\n",
        "time": 165.0923,
        "completed": true,
        "points": 89
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9eae883f5413f93d7ebfe",
        "description": "Ex ullamco qui reprehenderit amet labore velit commodo quis consectetur incididunt excepteur aliqua Lorem elit. Officia consectetur non eiusmod occaecat minim. Commodo reprehenderit mollit commodo incididunt tempor sint dolor dolore consequat.\r\n",
        "time": 122.8369,
        "completed": true,
        "points": 88
      },
      {
        "name": "Western Springs",
        "id": "64a9eae8ff8f48fa954cd82c",
        "description": "Laborum deserunt Lorem voluptate sint do eu dolore pariatur sunt occaecat fugiat labore excepteur sunt. Incididunt aliquip ipsum officia anim sunt esse. Voluptate excepteur eiusmod consectetur non. Eiusmod amet eiusmod dolor sint minim est elit et cupidatat reprehenderit aute labore nisi. Eiusmod eu id laborum fugiat elit amet elit ullamco labore cupidatat mollit consequat. Irure tempor Lorem nostrud consequat et officia ad enim labore cupidatat id cupidatat. Cupidatat velit sunt minim pariatur aute proident deserunt velit cupidatat cupidatat commodo consectetur.\r\n",
        "time": 53.1463,
        "completed": true,
        "points": 49
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae89776d2404b8eb8d4",
        "description": "Amet in est pariatur duis sint cupidatat id. Magna Lorem do elit nostrud dolore aute occaecat ex qui. Aute ut mollit aliqua nisi.\r\n",
        "time": 155.8605,
        "completed": true,
        "points": 12
      },
      {
        "name": "Hunua Falls",
        "id": "64a9eae88f4fe57195388619",
        "description": "Ex sint id ad mollit ea adipisicing nisi magna deserunt consectetur. Labore ex adipisicing excepteur aliqua adipisicing est ad proident duis. Culpa dolore ad laboris excepteur id veniam reprehenderit amet cupidatat tempor incididunt consectetur ad nostrud. Sit aute incididunt do in ea sit esse non duis do ex consequat.\r\n",
        "time": 40.1259,
        "completed": true,
        "points": 52
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae89ce2ab4199ad922a",
        "description": "Irure anim sint non dolor nisi incididunt culpa dolor Lorem proident elit esse. Elit ad ullamco duis culpa dolore enim cupidatat eu nulla nostrud commodo nulla. Occaecat excepteur sit cupidatat amet fugiat pariatur commodo deserunt duis duis veniam pariatur ad sit. Nulla in anim adipisicing magna eiusmod est sunt do adipisicing. Aute commodo nostrud Lorem et.\r\n",
        "time": 140.7276,
        "completed": true,
        "points": 99
      }
    ]
  },
  {
    "id": "64a9eae851492e05b3390691",
    "name": "Bell Houston",
    "steps": 19191,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Bethells Beach",
        "id": "64a9eae8d36a5027ca606fd2",
        "description": "Nisi exercitation incididunt deserunt aliqua. Non qui enim sint fugiat eu pariatur cillum. Nulla labore aute occaecat anim est enim consequat aute mollit. Elit aute officia adipisicing nisi voluptate magna.\r\n",
        "time": 79.579,
        "completed": true,
        "points": 74
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9eae8db593f2a05d26abe",
        "description": "Enim non magna laboris Lorem dolore irure. Excepteur anim eiusmod ullamco dolor nostrud. Et sunt eiusmod eu eiusmod deserunt laboris et incididunt. Duis occaecat ut pariatur proident sunt exercitation.\r\n",
        "time": 27.6037,
        "completed": true,
        "points": 82
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9eae8f6ab0995f201d3cb",
        "description": "Lorem exercitation proident aliqua esse nulla duis officia labore cillum sunt. Et adipisicing ipsum incididunt veniam velit elit cupidatat. Anim laborum elit aute velit et aliqua duis ipsum. Anim ipsum dolor pariatur officia.\r\n",
        "time": 67.657,
        "completed": true,
        "points": 65
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8153a7d0f856a452c",
        "description": "Ex anim velit cillum et occaecat eu. Consequat est ea et cupidatat labore anim. Nisi sit officia tempor ipsum anim consequat amet aliquip Lorem anim consectetur sint incididunt. Officia reprehenderit dolore amet anim. Et commodo mollit ea dolor commodo. Dolore ad cupidatat dolor duis do exercitation magna commodo aliquip. Labore non irure quis voluptate mollit do mollit dolor ea cupidatat ut duis est excepteur.\r\n",
        "time": 56.192,
        "completed": true,
        "points": 24
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae86957b6fc478f40ae",
        "description": "In dolore sint in culpa id. Aliquip culpa aliquip ipsum labore fugiat magna. Laborum eu mollit dolore eu aliquip. Id eiusmod proident Lorem sit. Fugiat ex aliqua velit officia ut mollit nisi nisi aliqua tempor consectetur ad veniam minim. Ipsum officia elit magna deserunt excepteur aute qui.\r\n",
        "time": 163.795,
        "completed": true,
        "points": 96
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8a81c17cd012bedf9",
        "description": "Proident et excepteur pariatur sit. Consequat quis qui esse consectetur. Duis id adipisicing non velit laboris deserunt qui occaecat deserunt quis cupidatat fugiat qui.\r\n",
        "time": 62.3756,
        "completed": true,
        "points": 35
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae85039cadf3f99a0be",
        "description": "Aute occaecat aliquip cillum minim excepteur pariatur. Pariatur culpa quis non sunt adipisicing dolor cillum pariatur esse veniam consectetur do cillum culpa. Ad sint velit nostrud et. Veniam ullamco ullamco exercitation officia quis laboris magna nulla et cillum ad fugiat. Aute elit irure reprehenderit dolore ipsum velit occaecat veniam.\r\n",
        "time": 177.4587,
        "completed": true,
        "points": 22
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae86d1d86c0a3beeea0",
        "description": "Adipisicing reprehenderit aliqua veniam ullamco magna sit occaecat cupidatat consequat ea eu reprehenderit tempor. Nulla tempor do culpa veniam ad commodo. Velit esse cupidatat voluptate anim reprehenderit sit anim ullamco. Aliquip dolor Lorem magna cillum minim sint eiusmod magna aliquip aute ad enim amet elit. Cillum nulla ex est irure. Esse incididunt ex occaecat laboris ea officia et.\r\n",
        "time": 59.6955,
        "completed": true,
        "points": 15
      },
      {
        "name": "Auckland Domain",
        "id": "64a9eae8e38b097d5f2f3ebf",
        "description": "Est culpa ad velit pariatur elit. Officia eu duis in aute est ullamco ex Lorem ullamco culpa aliquip commodo ea. Veniam anim ad ut laborum fugiat labore in. Ut adipisicing occaecat laborum aliquip cillum exercitation id est adipisicing. Aliqua eu esse ut incididunt excepteur. Aute ut do dolore sint. Ullamco ut est ut velit et culpa pariatur adipisicing elit nulla sint excepteur ut commodo.\r\n",
        "time": 183.7025,
        "completed": true,
        "points": 78
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae81d1f9e49488e3f5d",
        "description": "Dolor enim dolore do veniam culpa incididunt elit. Ullamco commodo adipisicing ex ipsum officia exercitation quis dolore officia velit. Id magna veniam esse amet tempor do aliqua nulla deserunt reprehenderit. Cillum adipisicing occaecat exercitation ea in sit.\r\n",
        "time": 84.5041,
        "completed": true,
        "points": 91
      }
    ]
  },
  {
    "id": "64a9eae8363ff37737602ee9",
    "name": "Justice Burgess",
    "steps": 68863,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9eae84f788284c9db5695",
        "description": "Anim magna adipisicing do reprehenderit laboris mollit tempor excepteur officia est incididunt ex in commodo. Commodo sit fugiat tempor nisi duis tempor dolore et sint anim ex fugiat aliqua eiusmod. Commodo ipsum labore ad non est nostrud irure dolore duis. Ipsum elit sint irure ipsum incididunt nisi in in aute.\r\n",
        "time": 48.3869,
        "completed": true,
        "points": 99
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9eae8569da9dae36ffed1",
        "description": "Cupidatat non irure veniam ut. Sit adipisicing esse commodo do. Nostrud incididunt eiusmod nulla sunt sunt eiusmod labore officia non est veniam exercitation. Eu esse elit eiusmod eiusmod pariatur irure labore fugiat irure nisi tempor. Laborum non fugiat in in nostrud qui quis et aliquip fugiat voluptate id. Qui quis deserunt laboris cupidatat et nulla cillum. In ipsum cupidatat et aliquip id voluptate id dolore aute proident tempor proident culpa magna.\r\n",
        "time": 179.2674,
        "completed": true,
        "points": 62
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae855a87680e0e82d46",
        "description": "Sit occaecat aliqua voluptate dolor deserunt deserunt eu aliquip in. Non laboris amet veniam nostrud do aliquip consectetur nulla nulla. Consectetur sit proident adipisicing mollit. Cupidatat eu esse ea eu deserunt cillum labore veniam deserunt anim veniam irure ea. Id et ut duis non dolore adipisicing voluptate. Sunt et id ut Lorem Lorem dolore voluptate nisi veniam in deserunt veniam id irure.\r\n",
        "time": 48.0571,
        "completed": true,
        "points": 72
      },
      {
        "name": "Piha Beach",
        "id": "64a9eae8e06d0de0818b38a9",
        "description": "Aliqua et veniam non reprehenderit consectetur velit. Pariatur consectetur incididunt qui Lorem tempor amet et velit voluptate laborum consectetur. Nostrud laboris minim nulla occaecat ad anim labore voluptate qui duis. Do consequat amet cillum id ad. Consectetur tempor occaecat velit dolore officia aute id ut.\r\n",
        "time": 188.0372,
        "completed": true,
        "points": 52
      },
      {
        "name": "Hunua Falls",
        "id": "64a9eae84be4d3671ed3e60e",
        "description": "Irure voluptate eu do quis elit exercitation sunt do labore laboris pariatur sint. Cillum ullamco eiusmod aliquip mollit id exercitation ipsum sit qui. Exercitation excepteur velit esse voluptate eiusmod quis. Fugiat enim et commodo tempor proident et proident in fugiat consequat cillum nisi. Tempor ea dolor labore nostrud amet aliqua aliquip laborum ex.\r\n",
        "time": 172.7495,
        "completed": true,
        "points": 71
      },
      {
        "name": "Takapuna",
        "id": "64a9eae8acce27ab0e9912d4",
        "description": "Cillum ullamco minim eu aliqua consequat eu elit aliquip cupidatat esse. Eiusmod ullamco labore ea dolore. Proident in consectetur id non tempor adipisicing est nisi culpa. Velit occaecat aliquip amet ut voluptate nostrud esse mollit ea dolor velit. Culpa qui eu anim est ad ipsum ut quis ipsum eiusmod non. Ullamco velit quis consectetur amet ut in deserunt. Id ea laboris eu qui esse exercitation quis.\r\n",
        "time": 44.8201,
        "completed": true,
        "points": 35
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9eae8d6eed74aa26ee1a7",
        "description": "Ea aute tempor et cillum et nulla commodo. Reprehenderit aliqua nulla exercitation mollit esse commodo aliquip dolore dolor est qui occaecat. Officia irure tempor ullamco nostrud nisi velit dolor. Nostrud sint mollit elit ipsum excepteur ea qui ipsum eiusmod qui veniam adipisicing incididunt nulla. Sint amet qui nisi commodo consequat laborum dolore ex occaecat laboris elit consequat. Tempor laboris eiusmod voluptate ut eu in duis pariatur labore ullamco veniam deserunt. Magna incididunt laboris amet aliquip reprehenderit culpa enim laborum aliqua sit.\r\n",
        "time": 55.3186,
        "completed": true,
        "points": 13
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae8440c0257d5977cc1",
        "description": "Irure incididunt eiusmod voluptate sint ea cupidatat dolore amet eiusmod aute. Cillum ad minim anim eu aliqua anim quis est ut. Laboris eu ullamco fugiat aliqua ipsum incididunt consectetur occaecat labore sint. Aute laboris mollit ullamco magna anim aute cillum occaecat ut duis exercitation ex nulla.\r\n",
        "time": 39.5167,
        "completed": true,
        "points": 12
      }
    ]
  },
  {
    "id": "64a9eae8df1937f66eef1511",
    "name": "Carey Woodard",
    "steps": 92562,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Wynyard Quarter",
        "id": "64a9eae870e5bf9ff594be21",
        "description": "Incididunt aute ullamco anim eiusmod magna ad incididunt sint. Sint pariatur consequat labore non veniam proident ea ipsum qui ad commodo nisi. Nostrud eu est aliquip proident sit do.\r\n",
        "time": 193.309,
        "completed": true,
        "points": 97
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9eae85b43e0fc79682632",
        "description": "Ad et ex consequat ex dolore incididunt ea nulla Lorem cupidatat officia sint sunt. Ex velit ut incididunt elit. Incididunt ut aute pariatur occaecat consectetur est aliqua quis officia aliqua Lorem pariatur consectetur. Id commodo veniam et cillum.\r\n",
        "time": 108.6107,
        "completed": true,
        "points": 53
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae85b6561d364d7f903",
        "description": "Magna dolore laboris voluptate et proident qui ullamco. Enim sunt eiusmod sit est sint. Aliquip dolore et ipsum enim adipisicing adipisicing et occaecat anim in ad occaecat laborum.\r\n",
        "time": 52.5348,
        "completed": true,
        "points": 91
      },
      {
        "name": "Parnell",
        "id": "64a9eae8de571b17789f8248",
        "description": "Sunt ipsum in cupidatat adipisicing duis. Officia consectetur nisi eu duis voluptate duis cupidatat fugiat exercitation ipsum. Exercitation veniam culpa deserunt anim ad eiusmod.\r\n",
        "time": 68.224,
        "completed": true,
        "points": 20
      },
      {
        "name": "Karekare Beach",
        "id": "64a9eae8c4de8abe3d5ea8d3",
        "description": "Ad nulla est proident ut amet officia Lorem laborum ea sit sit nulla reprehenderit. Ullamco elit cupidatat esse ipsum aute. Proident adipisicing enim ea laborum ad ad velit eu est laborum.\r\n",
        "time": 110.212,
        "completed": true,
        "points": 41
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae886f7d77fff646e62",
        "description": "Eu elit esse occaecat duis dolor nostrud aute minim aliquip proident elit consequat nostrud et. Incididunt quis deserunt ex dolor culpa ex ipsum aute esse sint ea do magna. Incididunt cillum nisi commodo duis. Ea mollit adipisicing occaecat non esse sint tempor magna eu veniam irure in aliqua. Minim do dolor veniam eiusmod incididunt ea.\r\n",
        "time": 104.9286,
        "completed": true,
        "points": 91
      },
      {
        "name": "Auckland Museum",
        "id": "64a9eae8bef3f0f3c7d5cae9",
        "description": "Eiusmod tempor quis nisi veniam laboris Lorem officia sint incididunt cillum dolor cillum deserunt. Duis magna elit laborum dolor dolor consectetur nulla magna. Sit fugiat sit occaecat eu laborum consectetur commodo elit excepteur amet sit. Cupidatat aliqua sunt qui excepteur quis. Et aute do irure non minim culpa duis excepteur magna minim reprehenderit. Elit sit officia voluptate commodo incididunt. Culpa aliqua esse ullamco non in Lorem.\r\n",
        "time": 90.6799,
        "completed": true,
        "points": 77
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9eae81425c517d2b71fa5",
        "description": "Tempor exercitation deserunt esse deserunt dolor commodo sint aute aute officia voluptate laboris reprehenderit. Nostrud amet amet cupidatat sint commodo aliquip cupidatat nisi amet deserunt cillum consequat. Eu veniam ipsum sit sunt cupidatat eiusmod.\r\n",
        "time": 52.2574,
        "completed": true,
        "points": 69
      }
    ]
  },
  {
    "id": "64a9eae85a0216091cd7327e",
    "name": "Susan Humphrey",
    "steps": 80988,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Muriwai Beach",
        "id": "64a9eae826d5958ac45d8b8a",
        "description": "Quis anim aliquip laborum nisi consectetur. Consectetur qui veniam Lorem ipsum occaecat voluptate aliquip. Deserunt labore magna cillum tempor ipsum deserunt velit. Cupidatat esse quis dolor aute veniam.\r\n",
        "time": 60.4941,
        "completed": true,
        "points": 55
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae8e25eaf1f7a240bbf",
        "description": "Consectetur reprehenderit amet culpa do deserunt id elit. Est duis tempor sunt Lorem commodo Lorem dolor quis sit enim cillum. In pariatur mollit deserunt anim mollit duis dolor ut voluptate.\r\n",
        "time": 12.5655,
        "completed": true,
        "points": 10
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae81bd72ae1fde2fc12",
        "description": "Dolore magna deserunt fugiat quis deserunt commodo deserunt magna id nostrud cillum. Velit est in cupidatat ex culpa aliqua. Duis adipisicing irure aliquip eu irure. Labore incididunt dolor culpa ut deserunt. Labore consectetur eiusmod culpa dolor quis dolor non Lorem consequat ullamco id qui duis. Officia dolor irure mollit non anim nostrud sint dolore occaecat ullamco labore labore. Ad ad deserunt veniam nulla duis.\r\n",
        "time": 127.2244,
        "completed": true,
        "points": 20
      },
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9eae8b35334c1cf1ee60e",
        "description": "Incididunt veniam est officia mollit et culpa non id elit ut consequat cupidatat non. Id nisi aliqua consectetur nostrud laboris laboris cillum anim est consequat aliquip sit. Esse et sunt reprehenderit ex. Quis sint elit velit aliqua laboris dolor aliqua est anim minim incididunt do dolore.\r\n",
        "time": 93.4535,
        "completed": true,
        "points": 78
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae883bb8eeed51d36c8",
        "description": "Eiusmod aliqua labore veniam occaecat duis esse duis culpa laboris sit. Magna dolor tempor minim nisi nostrud proident ad sit ad. Laborum consequat ullamco laborum ea officia sunt consectetur eu eiusmod nulla eu voluptate Lorem minim. Cillum amet non esse pariatur sint excepteur. Nulla sit ea esse irure mollit Lorem est exercitation ipsum.\r\n",
        "time": 38.3683,
        "completed": true,
        "points": 24
      },
      {
        "name": "Karekare",
        "id": "64a9eae8ec78041c287e7c1c",
        "description": "Cupidatat ad qui ut anim nostrud nisi officia reprehenderit. Aliqua officia labore velit ipsum amet ea officia amet aliquip amet. Esse fugiat amet ad duis voluptate exercitation consequat incididunt incididunt id ut. Officia culpa minim sint adipisicing ut. Nostrud ipsum qui enim est enim aute enim veniam non eiusmod non. Culpa fugiat quis consectetur consectetur officia ut fugiat pariatur sint esse duis ex eu. Aliqua labore ullamco excepteur consectetur fugiat incididunt cillum est elit velit culpa culpa nulla velit.\r\n",
        "time": 109.938,
        "completed": true,
        "points": 22
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae8695beadb4b3bd05f",
        "description": "Lorem voluptate voluptate id Lorem voluptate sunt occaecat enim laboris laboris mollit. Non sit cupidatat culpa aliqua ipsum sit nisi id cupidatat. Irure occaecat dolore dolor Lorem commodo fugiat labore pariatur.\r\n",
        "time": 153.6358,
        "completed": true,
        "points": 66
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8c79cb68649da2431",
        "description": "Eiusmod Lorem nostrud proident consectetur proident occaecat ullamco fugiat consequat excepteur enim sint duis. Commodo consequat irure mollit velit laborum ex. Nulla minim excepteur consequat ullamco. Amet anim et reprehenderit eiusmod laboris enim. Amet ad sit ex elit aute ex exercitation eu cupidatat Lorem occaecat do eiusmod. Elit sunt eiusmod quis aliqua consequat quis consectetur enim ea irure mollit amet.\r\n",
        "time": 54.098,
        "completed": true,
        "points": 18
      },
      {
        "name": "Parnell",
        "id": "64a9eae8358ef8e043d7635c",
        "description": "Aliqua ut nostrud reprehenderit magna in reprehenderit culpa tempor. Mollit eiusmod amet irure pariatur eiusmod occaecat consectetur veniam laborum incididunt. Laboris mollit esse eu veniam labore esse consectetur aliqua voluptate magna excepteur nisi eiusmod. In qui deserunt anim laborum consequat excepteur consequat. Ex esse commodo exercitation voluptate amet magna fugiat exercitation tempor qui dolor et eu ullamco. Consectetur excepteur dolor nostrud incididunt anim labore.\r\n",
        "time": 139.7529,
        "completed": true,
        "points": 74
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae89262ab49f442bc67",
        "description": "Ex aute officia enim cupidatat nostrud ullamco aliquip qui consectetur tempor amet et. Nisi id mollit occaecat est minim veniam ipsum Lorem ad nulla proident. Labore velit cupidatat mollit occaecat in in adipisicing ullamco laborum laborum.\r\n",
        "time": 187.1781,
        "completed": true,
        "points": 84
      }
    ]
  },
  {
    "id": "64a9eae843bf3e7bd5a63af4",
    "name": "Blair Carr",
    "steps": 2168,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae8e14d76ecf126c6be",
        "description": "Et dolor velit Lorem irure laboris nostrud culpa laboris. Sint labore ad dolore amet quis sit occaecat amet dolore ea Lorem. Et nisi laborum mollit deserunt aliqua officia. Culpa voluptate est elit occaecat minim consectetur esse cillum ea voluptate.\r\n",
        "time": 137.4906,
        "completed": true,
        "points": 22
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae846f5ad63f66f52d9",
        "description": "Do elit dolore et adipisicing id proident. Esse veniam id irure nostrud ipsum. Esse elit irure minim magna consectetur anim. Labore quis eu eu ipsum do elit tempor sit nostrud amet id dolore duis laborum. Adipisicing pariatur reprehenderit commodo exercitation qui qui elit exercitation laborum sunt. Do laboris aliquip culpa nostrud labore eiusmod sint et.\r\n",
        "time": 131.1415,
        "completed": true,
        "points": 86
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae84848e404692c8240",
        "description": "Occaecat in magna consequat dolor voluptate fugiat mollit magna sunt labore velit. Ipsum enim commodo aliquip deserunt proident quis. Id enim dolor laborum amet enim et ad quis.\r\n",
        "time": 103.6699,
        "completed": true,
        "points": 55
      },
      {
        "name": "Silo Park",
        "id": "64a9eae8b0bf5358d9c0966b",
        "description": "Tempor proident ullamco excepteur exercitation id veniam esse eiusmod elit exercitation esse aute magna. Esse amet adipisicing sint aliqua dolore minim irure. Est consectetur proident qui amet mollit dolore dolore commodo nisi nisi anim mollit.\r\n",
        "time": 149.6088,
        "completed": true,
        "points": 71
      },
      {
        "name": "Maraetai Beach",
        "id": "64a9eae86f110d0c99eb9dc4",
        "description": "Duis aliqua ut aliquip laborum laborum deserunt nulla. In adipisicing adipisicing dolor enim dolor excepteur. Occaecat sint pariatur aliqua anim laboris sunt minim consectetur ut laboris mollit.\r\n",
        "time": 75.6561,
        "completed": true,
        "points": 43
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae84e4282248267b32d",
        "description": "Veniam aliquip excepteur ut consequat consectetur occaecat sit ea reprehenderit dolor qui. Minim commodo pariatur consequat exercitation aliquip. Laborum non officia officia eiusmod nisi amet consectetur adipisicing pariatur ea qui. Irure ea incididunt incididunt eiusmod sit eiusmod veniam ex eiusmod irure minim tempor anim. Nulla nostrud ex sint laboris ad in cupidatat cupidatat.\r\n",
        "time": 108.5093,
        "completed": true,
        "points": 88
      },
      {
        "name": "Takapuna",
        "id": "64a9eae8a339f77eae1f571d",
        "description": "Duis Lorem culpa ea sunt. Proident irure excepteur fugiat cillum ad mollit quis magna sunt sint ut quis. Dolor incididunt sunt cillum eiusmod. Veniam Lorem sunt labore irure pariatur ut. Culpa officia in consectetur ex laborum consectetur minim esse reprehenderit. Magna ullamco non quis sint tempor consectetur pariatur nisi. Reprehenderit labore laborum deserunt ad.\r\n",
        "time": 128.6779,
        "completed": true,
        "points": 40
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae8455896015a4a81ab",
        "description": "Incididunt exercitation fugiat nulla aliqua minim ex ullamco consequat in quis anim proident reprehenderit reprehenderit. Aliquip esse minim magna qui tempor veniam occaecat laborum sint. Deserunt aliquip labore nisi culpa culpa qui laborum veniam sunt sunt incididunt anim. Veniam proident enim elit laborum eiusmod duis. Mollit reprehenderit cillum aliqua minim enim sit commodo cupidatat ea mollit anim.\r\n",
        "time": 184.4644,
        "completed": true,
        "points": 93
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae8db77d4673702e535",
        "description": "Id minim officia elit enim duis veniam est aliquip est do commodo esse mollit occaecat. Ea eiusmod commodo cillum ullamco adipisicing pariatur aliquip eiusmod eu magna anim ad. Elit cupidatat labore esse amet cillum laboris ex laboris. Consequat sint sunt ex aute non ipsum non sunt nostrud velit excepteur aliqua. Proident cillum qui Lorem ea velit reprehenderit duis labore labore culpa.\r\n",
        "time": 48.2762,
        "completed": true,
        "points": 79
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae89a3324a6275865a8",
        "description": "Do nulla ipsum duis sunt. Ad adipisicing adipisicing aliqua laboris laborum commodo irure. Aute proident eu Lorem cillum nostrud. Ad dolor proident ullamco ullamco et fugiat in exercitation velit. Ad velit quis ut exercitation Lorem amet occaecat nisi adipisicing anim aute eu aliquip. Cupidatat aliquip voluptate elit eu consequat occaecat.\r\n",
        "time": 170.3724,
        "completed": true,
        "points": 22
      }
    ]
  },
  {
    "id": "64a9eae87b0df21cbd5ccd72",
    "name": "Johanna Weiss",
    "steps": 4601,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae820bd65387e9d8e1e",
        "description": "In consequat eu ea aute cillum id ut occaecat ut duis reprehenderit sit. Aliquip officia irure deserunt tempor occaecat cupidatat. Anim excepteur dolore reprehenderit veniam sint ut.\r\n",
        "time": 190.6477,
        "completed": true,
        "points": 82
      },
      {
        "name": "Parnell",
        "id": "64a9eae85bada85cb76ee0a0",
        "description": "Id aliqua culpa esse culpa laborum esse velit esse consequat ullamco aliqua pariatur in. Nisi aute veniam incididunt adipisicing. Aute adipisicing consectetur veniam anim non eiusmod.\r\n",
        "time": 108.8395,
        "completed": true,
        "points": 69
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae8e25d509b2606fb3c",
        "description": "Deserunt id irure adipisicing cupidatat adipisicing ipsum occaecat eiusmod voluptate enim nisi quis mollit. Amet anim dolor nisi consectetur ullamco labore duis proident irure quis deserunt eiusmod. Ad irure culpa do cupidatat aute commodo amet cupidatat enim.\r\n",
        "time": 5.0355,
        "completed": true,
        "points": 49
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9eae8a9631a570852db33",
        "description": "Nisi minim aute nulla ut reprehenderit magna irure ea proident voluptate laborum id eiusmod. Ipsum ullamco sint enim adipisicing velit dolor ut duis veniam nostrud mollit adipisicing in mollit. Fugiat esse culpa occaecat ullamco non esse aliqua sunt ad. Est sint non consequat dolore nisi voluptate duis aliquip reprehenderit est aute.\r\n",
        "time": 60.8069,
        "completed": true,
        "points": 86
      },
      {
        "name": "Piha Beach",
        "id": "64a9eae8c205f8a951e0caba",
        "description": "In minim anim ipsum ex eu ad labore cupidatat exercitation in. Fugiat nisi elit et ex sit duis nulla cillum Lorem elit. Sint Lorem sit cillum exercitation tempor. Magna do dolor reprehenderit dolore non excepteur tempor cupidatat anim. Officia in dolor aute magna aliquip sint mollit consequat ullamco labore dolore.\r\n",
        "time": 25.824,
        "completed": true,
        "points": 59
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae8deb9d2c6ce294661",
        "description": "Laboris proident pariatur aute labore velit Lorem fugiat aliqua officia laboris est labore ut. Veniam deserunt veniam excepteur labore id. Ex in elit laborum laborum pariatur commodo. Sint laboris velit aliqua commodo voluptate commodo aliqua duis reprehenderit laboris commodo id mollit. Nisi exercitation ipsum ex quis. Aliquip amet exercitation Lorem excepteur elit quis.\r\n",
        "time": 134.0779,
        "completed": true,
        "points": 93
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae841465dc422c5aeb1",
        "description": "Esse et sint exercitation aliquip laborum ad eiusmod id minim officia pariatur. Lorem sit minim velit excepteur labore veniam sunt tempor mollit aliqua ex officia deserunt in. Anim laboris ut minim laboris pariatur do nostrud aute minim proident elit. Lorem Lorem non laborum aliqua. Culpa consectetur quis ea ipsum irure pariatur incididunt dolore fugiat. Culpa fugiat ipsum commodo duis anim aliquip est velit officia. Quis consectetur ipsum nostrud est ullamco laboris eu laborum exercitation aute.\r\n",
        "time": 120.2543,
        "completed": true,
        "points": 32
      },
      {
        "name": "Bethells Beach",
        "id": "64a9eae885e244b5b1d37e4e",
        "description": "Est nisi duis ex in excepteur ut et proident proident aliquip laboris sunt proident exercitation. Cillum in irure aliqua quis cupidatat. Proident nostrud aliqua anim duis amet ea deserunt tempor exercitation. Ut Lorem aute adipisicing amet.\r\n",
        "time": 142.8531,
        "completed": true,
        "points": 90
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9eae847c56a432c14be41",
        "description": "Officia nulla duis dolore anim aliqua tempor magna ad tempor ex do aute ex. Proident mollit magna pariatur reprehenderit culpa exercitation. Enim tempor veniam laboris culpa culpa in qui do ex eiusmod. Est sit ad reprehenderit ut Lorem exercitation adipisicing proident. Velit pariatur incididunt anim tempor incididunt exercitation voluptate non laboris dolor adipisicing.\r\n",
        "time": 194.115,
        "completed": true,
        "points": 67
      }
    ]
  },
  {
    "id": "64a9eae89c7b3794095e8267",
    "name": "Bernice Dennis",
    "steps": 69046,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8e4a0d80dab5c6739",
        "description": "Occaecat consequat duis id ex in dolore excepteur voluptate eiusmod voluptate sint. Deserunt tempor adipisicing velit aliqua qui quis do incididunt deserunt cupidatat. Duis dolor aliquip quis aliquip culpa incididunt reprehenderit. Duis minim ea esse eiusmod cupidatat occaecat velit anim.\r\n",
        "time": 60.3962,
        "completed": true,
        "points": 92
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae8e60e653a6424a740",
        "description": "Tempor est qui irure Lorem et occaecat deserunt voluptate adipisicing consequat. Excepteur sunt eu veniam dolor labore. Adipisicing cillum velit adipisicing aliquip in. Ad ullamco reprehenderit in amet consectetur. Esse do deserunt eiusmod labore sit incididunt proident Lorem duis exercitation.\r\n",
        "time": 23.3739,
        "completed": true,
        "points": 56
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae803b629c5bf789c8a",
        "description": "Non ut qui in eiusmod Lorem deserunt adipisicing aliqua dolor tempor. Incididunt deserunt velit magna incididunt ad. Enim esse velit incididunt dolor dolor laborum qui eiusmod aute. Duis amet eiusmod sit sunt nulla adipisicing eiusmod reprehenderit officia aliquip consequat fugiat veniam.\r\n",
        "time": 8.4078,
        "completed": true,
        "points": 97
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae8d78c468f2c99d20a",
        "description": "Nisi nisi irure adipisicing velit consequat excepteur. Sunt eu in labore cillum. Tempor commodo reprehenderit culpa velit. Dolore mollit magna nulla do do irure pariatur non nisi aute deserunt. Nostrud consectetur consectetur quis qui.\r\n",
        "time": 138.2349,
        "completed": true,
        "points": 31
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae864bd94e6a33d0b04",
        "description": "Nisi culpa commodo non do laborum. Aute qui ad cupidatat ad velit consectetur laboris proident culpa cupidatat sit excepteur. Proident nostrud aliqua aliqua et do officia elit Lorem irure nulla laborum.\r\n",
        "time": 83.8831,
        "completed": true,
        "points": 93
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae8404367cfb3effa0e",
        "description": "Et et cillum ullamco voluptate consectetur reprehenderit sunt dolore. Irure consequat laborum exercitation irure amet. Fugiat do cupidatat irure aliquip nostrud incididunt non nisi. Velit in cupidatat laborum commodo in fugiat occaecat qui et non reprehenderit aliquip irure id. Elit non tempor consequat magna laborum laborum fugiat esse Lorem sit tempor mollit amet nisi. Nisi elit adipisicing cillum nulla anim Lorem veniam nulla enim nisi pariatur est.\r\n",
        "time": 110.5048,
        "completed": true,
        "points": 63
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae81fe9318f4a2a596c",
        "description": "Minim commodo sit fugiat esse dolor. Commodo duis occaecat id qui incididunt laborum tempor voluptate eu cillum proident sunt veniam est. Qui culpa nulla incididunt eu dolore aliquip excepteur minim id nostrud consectetur irure laboris magna. Irure labore proident adipisicing fugiat sunt nostrud aliquip sint do voluptate officia. Laboris minim dolor reprehenderit sint eiusmod cupidatat aute veniam magna.\r\n",
        "time": 1.9544,
        "completed": true,
        "points": 80
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae82279bd55846ab704",
        "description": "Occaecat amet ad amet pariatur minim exercitation anim laborum nostrud. Quis irure nisi duis labore cillum aliquip veniam cillum aliquip Lorem sint ipsum veniam laborum. Nisi dolore eu irure reprehenderit aliqua sint elit minim proident. Nulla in tempor et eu non esse.\r\n",
        "time": 166.997,
        "completed": true,
        "points": 22
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae8982880f96251a669",
        "description": "Fugiat ex pariatur non mollit consequat nisi anim aute in in minim laboris id. Labore irure culpa magna ea qui cupidatat aliqua cupidatat id ad magna. Cillum voluptate sunt exercitation eiusmod sint sunt ipsum nulla officia. Labore qui irure proident officia minim commodo in.\r\n",
        "time": 52.9324,
        "completed": true,
        "points": 95
      }
    ]
  },
  {
    "id": "64a9eae8d591569f42f6fb51",
    "name": "Eugenia Quinn",
    "steps": 1345,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Howick Historical Village",
        "id": "64a9eae8f84118421d9b3ea1",
        "description": "Officia deserunt labore commodo occaecat consectetur dolore laboris pariatur. Minim laborum laborum incididunt mollit exercitation. Ea mollit dolor laborum veniam aliqua cupidatat reprehenderit laborum. Eu do elit elit irure. Sint voluptate incididunt eiusmod ullamco dolor est aliqua.\r\n",
        "time": 127.2403,
        "completed": true,
        "points": 51
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae819f5193726871c4e",
        "description": "Reprehenderit amet exercitation sit culpa in anim dolor et sunt dolor sit fugiat ipsum tempor. Eu do magna veniam sunt tempor pariatur cupidatat sunt anim laboris officia ullamco. Sunt eu ad eu exercitation officia cupidatat sunt deserunt ex labore. Veniam quis amet enim velit reprehenderit. Nisi commodo labore velit culpa cupidatat adipisicing minim. Officia et ex reprehenderit deserunt nostrud dolor proident est amet cupidatat mollit est.\r\n",
        "time": 113.0651,
        "completed": true,
        "points": 11
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae815c2946aee5b5060",
        "description": "Aute nulla laborum tempor fugiat elit deserunt minim cupidatat duis veniam sint amet labore. Nulla voluptate tempor dolor ea anim laboris elit enim nulla eiusmod eu. Laborum excepteur duis adipisicing do magna do anim nulla. Irure voluptate laboris commodo pariatur consectetur fugiat exercitation tempor non. Consequat culpa velit nulla consectetur pariatur nisi tempor esse duis voluptate proident ipsum. Esse sint duis occaecat consequat quis laborum cupidatat tempor ad. Eiusmod cupidatat ipsum mollit commodo consequat Lorem ea cillum commodo est esse pariatur esse.\r\n",
        "time": 189.3358,
        "completed": true,
        "points": 65
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae87a8a34eec36696f8",
        "description": "Incididunt aute proident ullamco veniam reprehenderit proident veniam culpa non. Ut ullamco mollit labore minim tempor anim occaecat deserunt dolore tempor sint. Fugiat magna exercitation tempor in laboris sunt aute est laboris ea dolor mollit. Labore consectetur nulla non pariatur cupidatat aliqua labore amet exercitation exercitation duis ipsum exercitation ullamco. Ad reprehenderit exercitation in ullamco laborum qui laboris sit eu fugiat ullamco. Tempor aliqua et laboris enim consequat occaecat velit laboris officia enim aliqua qui aute. Culpa magna ipsum nostrud reprehenderit officia.\r\n",
        "time": 137.1222,
        "completed": true,
        "points": 78
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8aa40fc6a406469b1",
        "description": "Ut consectetur non quis nulla voluptate aliquip laboris veniam Lorem minim fugiat voluptate dolor. Labore nostrud occaecat quis dolore cillum. Aliqua eiusmod magna dolore ad amet.\r\n",
        "time": 152.6143,
        "completed": true,
        "points": 96
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9eae85fcce7c38cbc1614",
        "description": "Aute minim deserunt aliquip labore qui enim laborum ea in reprehenderit minim in velit. Ex voluptate laboris id dolore ut et laborum id sunt ea id magna ipsum ipsum. Ullamco in occaecat do ea ut et ad culpa commodo mollit cillum deserunt aliqua. Est minim adipisicing dolore Lorem. Cupidatat elit elit laborum veniam laboris laborum Lorem Lorem minim laborum. Ad incididunt do est quis aliquip id do non.\r\n",
        "time": 68.3206,
        "completed": true,
        "points": 16
      },
      {
        "name": "Silo Park",
        "id": "64a9eae84af116b7156b47a5",
        "description": "Ullamco proident aliquip nisi minim cupidatat. Excepteur ut aute eiusmod in ea in sint anim qui. Aute nisi reprehenderit ut duis. Sint non commodo exercitation amet occaecat consectetur proident pariatur dolore. Nostrud id et nisi in pariatur occaecat incididunt commodo deserunt officia. Deserunt ipsum id consequat deserunt aute excepteur eu. Proident velit aliqua tempor commodo ut elit amet.\r\n",
        "time": 108.5058,
        "completed": true,
        "points": 48
      },
      {
        "name": "Wynyard Quarter",
        "id": "64a9eae8c6a825dcdf00efe5",
        "description": "Consequat voluptate aute occaecat incididunt mollit amet ullamco irure velit mollit. Aliquip aliquip consequat est non aliquip minim. Amet laboris duis tempor ut nisi et dolore et voluptate. Tempor laborum et eu irure ex veniam cillum ad non. Mollit laborum sunt consectetur occaecat dolore adipisicing esse ex aliqua labore nulla. Dolore fugiat eiusmod adipisicing qui. Reprehenderit esse nostrud nisi sint labore aute aute elit ipsum ullamco.\r\n",
        "time": 59.3725,
        "completed": true,
        "points": 81
      }
    ]
  },
  {
    "id": "64a9eae8cdd666ad9cf434dd",
    "name": "Kaufman Mcleod",
    "steps": 34816,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Kitekite Falls",
        "id": "64a9eae89a06c9f145b8d1b8",
        "description": "Excepteur veniam cillum esse id ea consectetur excepteur qui exercitation. Ullamco Lorem sit aliqua qui veniam enim. Elit exercitation ipsum esse sit aute dolore minim veniam aute velit id cillum ipsum incididunt. Ipsum nostrud eu laboris cupidatat commodo aute laboris ipsum voluptate non enim. Do adipisicing aute ad dolor amet magna. Reprehenderit adipisicing voluptate laborum culpa fugiat ullamco. Id sunt adipisicing voluptate magna do qui eu non aliquip.\r\n",
        "time": 20.0816,
        "completed": true,
        "points": 87
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9eae8f45299456932813d",
        "description": "Minim minim in ea sunt ullamco sit anim aliqua nulla labore. Ipsum irure aute ad voluptate cupidatat aute aute est. Quis id culpa culpa anim eiusmod amet in amet ullamco officia. Irure ex quis commodo aliqua esse aute et est. Aliquip non dolor cupidatat nisi culpa duis nisi veniam ipsum aliqua sint occaecat nostrud ipsum. Elit incididunt excepteur tempor reprehenderit cillum.\r\n",
        "time": 17.7232,
        "completed": true,
        "points": 11
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae830f3ab97e1d80cfd",
        "description": "Ex esse enim minim anim in fugiat consectetur. Exercitation ea non exercitation do est velit labore eiusmod consequat sunt id occaecat. Quis laboris nostrud irure est quis qui incididunt minim magna quis.\r\n",
        "time": 66.514,
        "completed": true,
        "points": 85
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8c9b6189bfcf9e1ca",
        "description": "Sint Lorem anim veniam aute ea pariatur dolore labore exercitation ex ea dolore in. Id consequat nostrud ea sunt aute aliquip sunt. Quis amet nisi ex minim duis cupidatat sit ullamco. Elit excepteur exercitation voluptate do mollit fugiat amet labore esse consequat veniam elit enim.\r\n",
        "time": 165.5864,
        "completed": true,
        "points": 48
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae8e15602c01032c1ca",
        "description": "Dolore reprehenderit cillum consequat cupidatat magna. Ut quis cillum ut adipisicing cillum nisi elit reprehenderit officia ex ea labore aliquip. Irure quis laboris consequat eu consequat eu proident elit laboris qui mollit minim. Ex consectetur consectetur pariatur voluptate esse velit do. Mollit ut consequat eu sit anim ut magna velit. Consectetur velit esse ut velit duis officia ipsum duis sint deserunt.\r\n",
        "time": 39.8166,
        "completed": true,
        "points": 59
      },
      {
        "name": "Devonport",
        "id": "64a9eae8371715d84092eca2",
        "description": "Esse cupidatat exercitation nostrud mollit nulla non est aute ad voluptate sunt ipsum. Ullamco enim nulla proident culpa laborum est consectetur sunt enim ad in. Commodo et occaecat veniam Lorem elit qui commodo anim quis laboris.\r\n",
        "time": 28.0514,
        "completed": true,
        "points": 83
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9eae823c573348138412b",
        "description": "Dolor ullamco in velit deserunt minim culpa mollit cillum aliqua ea proident tempor. Id voluptate dolore do aliquip Lorem. Et ut voluptate eu sit. Ut tempor enim enim ad et fugiat. Id ut et ullamco ut sint.\r\n",
        "time": 45.8161,
        "completed": true,
        "points": 88
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae86689f88955f66682",
        "description": "Aute aliqua ut ullamco duis officia non dolor. Qui do proident mollit exercitation do enim culpa sunt. Irure laborum ad eiusmod sit ut ea duis nisi tempor elit culpa esse quis. Laborum aliqua est in aute nulla ullamco excepteur consequat cupidatat nisi anim sunt ipsum. Occaecat sunt Lorem aliqua duis non dolor. Sit enim enim elit sint.\r\n",
        "time": 21.3895,
        "completed": true,
        "points": 51
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9eae8e6c6d6428cee6fb8",
        "description": "Consequat cupidatat mollit sint do ipsum magna. Pariatur dolore in cillum elit laborum mollit duis sint non. Exercitation adipisicing sit in proident. Commodo anim officia exercitation velit cillum cupidatat non occaecat dolore culpa magna. Do fugiat cillum est consequat.\r\n",
        "time": 17.6448,
        "completed": true,
        "points": 64
      },
      {
        "name": "Waiheke Island",
        "id": "64a9eae8a5497c6762b5fecc",
        "description": "Ex occaecat velit Lorem incididunt aute est. Et consequat incididunt ea pariatur. Dolor ut quis sit ullamco velit sit. Et cupidatat sunt dolor qui ullamco fugiat labore. Nulla minim dolore aliqua ex.\r\n",
        "time": 80.0908,
        "completed": true,
        "points": 19
      }
    ]
  },
  {
    "id": "64a9eae8e1f29125302677c2",
    "name": "Middleton Good",
    "steps": 6675,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae8cd3b79a8b0a75d62",
        "description": "Anim aliquip consequat et non qui ea minim pariatur. Consectetur nostrud irure aute ad incididunt aute. Reprehenderit pariatur velit minim est eu nostrud commodo amet reprehenderit et voluptate.\r\n",
        "time": 57.6331,
        "completed": true,
        "points": 48
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae8d804d41df69ec3b8",
        "description": "Duis ullamco adipisicing minim elit officia consectetur do sunt labore. Sunt Lorem pariatur excepteur minim non ipsum laboris. Eiusmod nisi veniam officia consequat consectetur culpa eiusmod ea aliquip id eu deserunt pariatur. Ullamco magna minim aliquip mollit ea tempor cillum nisi anim culpa veniam. Occaecat consectetur quis officia aliqua veniam ipsum est id in.\r\n",
        "time": 121.9812,
        "completed": true,
        "points": 52
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9eae8cc53a762fc8fe7d7",
        "description": "Velit sint commodo fugiat officia est cillum. Labore nulla voluptate occaecat velit consectetur pariatur excepteur non esse. Id aliquip dolore consectetur officia Lorem esse et. Consequat nostrud in commodo esse reprehenderit mollit amet enim nisi. Sint ullamco exercitation excepteur esse elit sit consectetur aute cillum qui culpa.\r\n",
        "time": 160.9348,
        "completed": true,
        "points": 89
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9eae88cba81d26a2bb148",
        "description": "Enim mollit officia in excepteur excepteur minim deserunt enim ex sunt ex ea. Esse id laboris irure ex dolore eiusmod eiusmod id irure enim ipsum elit. Ut laborum in eu eu.\r\n",
        "time": 50.9528,
        "completed": true,
        "points": 11
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9eae8365e6f3588a8d61c",
        "description": "Esse consequat ullamco duis labore amet. Mollit enim aliquip officia eu esse nulla do quis anim ipsum cupidatat adipisicing fugiat. Nulla sunt aliquip ad minim quis fugiat aute non magna. Commodo ad mollit veniam officia. Laboris sunt nulla proident reprehenderit ex incididunt. Dolore occaecat et ipsum dolor occaecat qui ad qui non reprehenderit et tempor.\r\n",
        "time": 117.3025,
        "completed": true,
        "points": 91
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae872cbb7cec21426a4",
        "description": "Cillum consequat proident duis laboris anim exercitation deserunt minim ex elit est minim fugiat. Adipisicing nisi velit cupidatat nisi. Consequat enim amet sint mollit aliqua Lorem et.\r\n",
        "time": 12.223,
        "completed": true,
        "points": 84
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae8e5a92561a87de6fb",
        "description": "In adipisicing ipsum cupidatat nisi dolore magna incididunt duis aliquip aute proident. Labore incididunt fugiat qui sit consectetur officia. Esse enim labore magna exercitation.\r\n",
        "time": 34.923,
        "completed": true,
        "points": 48
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9eae865f46c52a44387ad",
        "description": "Incididunt aute incididunt proident proident quis labore consectetur elit in in. Duis deserunt nisi duis minim adipisicing veniam cupidatat ipsum cillum anim tempor. Velit sunt fugiat enim officia. Minim dolor anim Lorem est do consectetur duis ad officia. Ipsum enim nisi sint commodo dolor anim magna fugiat est ex ut veniam amet ad.\r\n",
        "time": 113.7477,
        "completed": true,
        "points": 90
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae86108229aba440c28",
        "description": "Laborum ipsum laborum in magna in adipisicing. Sint sint eu ut sit reprehenderit deserunt ad anim irure et. Non nulla est anim in deserunt.\r\n",
        "time": 43.8869,
        "completed": true,
        "points": 39
      }
    ]
  },
  {
    "id": "64a9eae86052a2bc6a82ed79",
    "name": "Clarissa Brennan",
    "steps": 1526,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Sky Tower",
        "id": "64a9eae880912dbcc8985644",
        "description": "Id aliqua exercitation non enim exercitation. Cillum id laboris exercitation proident Lorem ipsum eu occaecat cupidatat sint nostrud. Laboris tempor commodo Lorem adipisicing laboris dolor laborum eiusmod magna mollit cupidatat. Anim aute amet tempor labore adipisicing cillum eiusmod elit enim. Non do proident nisi sint proident ipsum ad irure aliqua eiusmod mollit elit consequat ex. Qui mollit consectetur culpa irure enim eiusmod. Laboris exercitation amet enim elit pariatur consequat.\r\n",
        "time": 164.9735,
        "completed": true,
        "points": 81
      },
      {
        "name": "Orewa Beach",
        "id": "64a9eae8d441133753ac7f9a",
        "description": "Sunt dolor cillum culpa minim reprehenderit amet id dolor eu qui proident ex ullamco anim. Velit incididunt mollit ea occaecat exercitation sunt mollit deserunt. Occaecat ea commodo ex nostrud in. Eiusmod ad aute elit qui occaecat qui fugiat eu nulla est laboris. Laborum cillum excepteur Lorem et et deserunt non excepteur fugiat velit nostrud laboris. Est officia ipsum labore et proident et aute in eu eu velit.\r\n",
        "time": 68.3687,
        "completed": true,
        "points": 80
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae8925a1778c37ca64c",
        "description": "Velit nulla dolor nostrud aute. Veniam consequat excepteur pariatur irure elit officia enim. Quis nostrud reprehenderit cupidatat in amet cupidatat enim qui ullamco quis enim do nostrud. Quis est nulla fugiat cupidatat ex cillum quis officia ut excepteur. Anim ad cillum deserunt dolor nisi et amet aute excepteur qui elit fugiat.\r\n",
        "time": 48.327,
        "completed": true,
        "points": 51
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9eae81717be7f5a6bc0a1",
        "description": "Reprehenderit culpa veniam elit irure dolor occaecat non adipisicing ullamco dolore. Irure quis fugiat incididunt velit nulla. Irure eiusmod adipisicing fugiat elit occaecat officia consectetur fugiat incididunt commodo ea non adipisicing excepteur. Ex pariatur est culpa pariatur consequat quis Lorem veniam ullamco enim Lorem.\r\n",
        "time": 114.8378,
        "completed": true,
        "points": 89
      },
      {
        "name": "Western Springs",
        "id": "64a9eae8b3852393e3c0d023",
        "description": "Velit consequat velit et aute cillum culpa do aliqua consectetur do do est sint. Excepteur aute mollit nulla id magna in veniam. Voluptate magna laboris ipsum proident. Amet commodo pariatur non aute aliqua in veniam non labore ad ullamco sunt in. Ex occaecat consequat cillum excepteur est deserunt nostrud.\r\n",
        "time": 137.5091,
        "completed": true,
        "points": 32
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9eae8b952287ded264733",
        "description": "Sit ut incididunt anim eu Lorem aute elit ipsum ad et. Lorem cillum minim magna eiusmod. Cupidatat excepteur et proident sunt nisi deserunt. Minim elit ipsum consectetur ad.\r\n",
        "time": 77.1064,
        "completed": true,
        "points": 40
      },
      {
        "name": "Matakana",
        "id": "64a9eae88579b47e5bc07d6e",
        "description": "Officia dolore duis ut sint reprehenderit laboris incididunt culpa velit. Et occaecat aliquip in sint laborum cillum nostrud fugiat nisi aliqua non consequat ad. Qui deserunt incididunt aliquip elit anim nostrud tempor. Minim exercitation mollit ad ullamco do labore incididunt excepteur elit adipisicing dolore. Id do anim sit aute consequat.\r\n",
        "time": 97.0892,
        "completed": true,
        "points": 99
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae84757364bcb2b66b5",
        "description": "Do minim eu ullamco sit deserunt consequat cillum tempor reprehenderit eu deserunt commodo consequat aliquip. Adipisicing ex nostrud amet ullamco excepteur dolor excepteur dolore minim aliqua consequat aliqua. Nulla incididunt officia officia est reprehenderit occaecat velit ipsum non velit tempor.\r\n",
        "time": 160.2418,
        "completed": true,
        "points": 26
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9eae85f25f823147bbc30",
        "description": "Anim fugiat aliquip minim quis mollit laboris mollit exercitation et et aliqua. Est nulla labore tempor laborum sint amet commodo enim fugiat laborum culpa reprehenderit cupidatat in. Fugiat aliquip adipisicing eiusmod adipisicing sit voluptate velit aute commodo.\r\n",
        "time": 46.9324,
        "completed": true,
        "points": 70
      }
    ]
  },
  {
    "id": "64a9eae84aa3b3cca6a12ea9",
    "name": "Kayla Cunningham",
    "steps": 79914,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Hunua Falls",
        "id": "64a9eae811ae797dd4eed993",
        "description": "Laborum incididunt ea deserunt ex culpa pariatur aliqua in. Officia incididunt commodo commodo anim nostrud. Sint Lorem sunt consectetur anim. Nulla proident duis reprehenderit labore ipsum sunt ipsum mollit sit non mollit excepteur fugiat. Nulla consequat pariatur ipsum pariatur voluptate sunt Lorem.\r\n",
        "time": 18.1049,
        "completed": true,
        "points": 66
      },
      {
        "name": "Albert Park",
        "id": "64a9eae807feb63da709d261",
        "description": "Est mollit et commodo amet aute ipsum ullamco est mollit. Pariatur velit cillum commodo ut ea ut aliquip dolore fugiat sunt qui. Adipisicing veniam pariatur minim ad amet ullamco velit qui aute mollit. Sint officia voluptate deserunt est ut esse id enim commodo anim. Labore ex cupidatat ad cupidatat reprehenderit est. Laborum officia quis irure ut cupidatat esse aliqua ullamco laborum.\r\n",
        "time": 166.2724,
        "completed": true,
        "points": 39
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9eae879864c1fb95d1841",
        "description": "In excepteur eiusmod ex excepteur sunt tempor irure elit eiusmod veniam ipsum excepteur labore fugiat. Do quis proident amet aliqua exercitation irure esse proident. Deserunt ad ad aute nulla proident aute.\r\n",
        "time": 155.806,
        "completed": true,
        "points": 17
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae818a6bd429979be32",
        "description": "Mollit non mollit exercitation eu ad nostrud dolore aliqua ullamco minim reprehenderit. Magna consectetur elit nisi sit consectetur. Ad tempor officia ut nostrud ea eiusmod labore labore. Ad est irure pariatur minim ipsum in elit et velit incididunt ut do esse. Mollit officia id occaecat elit laboris eu aliqua est ipsum pariatur sunt exercitation est.\r\n",
        "time": 129.1161,
        "completed": true,
        "points": 18
      },
      {
        "name": "Cornwall Park",
        "id": "64a9eae812f795007d1e0c42",
        "description": "Anim aliqua velit in ea. Id minim occaecat cupidatat excepteur nostrud exercitation excepteur commodo culpa aute ullamco irure voluptate. Qui ea commodo eu deserunt aliqua ut eu. Qui cillum sit in quis ex pariatur nulla nisi esse minim ut tempor officia. Fugiat sunt velit commodo excepteur adipisicing ullamco tempor voluptate id velit in culpa. Pariatur adipisicing ullamco labore aliqua non occaecat mollit.\r\n",
        "time": 102.1664,
        "completed": true,
        "points": 95
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9eae8f24dbe5a47c36738",
        "description": "In ex voluptate veniam eiusmod aliquip consequat ullamco. Esse ipsum irure sit sit officia nostrud deserunt laborum et eiusmod adipisicing culpa sunt nostrud. Enim id consequat est nisi cupidatat mollit dolor sint pariatur. Ad adipisicing sint occaecat ipsum ad aute aliquip excepteur aute ut. Est non Lorem officia id enim. Eiusmod ad non sint quis labore incididunt. Ullamco cupidatat est aute est duis incididunt.\r\n",
        "time": 153.0455,
        "completed": true,
        "points": 58
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae8ea0a05169214dbb1",
        "description": "Quis adipisicing aute minim ex do aute et deserunt ex ad irure. Magna culpa qui dolore exercitation ipsum nulla velit qui culpa consequat reprehenderit. Do ex ex sint duis duis laborum ad tempor sunt ullamco sunt enim. Sint fugiat tempor sit sunt id non voluptate laborum non est et id. Velit aliqua minim commodo irure ad velit amet.\r\n",
        "time": 57.0016,
        "completed": true,
        "points": 27
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9eae881d1a3ddc25a1a3f",
        "description": "Pariatur aliqua irure non fugiat eu nisi ea nostrud adipisicing ex aliquip. Consectetur occaecat excepteur ut Lorem fugiat qui dolore enim sint deserunt velit commodo ea do. Qui laborum fugiat cupidatat sint anim aute esse est elit consequat nostrud irure consectetur. Exercitation aliqua commodo sunt elit proident eu.\r\n",
        "time": 86.3328,
        "completed": true,
        "points": 26
      },
      {
        "name": "Silo Park",
        "id": "64a9eae85e3066e53c072302",
        "description": "Nisi consequat ea exercitation ea aute veniam ullamco voluptate occaecat esse. Sit aliquip officia dolore do sunt eiusmod. In duis cupidatat sunt irure commodo deserunt. Aute ea eiusmod qui enim dolore enim mollit et eu officia nulla minim voluptate eiusmod.\r\n",
        "time": 118.4912,
        "completed": true,
        "points": 39
      }
    ]
  },
  {
    "id": "64a9eae89e049566117fda9d",
    "name": "Schneider Hancock",
    "steps": 53255,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9eae898e0f2db09beeccf",
        "description": "Deserunt tempor minim excepteur voluptate reprehenderit occaecat. Enim ut laborum anim est. In ullamco dolore deserunt ad qui incididunt do eiusmod ipsum exercitation proident duis aute. Nostrud sit amet elit eiusmod ipsum non do laboris incididunt exercitation ut et eiusmod ipsum. Aliqua dolor enim cillum proident.\r\n",
        "time": 177.6503,
        "completed": true,
        "points": 81
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9eae83c6123813fa4739a",
        "description": "Minim duis id consequat pariatur ex nisi fugiat ex proident voluptate anim velit nulla. Dolore duis nulla excepteur reprehenderit dolore magna amet sunt dolore ut minim laborum minim. Ea officia tempor reprehenderit cupidatat aliqua voluptate eu ipsum non ea.\r\n",
        "time": 77.4738,
        "completed": true,
        "points": 42
      },
      {
        "name": "Queen Street",
        "id": "64a9eae89142f8064246f410",
        "description": "Sunt est ea minim magna nisi laboris enim sunt. Mollit adipisicing pariatur culpa dolore aute proident sint incididunt sint ex ipsum velit id officia. Voluptate ad mollit eiusmod commodo culpa aliquip voluptate voluptate quis velit occaecat.\r\n",
        "time": 85.1357,
        "completed": true,
        "points": 23
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8e2afc1aeeff745ab",
        "description": "Aliqua proident incididunt aliquip dolore nostrud nulla adipisicing reprehenderit reprehenderit occaecat mollit amet proident. Pariatur magna reprehenderit quis laboris eu eu Lorem nulla elit ex elit id. Velit irure voluptate ut ea commodo sit et sunt duis amet culpa elit nisi. Ullamco voluptate adipisicing eu culpa eu ullamco amet aliqua qui deserunt nostrud. Veniam cillum minim nulla in non dolore adipisicing aliqua ut laborum non.\r\n",
        "time": 141.5901,
        "completed": true,
        "points": 69
      },
      {
        "name": "Devonport",
        "id": "64a9eae84647e7ee870fb6f4",
        "description": "In qui qui in id ipsum ullamco. Officia fugiat cillum nisi nulla culpa aliquip nostrud reprehenderit dolore esse mollit veniam deserunt. Sint non incididunt eiusmod exercitation occaecat do. Ut velit nostrud nostrud eu ex veniam enim. Lorem laborum incididunt ex eiusmod pariatur incididunt laborum in do in laborum tempor eu dolore. Consequat qui cupidatat ipsum laborum do in tempor cillum nulla. Culpa sint excepteur enim cillum irure qui magna pariatur deserunt exercitation aliqua culpa eu proident.\r\n",
        "time": 124.5012,
        "completed": true,
        "points": 28
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9eae8350bac9699bf384c",
        "description": "Sunt ipsum cillum pariatur commodo. Aliquip dolore deserunt laborum consequat culpa aliquip ullamco. Mollit Lorem velit nostrud culpa. Proident nulla sunt elit dolor elit laboris commodo eiusmod tempor eiusmod sunt magna aute. Minim reprehenderit sunt aute officia commodo deserunt proident deserunt elit adipisicing irure. Proident quis tempor voluptate amet eu tempor dolore consequat ullamco enim commodo sit.\r\n",
        "time": 71.4362,
        "completed": true,
        "points": 18
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9eae836de4b9daf9dfaa2",
        "description": "Adipisicing pariatur fugiat magna voluptate. Occaecat non in tempor ad Lorem pariatur. Id tempor labore non duis qui velit. Fugiat deserunt proident eu sit aute.\r\n",
        "time": 178.1327,
        "completed": true,
        "points": 48
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae82ae4c3ccb1873d11",
        "description": "Sint veniam qui duis reprehenderit enim. Culpa et exercitation mollit qui laboris mollit irure adipisicing ut occaecat. Velit sunt dolor ad nostrud ullamco cillum. Nostrud laboris nulla exercitation amet ullamco exercitation officia consequat elit irure. Nisi id pariatur reprehenderit anim voluptate id aliqua. Nostrud occaecat eiusmod exercitation commodo in ut ipsum quis anim ea dolor quis ullamco eiusmod.\r\n",
        "time": 197.049,
        "completed": true,
        "points": 16
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae8d403db943cac2492",
        "description": "Nulla ipsum irure labore qui eu tempor commodo. Sunt nulla non laborum aliquip sit. Pariatur nulla excepteur minim nisi.\r\n",
        "time": 3.9993,
        "completed": true,
        "points": 24
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9eae861e346cea0da3950",
        "description": "Sunt cillum consequat cillum sint. Culpa fugiat cillum enim laborum voluptate do laborum sint ea adipisicing velit adipisicing. Laborum ea pariatur id consequat quis commodo nulla.\r\n",
        "time": 129.1248,
        "completed": true,
        "points": 42
      }
    ]
  },
  {
    "id": "64a9eae8b22440acd4a483d7",
    "name": "Oliver Brewer",
    "steps": 85948,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae8f170d511f8f17b05",
        "description": "Et minim reprehenderit sit duis aliqua dolore nulla nostrud consequat. Sunt esse excepteur do amet. Fugiat aliquip dolor id incididunt. Consectetur laborum nulla minim id. Qui mollit est consequat qui culpa proident Lorem. Non elit velit magna Lorem.\r\n",
        "time": 61.4069,
        "completed": true,
        "points": 31
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae8ccfab64c6ea2f1ff",
        "description": "Ullamco ipsum elit labore aliquip in enim. Non id exercitation deserunt irure laborum sit est labore ex pariatur occaecat irure. Sint nulla reprehenderit dolor commodo voluptate.\r\n",
        "time": 16.0076,
        "completed": true,
        "points": 69
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9eae86fae4bd21c2ca961",
        "description": "Cupidatat qui quis mollit culpa proident voluptate duis consequat esse ut nulla ea consectetur aliqua. Aliquip eu occaecat dolore sunt aliquip minim eiusmod consequat tempor irure ad magna ullamco. Eiusmod dolore minim laborum consequat culpa eiusmod in. Velit do reprehenderit tempor exercitation. Lorem labore consectetur commodo cillum sit nostrud. Do nulla sit anim occaecat sint pariatur cupidatat. Cupidatat veniam ex reprehenderit ipsum eiusmod laborum Lorem ullamco labore ex incididunt.\r\n",
        "time": 63.762,
        "completed": true,
        "points": 73
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae80a0e3c1d0dc2eb1e",
        "description": "Ad ullamco cillum veniam fugiat eu dolore consectetur sit voluptate pariatur fugiat ullamco nostrud. Do laborum dolor exercitation excepteur pariatur. Laboris exercitation amet est aliquip dolore elit nisi nostrud et laboris nulla adipisicing officia. Mollit voluptate voluptate sint velit nulla qui cupidatat ullamco reprehenderit tempor. Id dolor officia eu veniam ullamco in laborum.\r\n",
        "time": 103.6967,
        "completed": true,
        "points": 32
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae894225b677897c13d",
        "description": "Dolore culpa ad ex enim aliquip proident sint do. Est dolore commodo labore reprehenderit id anim aute nisi eiusmod quis. Labore labore consequat sint proident sint id fugiat. Aliquip nostrud aliquip deserunt ea esse veniam ex occaecat labore do aute anim cupidatat voluptate.\r\n",
        "time": 130.6453,
        "completed": true,
        "points": 24
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae8736e483fe576e9f1",
        "description": "In irure nulla eiusmod ipsum ea exercitation culpa adipisicing consectetur do eiusmod laboris eu. Pariatur deserunt veniam nostrud nulla eiusmod magna reprehenderit dolore qui duis. Nisi exercitation ut tempor eu culpa ullamco. Aliqua nostrud magna anim nostrud nisi tempor adipisicing nulla cupidatat ad culpa. Id aute consequat est aliquip pariatur.\r\n",
        "time": 109.1505,
        "completed": true,
        "points": 93
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae8df0d16e35a0326c8",
        "description": "Lorem laborum non reprehenderit est excepteur irure id officia sunt qui. Eu voluptate aliqua excepteur magna id tempor pariatur ullamco sunt ea labore adipisicing labore nostrud. Est et nulla eu nisi aute excepteur elit anim quis culpa. Ad sunt duis exercitation deserunt deserunt aliquip ex mollit voluptate nulla incididunt aliquip ullamco. Laboris ipsum in do Lorem ea ad enim irure deserunt mollit consequat velit aute pariatur. Voluptate labore voluptate enim Lorem et mollit anim proident laboris occaecat laboris exercitation magna. Cillum consectetur enim sit labore excepteur proident reprehenderit quis officia dolore velit.\r\n",
        "time": 198.5775,
        "completed": true,
        "points": 36
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9eae846fabf89ecb83860",
        "description": "Enim irure elit quis et elit duis aliquip ut velit eiusmod et. Veniam occaecat dolore culpa pariatur sunt ad. Consectetur sit ut consectetur laboris reprehenderit consectetur. Ea qui aliqua consequat exercitation irure consectetur sunt. In enim ea quis aliquip dolore labore cillum nisi est.\r\n",
        "time": 110.9578,
        "completed": true,
        "points": 59
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9eae877f79222e42a0c6d",
        "description": "Lorem duis velit esse eu sint laborum ea nostrud veniam anim. Deserunt id incididunt aute eiusmod duis magna ex aliqua esse proident. Voluptate aliqua ipsum Lorem ipsum occaecat sit nostrud excepteur incididunt. Irure pariatur fugiat non laborum aute cillum. Mollit pariatur do sunt do tempor voluptate in sint et ea magna. Consequat nulla laboris anim fugiat excepteur exercitation aliqua. Commodo velit enim Lorem adipisicing deserunt consectetur occaecat cupidatat voluptate quis reprehenderit et nulla in.\r\n",
        "time": 41.3096,
        "completed": true,
        "points": 81
      }
    ]
  },
  {
    "id": "64a9eae8de79698c2da3ad6d",
    "name": "Battle Cash",
    "steps": 5921,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae85033012388b24cfc",
        "description": "Aute excepteur esse Lorem voluptate est excepteur. Veniam elit eiusmod amet magna enim sit. Velit tempor veniam veniam ad amet magna ad ex pariatur tempor ipsum dolore. Excepteur labore sit deserunt ex nisi eiusmod nostrud Lorem. Sint nisi enim cillum nulla duis in. Eu proident nulla exercitation irure veniam. Ex sit sunt commodo proident incididunt magna dolore non id anim.\r\n",
        "time": 105.9467,
        "completed": true,
        "points": 29
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9eae83589963ef98c78cf",
        "description": "Adipisicing officia aliquip ullamco ipsum elit dolore non quis minim et duis culpa. Aliquip in esse reprehenderit irure ipsum cupidatat voluptate voluptate commodo. Officia id eiusmod officia deserunt veniam do eiusmod pariatur anim ad eiusmod deserunt eiusmod. Incididunt labore reprehenderit nulla cillum cillum cupidatat labore ullamco officia sunt magna tempor incididunt cillum. Et culpa cupidatat aliquip dolor consequat incididunt anim. Magna voluptate aute magna cillum proident deserunt occaecat id Lorem ipsum ullamco. Aliquip amet non deserunt et do labore ad laboris cupidatat nostrud nostrud duis sit.\r\n",
        "time": 121.2381,
        "completed": true,
        "points": 60
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae895e6de6a05ed904b",
        "description": "Qui nisi sit ullamco elit aliqua mollit proident elit cillum sit ut deserunt fugiat mollit. Exercitation adipisicing ad est aliqua laboris in velit dolore pariatur velit Lorem veniam. Nisi consequat qui dolor pariatur Lorem est sit ullamco.\r\n",
        "time": 129.285,
        "completed": true,
        "points": 66
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9eae86c537b3ef6078ea6",
        "description": "Esse incididunt nostrud sit culpa occaecat aliqua aliqua sit. Cillum do commodo enim enim qui sunt esse id reprehenderit aliqua elit est anim dolore. Irure qui commodo deserunt eu irure laborum commodo. Anim esse laborum voluptate non magna elit velit cillum. Laboris commodo aute cupidatat reprehenderit esse minim deserunt.\r\n",
        "time": 102.1777,
        "completed": true,
        "points": 94
      },
      {
        "name": "Silo Park",
        "id": "64a9eae8241569e3d9b98180",
        "description": "Ut sint proident nostrud reprehenderit proident fugiat sint sint magna voluptate ea eiusmod nulla. Aliqua occaecat ullamco nulla incididunt eu amet esse irure excepteur. Anim irure voluptate nisi voluptate eiusmod. Ex cillum amet mollit incididunt veniam. In velit aliqua laboris fugiat magna anim id duis proident consectetur.\r\n",
        "time": 116.6005,
        "completed": true,
        "points": 66
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9eae81988d8365f9b5ac9",
        "description": "Velit do fugiat nulla fugiat eiusmod labore commodo do velit cillum exercitation fugiat. Sunt exercitation aute esse adipisicing ullamco ullamco reprehenderit occaecat ex consectetur adipisicing duis incididunt labore. Irure ea officia consectetur ipsum aliqua ullamco velit excepteur. Dolor est non ea eu cillum id veniam. Dolor ut ea non ullamco officia. Tempor minim laborum culpa sunt cupidatat cupidatat sint dolor sint ea incididunt Lorem occaecat.\r\n",
        "time": 131.6812,
        "completed": true,
        "points": 45
      },
      {
        "name": "Silo Park",
        "id": "64a9eae8073bd648ea4a4822",
        "description": "Qui minim ex nisi ipsum deserunt nisi qui. Do dolor non deserunt sunt ex reprehenderit commodo consectetur exercitation veniam velit Lorem. Tempor nisi ipsum excepteur velit tempor ipsum do amet voluptate sit aute quis. Occaecat consectetur aliquip pariatur amet qui magna. Dolor magna officia aliqua ullamco nisi consectetur aliqua laboris cupidatat anim ad occaecat eiusmod sit.\r\n",
        "time": 1.0772,
        "completed": true,
        "points": 97
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9eae859c37c50521870c4",
        "description": "Officia velit consectetur id ut culpa laborum elit ipsum ex magna cillum. Qui esse qui ut Lorem et occaecat eu culpa veniam id. Aliquip labore cupidatat amet in pariatur exercitation irure esse eu. Minim duis ipsum cillum irure non incididunt deserunt est anim reprehenderit veniam minim. Occaecat laborum exercitation mollit reprehenderit minim commodo labore ea. Ullamco nostrud dolor deserunt do commodo ullamco fugiat voluptate ullamco minim esse eu pariatur.\r\n",
        "time": 104.9515,
        "completed": true,
        "points": 58
      }
    ]
  },
  {
    "id": "64a9eae8eca9f2719a1eb265",
    "name": "Acevedo Kinney",
    "steps": 27243,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Western Springs",
        "id": "64a9eae83352c0dacfeb9170",
        "description": "Labore ullamco ea exercitation est ullamco dolore excepteur ut culpa pariatur. Cupidatat Lorem incididunt nulla ex quis reprehenderit proident et nostrud adipisicing tempor. Velit voluptate cupidatat sit excepteur reprehenderit adipisicing nostrud velit aliqua fugiat quis occaecat qui deserunt.\r\n",
        "time": 60.7556,
        "completed": true,
        "points": 10
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9eae85d609146367fcf6f",
        "description": "Excepteur officia ipsum et magna irure eiusmod enim reprehenderit eiusmod in exercitation ullamco. Ipsum incididunt anim nostrud tempor anim eu. Sit incididunt minim incididunt velit anim tempor enim irure mollit eu nulla exercitation do. Consectetur consequat anim in quis aliquip ad proident mollit ex enim occaecat do ad. Est do ullamco duis fugiat in amet veniam. Lorem aute eiusmod velit dolor. Aliquip id voluptate et deserunt eu exercitation et laborum fugiat.\r\n",
        "time": 62.9069,
        "completed": true,
        "points": 86
      },
      {
        "name": "Auckland Domain",
        "id": "64a9eae8d1745f8a783bc537",
        "description": "Quis commodo do laborum amet commodo velit eiusmod nulla. Tempor nostrud tempor in nisi ullamco eiusmod et id occaecat proident et amet mollit pariatur. Officia esse reprehenderit labore non adipisicing fugiat aliqua voluptate enim amet cupidatat minim. Ad do elit id excepteur. Deserunt sit ad qui enim id incididunt sint non.\r\n",
        "time": 143.0201,
        "completed": true,
        "points": 49
      },
      {
        "name": "Aotea Square",
        "id": "64a9eae86f7c05d08a5e402f",
        "description": "Officia voluptate in velit culpa cillum dolor sunt dolor sit. Dolor consequat cupidatat sint tempor Lorem adipisicing esse ut occaecat veniam enim fugiat irure irure. Mollit et cupidatat aliquip veniam occaecat do esse ipsum ad. Labore occaecat ex duis voluptate minim do elit dolore veniam. Consequat officia non ea dolor Lorem voluptate tempor occaecat sunt pariatur do.\r\n",
        "time": 178.7282,
        "completed": true,
        "points": 65
      },
      {
        "name": "One Tree Hill",
        "id": "64a9eae89d56f0e19375e03a",
        "description": "Elit et laboris non esse mollit cillum voluptate dolor. Cupidatat dolore sunt cillum irure pariatur duis commodo aliquip. Esse esse cupidatat enim Lorem ullamco pariatur commodo. Labore quis proident in magna elit sint sint aliqua do voluptate sunt nostrud ad reprehenderit. Mollit laboris ut commodo labore do pariatur labore culpa qui magna labore. Ad labore et esse ipsum ullamco.\r\n",
        "time": 122.587,
        "completed": true,
        "points": 41
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9eae80c744e0681b934c0",
        "description": "Ipsum cupidatat occaecat amet duis sint reprehenderit incididunt duis. Cillum incididunt sunt nostrud reprehenderit mollit consectetur nostrud. Et ad commodo ad mollit do qui qui irure. Anim labore sint ipsum id ex et consequat quis commodo. Mollit non ipsum id magna consectetur incididunt est do tempor. Ea elit nulla qui dolore.\r\n",
        "time": 42.9895,
        "completed": true,
        "points": 40
      },
      {
        "name": "Sky Tower",
        "id": "64a9eae8384fdcb125b83658",
        "description": "Do officia elit sit amet aliqua qui commodo excepteur exercitation officia nostrud sunt minim. Laboris reprehenderit ullamco non consectetur ullamco quis pariatur dolore do. Eu eiusmod sit sunt enim ex sint laboris.\r\n",
        "time": 110.6151,
        "completed": true,
        "points": 78
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae879460265d42ee092",
        "description": "Eiusmod nulla ad ipsum cupidatat labore anim exercitation. Sunt laboris incididunt eiusmod dolore occaecat excepteur. Ea minim ex aute cillum laboris est ea sint dolor ipsum enim esse exercitation commodo. In nostrud in veniam commodo anim. Dolore sunt consequat nulla adipisicing. Qui irure officia reprehenderit tempor eiusmod pariatur in voluptate ea magna.\r\n",
        "time": 105.2942,
        "completed": true,
        "points": 60
      }
    ]
  },
  {
    "id": "64a9eae87446c93d6fd3398b",
    "name": "Arnold Calderon",
    "steps": 18816,
    "location": {
      "latitude": -36.89,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae8e11441c7ebdcfb51",
        "description": "Cupidatat exercitation fugiat velit laboris anim pariatur sit anim ea dolor eu. Pariatur velit esse dolor non laboris in velit cillum ullamco adipisicing consectetur. Voluptate dolore duis cillum ullamco in labore esse. Adipisicing sit consequat ea culpa occaecat dolor tempor do Lorem mollit consequat.\r\n",
        "time": 190.362,
        "completed": true,
        "points": 30
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9eae898463119c924bd2a",
        "description": "Aliqua adipisicing ex ad velit eiusmod consequat consectetur culpa proident. Aliqua occaecat velit non elit id excepteur velit consequat laboris. Velit nulla exercitation anim sunt. Ullamco culpa officia velit exercitation. Dolore aliqua proident velit fugiat tempor irure culpa ea aliquip.\r\n",
        "time": 62.7213,
        "completed": true,
        "points": 95
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae88ecd95a98de3bedc",
        "description": "Ex cillum ullamco mollit qui cupidatat voluptate excepteur aliqua ex et. Dolor sit est dolore elit mollit. Anim adipisicing ad cillum officia cupidatat dolor.\r\n",
        "time": 52.5442,
        "completed": true,
        "points": 76
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9eae8fbac207e8ae074ff",
        "description": "Id irure ea dolor non occaecat ea fugiat nulla excepteur do ex. Id non adipisicing commodo voluptate cupidatat sit dolor occaecat nostrud in mollit proident reprehenderit dolore. Exercitation tempor irure ipsum minim ad occaecat. Anim irure voluptate voluptate voluptate anim amet aute do deserunt officia sunt.\r\n",
        "time": 30.7612,
        "completed": true,
        "points": 31
      },
      {
        "name": "Matakana",
        "id": "64a9eae8c5bb1b37463568c8",
        "description": "Ullamco minim cupidatat tempor exercitation elit in esse cupidatat et velit mollit deserunt pariatur. Sunt ullamco aliqua eiusmod dolor ullamco sunt pariatur non incididunt ad ea consectetur. Fugiat culpa non cillum deserunt et nostrud mollit quis enim. Commodo esse consectetur cupidatat enim ea in sit dolore ullamco laboris.\r\n",
        "time": 149.1094,
        "completed": true,
        "points": 37
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9eae89df8557db9c3ca73",
        "description": "Ea exercitation excepteur qui exercitation velit. Elit velit velit et dolore ea ad. Ad amet quis reprehenderit voluptate qui eu veniam sit dolor. Aute sunt voluptate ad ad reprehenderit adipisicing deserunt voluptate cupidatat amet. Non voluptate enim nulla sunt duis est commodo ad do ipsum.\r\n",
        "time": 8.4659,
        "completed": true,
        "points": 47
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae8791d99badcb531fc",
        "description": "Voluptate ea eu cillum nisi dolor consequat proident anim quis cillum aliqua veniam. Tempor consequat magna laboris ipsum qui qui anim ut quis tempor duis est aliquip aute. Minim et ipsum anim tempor et ea consequat ea velit velit enim nisi tempor. Incididunt ut consequat qui Lorem sunt cillum ea adipisicing incididunt ullamco labore enim. Aliqua occaecat mollit dolor labore deserunt nostrud culpa sunt dolor. Enim exercitation irure et duis nulla sunt. Voluptate sunt incididunt velit commodo et cillum irure tempor fugiat quis consectetur ad.\r\n",
        "time": 143.5226,
        "completed": true,
        "points": 45
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9eae88ab6a2940f907c2f",
        "description": "Commodo nostrud enim ea voluptate. Consectetur voluptate sit quis nostrud. Ea excepteur labore et tempor veniam minim. Sunt culpa fugiat minim labore cupidatat dolor est aute Lorem incididunt ex pariatur ut. Ipsum mollit ullamco aute id incididunt. Sint incididunt mollit occaecat elit aute Lorem deserunt ullamco laborum reprehenderit elit ex. Anim exercitation qui ut nostrud excepteur elit sit esse dolore incididunt.\r\n",
        "time": 70.7362,
        "completed": true,
        "points": 18
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9eae81462e445a80a9b7b",
        "description": "Est quis aute tempor laborum qui est sit fugiat. Anim fugiat nisi sit qui qui non duis culpa do occaecat laborum. Nulla occaecat enim et occaecat voluptate reprehenderit reprehenderit reprehenderit sit elit duis nisi. Ea qui fugiat reprehenderit qui eu aliqua ullamco labore Lorem esse eiusmod exercitation deserunt quis. Ipsum nulla labore occaecat nulla. Cillum aliquip occaecat cillum dolor ea elit.\r\n",
        "time": 110.7453,
        "completed": true,
        "points": 53
      }
    ]
  },
  {
    "id": "64a9eae89adf68b4faad9903",
    "name": "Hardy Combs",
    "steps": 53983,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Muriwai Beach",
        "id": "64a9eae86e0ecddf3c403815",
        "description": "Dolor culpa officia nostrud ullamco est laborum aliqua pariatur nisi aliquip nostrud. Ex laboris culpa labore cupidatat commodo dolor in minim veniam. Aliquip qui non ullamco laborum voluptate.\r\n",
        "time": 183.8099,
        "completed": true,
        "points": 21
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9eae862350a0e7012d14b",
        "description": "Proident non elit dolor aliquip eu nostrud id laboris. Nisi sunt ex laborum anim in sunt ex irure aliqua qui elit culpa. Elit labore reprehenderit tempor commodo quis dolor laborum in voluptate velit irure est pariatur consequat.\r\n",
        "time": 24.7566,
        "completed": true,
        "points": 13
      },
      {
        "name": "Devonport",
        "id": "64a9eae895e8ee706710b5ec",
        "description": "Incididunt velit tempor labore nulla labore est. Est eiusmod consequat et officia nulla fugiat. Sit culpa cillum ut occaecat cillum nisi adipisicing. Nulla laborum amet cillum dolor quis. Excepteur adipisicing nostrud nostrud mollit ullamco velit aliqua dolor adipisicing reprehenderit cillum id. Sunt ad voluptate occaecat adipisicing anim officia cupidatat.\r\n",
        "time": 135.0675,
        "completed": true,
        "points": 52
      },
      {
        "name": "Karekare",
        "id": "64a9eae8df815b8846041abf",
        "description": "Adipisicing tempor officia qui mollit do. Quis nulla et aute cillum enim reprehenderit sit nisi consectetur fugiat dolor reprehenderit officia. Duis minim labore veniam incididunt adipisicing Lorem aute aute.\r\n",
        "time": 75.0564,
        "completed": true,
        "points": 50
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae85a96e28d90708937",
        "description": "Occaecat enim sint Lorem duis aliqua magna ex commodo ut ex. Consectetur sunt anim irure cillum dolor amet amet eiusmod. Eu mollit nulla tempor occaecat tempor nisi sunt nostrud tempor veniam elit aute. Eu aute qui voluptate nisi reprehenderit esse do ipsum dolore non. Incididunt et aute et laboris nostrud id veniam exercitation elit. Non exercitation amet nisi culpa quis esse aliquip pariatur anim laborum occaecat enim. Incididunt et sit eiusmod magna aliquip et.\r\n",
        "time": 111.4118,
        "completed": true,
        "points": 20
      },
      {
        "name": "Mission Bay",
        "id": "64a9eae838179536c6451fa6",
        "description": "Tempor minim do officia eu consectetur id excepteur commodo laboris magna esse. Consequat labore ut eiusmod et aliqua laboris irure sunt aute commodo ad cillum ea exercitation. Adipisicing amet sunt est sit minim irure enim. Sint excepteur dolor consequat voluptate adipisicing ullamco. Proident non esse aliquip aliqua labore elit.\r\n",
        "time": 98.8176,
        "completed": true,
        "points": 78
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9eae8dbe7ad1941b9dd70",
        "description": "Anim est veniam mollit consectetur quis laboris incididunt sit et deserunt veniam proident dolor. Fugiat ea excepteur ad ad qui sit laboris sunt pariatur tempor consequat duis. Voluptate enim aliquip nostrud non duis eiusmod. Qui nostrud incididunt eu occaecat deserunt occaecat elit labore velit. Duis commodo proident dolore minim adipisicing. Eiusmod consequat non aliqua laboris.\r\n",
        "time": 197.8287,
        "completed": true,
        "points": 59
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9eae8c9332d187dccbe40",
        "description": "Esse deserunt elit id adipisicing sunt adipisicing laborum laboris. Adipisicing cupidatat irure pariatur sit voluptate ea ut minim consequat. Ullamco mollit enim eiusmod ut aute reprehenderit ipsum nostrud et consectetur duis officia exercitation. Tempor consequat non eu reprehenderit reprehenderit dolore. In velit esse voluptate dolore quis exercitation do dolore occaecat et nisi reprehenderit qui eu. Tempor veniam laboris aute qui in pariatur aute culpa id. Ad nostrud ut culpa exercitation.\r\n",
        "time": 71.6972,
        "completed": true,
        "points": 11
      }
    ]
  },
  {
    "id": "64a9eae82e1ad956092cd3cf",
    "name": "Bridges Sampson",
    "steps": 22771,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Matakana",
        "id": "64a9eae8eec00ba4b7a2066e",
        "description": "Adipisicing ex deserunt dolor non labore commodo fugiat culpa. Reprehenderit velit minim dolor ad aliqua eu nisi. Magna quis consectetur exercitation nisi deserunt do ullamco dolore quis.\r\n",
        "time": 175.384,
        "completed": true,
        "points": 64
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae80297097fadaf73b1",
        "description": "Elit sint voluptate ad elit. Ipsum sint in elit commodo nisi in esse nisi excepteur est elit. Voluptate esse sit tempor non ut fugiat culpa veniam Lorem consectetur exercitation. Sunt amet veniam sunt eiusmod voluptate Lorem commodo cillum duis. Consectetur id ex qui sint ullamco deserunt magna cupidatat nisi.\r\n",
        "time": 14.9689,
        "completed": true,
        "points": 44
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae87305f28d47acba65",
        "description": "Eu cupidatat enim laboris consequat tempor culpa nisi in ut ex laboris in consectetur non. Do proident laboris consectetur sit veniam. Reprehenderit veniam officia et commodo veniam ipsum exercitation. Consequat sit aliqua labore exercitation nulla minim do minim sint. Ipsum pariatur duis amet labore.\r\n",
        "time": 121.916,
        "completed": true,
        "points": 24
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9eae854acfc23fc2b2c48",
        "description": "Est commodo Lorem aliquip deserunt consectetur fugiat non et veniam occaecat ad. Pariatur aliquip elit eu esse aute do ut velit dolor veniam aliqua. Aliquip velit adipisicing Lorem in irure aliqua fugiat elit. Esse ad ad non laborum cillum fugiat exercitation sit commodo laboris labore deserunt laboris. Consectetur aliqua cillum mollit aliqua enim irure ipsum deserunt deserunt elit amet. Quis Lorem id et amet cupidatat do pariatur in.\r\n",
        "time": 119.7771,
        "completed": true,
        "points": 33
      },
      {
        "name": "Auckland Museum",
        "id": "64a9eae85d20d6caeade2f46",
        "description": "Elit in enim ullamco aute ad deserunt cillum. Enim voluptate tempor laboris duis consequat excepteur mollit eiusmod. Sunt nostrud sit ipsum incididunt tempor adipisicing do officia veniam minim exercitation dolore. Veniam nostrud pariatur occaecat adipisicing ad. Voluptate magna mollit est adipisicing ex amet cupidatat ullamco veniam aute consectetur. Aliqua laborum velit tempor irure proident veniam exercitation.\r\n",
        "time": 100.39,
        "completed": true,
        "points": 82
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae82b642ab1964866b6",
        "description": "Incididunt elit sunt pariatur sit minim non enim est labore ad. Veniam mollit eiusmod enim officia irure nostrud amet ut amet qui eu. Veniam deserunt incididunt nostrud tempor velit ex nisi consectetur elit aliqua aute proident aliqua. Duis culpa sunt dolor dolore sit in.\r\n",
        "time": 49.7254,
        "completed": true,
        "points": 80
      },
      {
        "name": "Orewa Beach",
        "id": "64a9eae8e34ed68e921d88c1",
        "description": "Aliqua duis enim laboris consequat ipsum laborum. Proident Lorem dolor fugiat reprehenderit exercitation magna ipsum. Ea nostrud excepteur sit velit est in veniam elit sint cupidatat dolore.\r\n",
        "time": 90.5217,
        "completed": true,
        "points": 97
      },
      {
        "name": "Kawau Island",
        "id": "64a9eae8e99b890f0132867e",
        "description": "Mollit esse et consequat proident occaecat sit pariatur est deserunt occaecat irure est labore esse. Ullamco velit sunt ad ea quis veniam eu ullamco reprehenderit irure amet consequat commodo. Anim et enim dolore laboris elit. Tempor Lorem sit voluptate sit fugiat nulla tempor.\r\n",
        "time": 168.9292,
        "completed": true,
        "points": 92
      },
      {
        "name": "Piha Beach",
        "id": "64a9eae8639364999e3b2d30",
        "description": "Incididunt velit non est fugiat consequat aliqua est consequat duis. Dolor magna labore culpa do. Fugiat duis laboris enim minim aliquip laborum aliqua duis. Minim in exercitation in ex dolore do tempor amet laborum non.\r\n",
        "time": 40.9075,
        "completed": true,
        "points": 34
      }
    ]
  },
  {
    "id": "64a9eae8b21e4b73e0ead755",
    "name": "Davenport Huff",
    "steps": 78514,
    "location": {
      "latitude": -36.88,
      "longitude": -185.2
    },
    "quests": [
      {
        "name": "Parnell",
        "id": "64a9eae8857cbe111a1738c6",
        "description": "Enim anim commodo non duis proident culpa excepteur irure Lorem fugiat sint consectetur. Ex ut do culpa mollit proident eiusmod dolor quis voluptate. Pariatur eu exercitation aute id dolore labore veniam duis Lorem ad nulla aliquip. Cupidatat enim fugiat voluptate qui reprehenderit ex deserunt aliqua est. Nostrud sunt cillum voluptate elit mollit duis dolore amet. Aute consequat consequat amet eu nostrud culpa consequat. Do consectetur proident proident fugiat pariatur ea culpa.\r\n",
        "time": 102.5477,
        "completed": true,
        "points": 47
      },
      {
        "name": "Western Springs",
        "id": "64a9eae83c7a13d69b9cd3dd",
        "description": "Minim id sint velit nulla non tempor et. Non consectetur culpa irure laborum est fugiat proident magna aliqua. Ea tempor irure mollit esse reprehenderit enim. Laboris aute tempor consequat adipisicing velit duis nulla esse exercitation commodo sit et.\r\n",
        "time": 177.9998,
        "completed": true,
        "points": 68
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9eae890b48f5752ff3d24",
        "description": "Id aute culpa nulla magna ad proident aliqua cillum reprehenderit. Sunt ad velit duis mollit. Cillum sit sunt Lorem exercitation ex. Ullamco voluptate tempor duis eiusmod. Proident sit irure esse ullamco dolor deserunt ad ipsum esse ea. Quis officia incididunt elit tempor esse do. Quis est ipsum quis enim commodo nisi minim fugiat.\r\n",
        "time": 164.6624,
        "completed": true,
        "points": 98
      },
      {
        "name": "Ponsonby",
        "id": "64a9eae80b731aef3cecfeed",
        "description": "Cillum do sint culpa deserunt dolor nisi. Deserunt duis consectetur labore Lorem consequat. Dolor ipsum incididunt quis ad Lorem do excepteur quis laborum. Proident aliqua sunt amet consectetur. Et adipisicing ipsum dolor ipsum consectetur. Nostrud do irure laboris ea.\r\n",
        "time": 107.4635,
        "completed": true,
        "points": 97
      },
      {
        "name": "Matakana",
        "id": "64a9eae87b0aa69761685c1c",
        "description": "Esse nisi minim elit irure officia aute irure eiusmod fugiat consectetur proident amet proident esse. Aliquip aliqua excepteur quis reprehenderit. Minim aliquip duis consequat fugiat laborum enim.\r\n",
        "time": 116.307,
        "completed": true,
        "points": 80
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9eae86f043f748c4e434e",
        "description": "Occaecat elit id irure in in occaecat pariatur commodo pariatur id voluptate reprehenderit sit reprehenderit. Reprehenderit proident ea adipisicing adipisicing aliqua commodo cillum in occaecat incididunt. Ea amet eu nulla pariatur aliqua voluptate labore exercitation dolore minim. Aliquip ipsum esse consequat est aliqua magna. Excepteur mollit mollit proident proident exercitation eu sint ex elit aliqua excepteur aute.\r\n",
        "time": 188.6413,
        "completed": true,
        "points": 91
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9eae8c8cb0e5a6e6a68e2",
        "description": "Eu ea ex ex adipisicing. In labore consectetur dolore dolor consectetur nulla eiusmod mollit velit laboris tempor. Ullamco laboris ullamco ullamco tempor consectetur non id amet esse. Sunt duis mollit proident dolore laborum mollit id officia nulla fugiat amet anim do. Tempor quis tempor velit consectetur sunt occaecat sunt. Sint sit mollit non consectetur quis dolor mollit tempor enim consequat velit. Occaecat magna magna sunt est laboris esse reprehenderit do amet consectetur ad amet tempor.\r\n",
        "time": 178.738,
        "completed": true,
        "points": 41
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9eae846ed2d11952d6548",
        "description": "Ex eiusmod in id labore incididunt reprehenderit ullamco velit nostrud dolore aliqua ipsum. Irure id anim qui minim. Ex nostrud nisi in cillum cupidatat duis ut aute cillum ea sunt culpa est consequat. Aute ex laboris non occaecat mollit qui duis in velit eu veniam anim esse non. Sunt non cupidatat laborum proident reprehenderit ea. Cupidatat culpa excepteur esse ipsum anim nulla aliquip exercitation consequat commodo velit proident proident.\r\n",
        "time": 86.1718,
        "completed": true,
        "points": 65
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9eae82e3d66c39a627062",
        "description": "Tempor voluptate officia eiusmod tempor laboris nulla. Nostrud cupidatat irure mollit sit anim. Eu cupidatat culpa qui duis reprehenderit. Duis sint dolore laborum sunt magna sunt aliqua amet elit voluptate est Lorem. Reprehenderit aliqua aliqua dolor ullamco dolor aliquip sint deserunt tempor elit minim excepteur. Deserunt eiusmod cillum quis do dolore in minim aliqua excepteur sit laborum dolore elit sunt. Est cillum do eiusmod nostrud exercitation velit adipisicing pariatur commodo ex velit non labore mollit.\r\n",
        "time": 194.1572,
        "completed": true,
        "points": 45
      }
    ]
  }
]