[
  {
    "id": "64a9f2c2393d1c6af4fda545",
    "name": "Suzanne Dillard",
    "steps": 58053,
    "location": {
      "latitude": -36.87846,
      "longitude": -185.27496
    },
    "quests": [
      {
        "name": "Takapuna",
        "id": "64a9f2c2e734be7d63a15d4f",
        "description": "Nisi exercitation labore fugiat officia reprehenderit Lorem consequat. Aute aute sint non aute occaecat proident ex. Non in amet duis Lorem occaecat et consectetur adipisicing duis magna tempor. Occaecat pariatur irure sit ex.\r\n",
        "time": 66.907,
        "completed": true,
        "points": 87
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9f2c2ab1247ba3c8295db",
        "description": "Nostrud voluptate laboris laboris voluptate deserunt consequat magna ad. Aute reprehenderit adipisicing occaecat ea eiusmod exercitation ea mollit laborum ipsum esse amet fugiat. Voluptate cupidatat reprehenderit consectetur in. Consectetur in dolor fugiat eu esse tempor fugiat. Cupidatat cupidatat tempor anim ullamco quis dolore anim voluptate sunt ullamco. Nostrud excepteur nisi et cillum nulla. Qui ullamco eiusmod ea aliqua veniam sit commodo voluptate.\r\n",
        "time": 192.2952,
        "completed": true,
        "points": 79
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c2d47ff9750c946bf6",
        "description": "Mollit exercitation elit exercitation irure est esse laborum esse eu sint ullamco enim. Dolor exercitation consectetur minim veniam. Enim aliquip aliqua ipsum esse duis non voluptate ea do sint est sit. Cillum adipisicing ad officia nisi cillum sit velit non in adipisicing excepteur est.\r\n",
        "time": 157.7313,
        "completed": true,
        "points": 51
      },
      {
        "name": "Parnell",
        "id": "64a9f2c2bf2751187683986d",
        "description": "Quis eu fugiat id fugiat consequat ullamco pariatur id. Laborum sint Lorem est ullamco aliqua officia esse aliqua sunt aliquip pariatur incididunt. Fugiat est sint nostrud aute ullamco officia nulla. Eu adipisicing ullamco veniam deserunt est. Cupidatat qui proident qui veniam consequat sit elit aute laboris cupidatat reprehenderit consectetur pariatur mollit.\r\n",
        "time": 107.621,
        "completed": true,
        "points": 23
      },
      {
        "name": "Karekare",
        "id": "64a9f2c2039450b4ed568023",
        "description": "Fugiat consectetur ea exercitation occaecat. Aliqua minim est consectetur consequat veniam sit voluptate adipisicing Lorem ea amet eiusmod fugiat consectetur. Commodo ullamco irure quis tempor qui labore nisi nisi voluptate nulla commodo culpa sunt. Pariatur officia est aliqua tempor non labore sint minim fugiat adipisicing irure culpa Lorem laboris. Incididunt ut dolor incididunt aliqua aute deserunt ipsum excepteur aliqua.\r\n",
        "time": 108.4845,
        "completed": true,
        "points": 53
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9f2c2f824c5ab634f5b12",
        "description": "Lorem irure aliqua dolor nostrud aute et ad. Laborum officia id incididunt aliqua consectetur voluptate pariatur do. Ea fugiat veniam anim laborum est velit culpa laboris irure ut. Laboris commodo occaecat incididunt amet ut commodo cupidatat ea eu officia nisi excepteur excepteur in.\r\n",
        "time": 80.1976,
        "completed": true,
        "points": 53
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c2f31a99ef5020c5bf",
        "description": "Enim sunt sint non quis aliquip. Mollit ad ex aute excepteur deserunt excepteur duis. In commodo sint culpa cupidatat aliqua sit consectetur laboris velit officia. Esse labore cillum do reprehenderit nisi anim amet excepteur ad.\r\n",
        "time": 194.0662,
        "completed": true,
        "points": 33
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9f2c2635a4ae4bec7e16f",
        "description": "Esse mollit officia quis ex nulla consequat nulla qui sunt cupidatat occaecat quis minim enim. Sunt nisi ea pariatur sunt incididunt consectetur aliquip occaecat magna exercitation et Lorem. Minim veniam mollit ea do deserunt qui nostrud exercitation cillum voluptate fugiat eiusmod. Sint sint in adipisicing nulla magna in ex aute laboris.\r\n",
        "time": 0.8982,
        "completed": true,
        "points": 61
      }
    ]
  },
  {
    "id": "64a9f2c26c467d00fbb4887b",
    "name": "Carmella Hines",
    "steps": 42311,
    "location": {
      "latitude": -36.87978,
      "longitude": -185.22789
    },
    "quests": [
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2c1827b55751086db",
        "description": "Minim pariatur reprehenderit eiusmod officia. Anim officia consectetur esse id duis excepteur consectetur qui consequat culpa exercitation veniam laboris. Ut ea incididunt minim consectetur dolore eu consectetur elit voluptate consequat incididunt veniam do incididunt. Deserunt proident pariatur cillum labore excepteur aute. Aliqua est ut qui cupidatat id excepteur minim sunt aliquip velit fugiat. Sint esse quis do amet aliquip sint fugiat ullamco.\r\n",
        "time": 140.448,
        "completed": true,
        "points": 40
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c2f558ac6b97cbba3b",
        "description": "Et irure nostrud Lorem proident consequat adipisicing sint pariatur incididunt. Dolore veniam magna elit magna qui velit labore eiusmod magna fugiat nulla qui excepteur. Reprehenderit ex minim officia id officia anim ex cupidatat et aliquip dolore aliquip amet ad. Et excepteur velit laborum ad. Veniam incididunt cupidatat est proident officia incididunt magna incididunt voluptate aliqua ad eu ea esse.\r\n",
        "time": 98.7332,
        "completed": true,
        "points": 38
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c2a335ccb488bb9f4d",
        "description": "Exercitation sint mollit incididunt non mollit ipsum. Deserunt occaecat minim sint sint fugiat do proident culpa est commodo proident dolore. Exercitation irure sit esse laborum et. Dolore in exercitation exercitation occaecat proident minim dolore.\r\n",
        "time": 79.9909,
        "completed": true,
        "points": 35
      },
      {
        "name": "Hunua Falls",
        "id": "64a9f2c27f223535b39a44d1",
        "description": "Qui incididunt consectetur dolore cupidatat velit esse velit. Et ullamco quis do sit. Ut Lorem reprehenderit voluptate anim veniam. Excepteur voluptate in ex incididunt ex culpa mollit non deserunt ex dolore minim anim. Dolore ea eu deserunt commodo deserunt elit laborum. Aute nulla enim in dolore quis aliquip elit incididunt enim nisi amet Lorem excepteur velit.\r\n",
        "time": 124.0756,
        "completed": true,
        "points": 99
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c2b8cfd3ab28080f1b",
        "description": "Id ipsum exercitation cillum laborum commodo culpa ut do commodo reprehenderit. Magna pariatur anim qui deserunt nisi fugiat eu Lorem consequat officia. Elit reprehenderit adipisicing non ullamco enim dolor occaecat esse tempor nostrud magna eu ex. Dolore irure in velit nisi dolore nostrud esse aute velit ad. Commodo incididunt aliquip ut sunt fugiat. Id eiusmod mollit duis eiusmod occaecat dolore. Ex et incididunt occaecat id qui excepteur fugiat labore nostrud id.\r\n",
        "time": 85.8301,
        "completed": true,
        "points": 48
      },
      {
        "name": "Orewa Beach",
        "id": "64a9f2c2d9fb3460dd10e8cd",
        "description": "Dolor dolore ad est non velit labore officia magna eu anim nisi esse officia. Dolor magna aliqua eu esse sunt duis magna sit adipisicing magna. Velit pariatur anim sunt excepteur magna occaecat ex qui deserunt aliquip velit mollit duis. Dolor irure aliqua aliquip adipisicing officia ullamco magna eu est aute magna tempor labore. Exercitation cupidatat esse voluptate quis mollit fugiat. Nostrud nisi consectetur irure nisi ipsum id enim.\r\n",
        "time": 1.5569,
        "completed": true,
        "points": 86
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9f2c298c5de8528e1cabd",
        "description": "Esse nisi magna nisi elit incididunt velit ipsum. Non aute deserunt veniam id reprehenderit reprehenderit dolore enim laborum labore in proident ad. Laborum sunt commodo anim amet non dolore sint velit. Quis labore ut irure eu est tempor ut nostrud fugiat. Ad minim dolor cillum qui ut incididunt id cillum ullamco amet. Quis id commodo ullamco magna et irure aliquip. Reprehenderit eiusmod ex voluptate voluptate ad adipisicing consequat ad dolor sunt aliqua consectetur.\r\n",
        "time": 51.4957,
        "completed": true,
        "points": 66
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9f2c264eda2311d3bb083",
        "description": "Occaecat sint eiusmod eu culpa ad et proident cillum aute. Exercitation qui voluptate laboris anim amet cillum fugiat. Deserunt irure eiusmod dolor tempor et aliqua. Esse deserunt incididunt commodo ut duis sit aliqua officia duis. Dolor esse sit Lorem proident magna ad velit in ad anim occaecat eu qui occaecat. Do deserunt velit est amet sit culpa fugiat Lorem adipisicing cillum exercitation adipisicing duis aute. Amet pariatur irure consequat consequat laboris ipsum id esse eu irure minim aliqua.\r\n",
        "time": 176.5087,
        "completed": true,
        "points": 99
      },
      {
        "name": "Parnell",
        "id": "64a9f2c2b85f786da199da58",
        "description": "Tempor cupidatat amet id velit laboris incididunt. Labore exercitation do elit quis deserunt nisi. Non anim sunt minim exercitation Lorem esse. Incididunt Lorem dolore id nisi aliquip qui ex esse enim occaecat labore mollit excepteur. Ullamco cupidatat eiusmod incididunt exercitation fugiat elit ipsum magna adipisicing consectetur anim enim. Qui anim fugiat dolore eiusmod ullamco.\r\n",
        "time": 112.4224,
        "completed": true,
        "points": 58
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c23623bc36e4c97423",
        "description": "Labore Lorem sunt laborum labore laboris quis nulla aute. Aute voluptate laboris mollit reprehenderit. Deserunt est minim tempor adipisicing. Est nostrud dolore exercitation excepteur dolore dolor veniam cillum reprehenderit est excepteur Lorem qui. Ullamco magna occaecat eiusmod magna reprehenderit sunt id. In ad duis tempor proident nulla eu ad adipisicing laboris.\r\n",
        "time": 37.6814,
        "completed": true,
        "points": 75
      }
    ]
  },
  {
    "id": "64a9f2c25e986678ac0c43c5",
    "name": "Carmen Landry",
    "steps": 60148,
    "location": {
      "latitude": -36.88938,
      "longitude": -185.23107
    },
    "quests": [
      {
        "name": "Rangitoto Island",
        "id": "64a9f2c2fd8919b2de77caab",
        "description": "Excepteur irure quis culpa nostrud deserunt officia quis tempor aliquip quis sint consequat exercitation eu. Consectetur ut ut exercitation laborum. Incididunt tempor ad sint anim nostrud eiusmod qui deserunt Lorem ut. Ipsum culpa anim elit voluptate in id labore deserunt eu.\r\n",
        "time": 133.0108,
        "completed": true,
        "points": 56
      },
      {
        "name": "Sky Tower",
        "id": "64a9f2c26ccd1581c6233a23",
        "description": "Qui enim aliquip veniam do fugiat aute est elit et aute aliqua. Irure occaecat enim nisi cupidatat. Quis sint adipisicing nulla proident ut eiusmod consectetur eiusmod elit. Ex nulla voluptate in proident occaecat eu sit ad exercitation cupidatat deserunt consequat. Culpa ut non amet esse Lorem laboris aliquip adipisicing consequat proident quis fugiat sint ullamco.\r\n",
        "time": 184.7613,
        "completed": true,
        "points": 27
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9f2c2cd24fa911803d0dc",
        "description": "Ex in ex incididunt cillum. Labore do cupidatat nostrud cillum voluptate exercitation et. Dolore elit consequat qui minim incididunt do ex cupidatat nulla est aute aute consequat.\r\n",
        "time": 11.0718,
        "completed": true,
        "points": 96
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2556b2103337ac18f",
        "description": "Culpa cupidatat ullamco proident minim nisi id. Irure et anim ea labore magna commodo voluptate non reprehenderit enim laboris. Consectetur ut mollit ullamco Lorem do dolor ex magna commodo veniam non occaecat. Nisi eiusmod elit cupidatat proident laborum veniam non aute quis ipsum eiusmod enim magna.\r\n",
        "time": 38.7385,
        "completed": true,
        "points": 55
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c21b14df4b1edd4d16",
        "description": "Minim aliqua quis labore cillum nulla ea anim pariatur duis eu occaecat proident. Occaecat sit ullamco pariatur in ex. Non cupidatat amet pariatur nulla Lorem labore est aute ea eiusmod anim nostrud excepteur eiusmod. Ipsum cillum amet exercitation enim proident consequat Lorem dolore ex esse fugiat. Sint amet consectetur mollit occaecat exercitation velit officia dolor sunt occaecat nostrud incididunt. Ex cillum nisi do adipisicing Lorem minim et exercitation ad dolore adipisicing. Dolore eu aute sint quis proident tempor adipisicing.\r\n",
        "time": 41.9013,
        "completed": true,
        "points": 24
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c2db91309fe91fa7a2",
        "description": "Aliqua excepteur tempor non enim ullamco pariatur aute pariatur sint duis dolor deserunt duis deserunt. Dolore ex quis et nostrud ex sit. Nisi mollit minim dolore consectetur nulla occaecat exercitation reprehenderit. Sit in ipsum nulla nulla anim eiusmod enim eu dolor sunt do veniam sunt. Exercitation commodo officia consectetur enim reprehenderit ad sint et ullamco quis laboris dolore in cillum. Magna eu aliquip consectetur non culpa.\r\n",
        "time": 56.9206,
        "completed": true,
        "points": 83
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2c902a0a51691dff7",
        "description": "Proident elit proident elit eiusmod culpa veniam consectetur nostrud adipisicing. Amet nisi aliquip labore mollit cillum sint dolore veniam esse magna elit. Nulla eu non est Lorem minim sunt labore sunt qui mollit quis commodo aliqua. Aliquip pariatur dolor non pariatur laboris aute nulla culpa duis.\r\n",
        "time": 25.6633,
        "completed": true,
        "points": 90
      },
      {
        "name": "Parnell",
        "id": "64a9f2c2085734226359f9e6",
        "description": "Pariatur aliquip in pariatur elit cupidatat exercitation consequat pariatur aute incididunt. Anim qui excepteur elit dolor consectetur occaecat nulla. Sit elit qui occaecat qui duis occaecat cupidatat commodo. Velit adipisicing qui sit do nisi cupidatat dolor cupidatat tempor excepteur.\r\n",
        "time": 146.0674,
        "completed": true,
        "points": 55
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c21f72639c80277cec",
        "description": "Eiusmod quis commodo in id exercitation in. Do proident sit mollit aliquip irure cupidatat consectetur aliquip veniam cillum aliqua sit. Aliquip labore ut Lorem adipisicing do. Enim excepteur ut labore duis reprehenderit culpa culpa in aliquip. Laboris tempor non amet sint ex incididunt do incididunt mollit est officia reprehenderit deserunt.\r\n",
        "time": 59.0176,
        "completed": true,
        "points": 83
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c24a54fcf28b5b24c6",
        "description": "Ea mollit laborum non officia reprehenderit cupidatat cillum enim. In adipisicing adipisicing est duis sunt incididunt sit deserunt veniam ipsum velit mollit. Cupidatat ipsum aute laborum excepteur dolor. Laborum et amet officia quis exercitation veniam qui qui elit.\r\n",
        "time": 46.008,
        "completed": true,
        "points": 63
      }
    ]
  },
  {
    "id": "64a9f2c2654899720e8c06aa",
    "name": "Oneal Guerrero",
    "steps": 57320,
    "location": {
      "latitude": -36.88533,
      "longitude": -185.23003
    },
    "quests": [
      {
        "name": "Awhitu Peninsula",
        "id": "64a9f2c2d066498978a6a202",
        "description": "Ea non mollit enim et sint. Culpa enim magna laboris officia irure commodo aute magna. Cupidatat nostrud nulla voluptate duis voluptate ex. Consequat id minim cillum id aliquip proident cupidatat cillum nulla nostrud. Mollit commodo irure cillum amet Lorem est labore occaecat cupidatat qui sit dolore nostrud. Eu exercitation qui id officia excepteur cillum aute commodo. Pariatur tempor pariatur ullamco reprehenderit ea non quis sint occaecat tempor pariatur eiusmod exercitation.\r\n",
        "time": 72.5699,
        "completed": true,
        "points": 29
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c229d75b3879645d79",
        "description": "Ad veniam culpa minim duis enim minim. Sunt proident proident nulla nisi nulla mollit do enim id qui. Esse officia eiusmod et minim cillum reprehenderit aliquip quis non cupidatat.\r\n",
        "time": 33.0277,
        "completed": true,
        "points": 89
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c2c640014b4b1f5f57",
        "description": "Nostrud elit duis est eiusmod consectetur culpa consectetur laborum deserunt. Nisi reprehenderit ut duis eu Lorem nostrud laboris adipisicing. Cillum aliquip veniam Lorem elit est Lorem aute amet ad sint consectetur qui.\r\n",
        "time": 2.6521,
        "completed": true,
        "points": 75
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c287834e2b367bcfac",
        "description": "Aliquip laboris laborum reprehenderit ex quis esse labore. Sit tempor amet proident duis voluptate laborum nisi sunt enim enim dolor sint aliqua. Aliquip culpa sit laboris veniam excepteur proident cillum eiusmod veniam nulla esse anim adipisicing.\r\n",
        "time": 110.0407,
        "completed": true,
        "points": 57
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2d2720f90065b25cc",
        "description": "Aliqua anim exercitation enim velit nisi excepteur. Exercitation duis consequat reprehenderit aliquip ipsum id enim reprehenderit culpa. Reprehenderit deserunt sunt reprehenderit exercitation irure in amet elit. Culpa velit est ad duis consectetur magna ad occaecat ut duis dolore voluptate laborum laboris. Qui nostrud minim pariatur velit voluptate.\r\n",
        "time": 34.9671,
        "completed": true,
        "points": 25
      },
      {
        "name": "Long Bay Regional Park",
        "id": "64a9f2c2afd2930d248340c2",
        "description": "Exercitation labore ipsum anim culpa consectetur. Aliquip qui non aliquip id eiusmod nisi. Ullamco dolore commodo quis adipisicing dolor laboris sit nulla in sint deserunt. Velit qui sit irure sit. Aliquip qui aliqua nostrud duis dolore laboris dolore qui exercitation pariatur deserunt magna non.\r\n",
        "time": 20.0299,
        "completed": true,
        "points": 77
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c2e3328bfc04b6981a",
        "description": "Sit veniam commodo aliquip in amet aliquip ut do minim est Lorem commodo veniam excepteur. Cupidatat ipsum ex adipisicing quis pariatur magna sit ex ipsum. Qui dolore fugiat laboris magna pariatur. Occaecat officia officia occaecat commodo sunt sit adipisicing pariatur in commodo aliquip.\r\n",
        "time": 142.4903,
        "completed": true,
        "points": 91
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9f2c25d79ff08428aea55",
        "description": "Dolore eiusmod eiusmod ipsum pariatur cillum aliquip duis ea veniam deserunt consequat minim. Veniam ad non nulla ea irure. Ut elit reprehenderit voluptate incididunt deserunt tempor aliqua in sunt nulla. Quis non occaecat magna occaecat. Nulla dolore nisi nulla irure dolor enim nisi quis irure nostrud minim non.\r\n",
        "time": 135.2959,
        "completed": true,
        "points": 52
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c267812a122fb484f5",
        "description": "Minim reprehenderit aliqua cillum adipisicing deserunt enim excepteur duis sunt. Laboris exercitation ullamco duis excepteur laboris amet adipisicing. Ipsum nisi tempor esse ut eiusmod duis incididunt magna.\r\n",
        "time": 58.6936,
        "completed": true,
        "points": 37
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c2ce565e8f953e5a2e",
        "description": "Occaecat occaecat incididunt laborum cupidatat non sunt mollit fugiat anim consequat. Eiusmod exercitation id cillum proident irure duis deserunt ipsum magna et ullamco quis amet. Id aute dolor incididunt culpa in cupidatat eiusmod nulla et anim ut laborum elit. Id labore exercitation aliquip aliqua ut commodo anim quis.\r\n",
        "time": 86.2813,
        "completed": true,
        "points": 55
      }
    ]
  },
  {
    "id": "64a9f2c2fbc0a9fb78f32560",
    "name": "Stone Waters",
    "steps": 29856,
    "location": {
      "latitude": -36.88262,
      "longitude": -185.24359
    },
    "quests": [
      {
        "name": "Eden Park",
        "id": "64a9f2c2decfc4e91e523085",
        "description": "Enim cillum pariatur qui dolore Lorem anim. Duis laboris Lorem nostrud laborum exercitation proident. Occaecat officia sunt nostrud exercitation anim laborum consequat proident sint ullamco magna sit. Pariatur ea labore mollit reprehenderit minim commodo non minim incididunt elit adipisicing aute cupidatat in.\r\n",
        "time": 93.9197,
        "completed": true,
        "points": 15
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9f2c2561852e027416859",
        "description": "Est deserunt duis laborum enim labore culpa nisi est exercitation culpa adipisicing sunt dolor laborum. Duis incididunt laboris elit consequat tempor officia tempor magna culpa labore tempor. Ad ex eiusmod adipisicing anim in pariatur consectetur esse eu nulla tempor Lorem adipisicing. Amet ullamco labore esse dolore incididunt occaecat nisi elit. Consequat magna irure amet occaecat nulla proident pariatur minim sint commodo.\r\n",
        "time": 159.6502,
        "completed": true,
        "points": 41
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c2b0b7667a239c9aa3",
        "description": "Laboris Lorem duis proident commodo amet Lorem pariatur aliquip proident esse esse ex duis laborum. Aliqua cillum nulla in ipsum culpa sunt labore velit occaecat voluptate ad. Nostrud ullamco quis ut proident commodo nulla dolor mollit laboris officia nostrud sunt non consectetur. Nisi aliqua ad duis quis nulla nisi veniam proident do. Ex Lorem sit enim reprehenderit consectetur amet esse sint. Sint sunt ut adipisicing pariatur. Nulla velit irure sit sit id sit pariatur sit duis ipsum occaecat.\r\n",
        "time": 192.6534,
        "completed": true,
        "points": 90
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c2f5d85724027944ef",
        "description": "Ea tempor excepteur incididunt eiusmod cupidatat irure ut nisi reprehenderit minim Lorem. Nisi sunt ullamco culpa consectetur. Id cillum eiusmod id sunt.\r\n",
        "time": 175.7726,
        "completed": true,
        "points": 34
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9f2c2c12bfc48a93fbe5e",
        "description": "Quis proident elit fugiat laborum ea labore. Aliqua proident dolor non labore laboris ut reprehenderit. Magna consequat aliqua laboris duis occaecat aute quis velit sint fugiat anim. Veniam sint excepteur dolore dolore commodo culpa excepteur laborum aliquip dolore incididunt quis. Laborum incididunt officia incididunt magna mollit magna aliqua incididunt eiusmod proident eu laboris excepteur fugiat. Ex dolore cillum nulla exercitation.\r\n",
        "time": 5.2341,
        "completed": true,
        "points": 61
      },
      {
        "name": "Piha Beach",
        "id": "64a9f2c2d7bceb97926ad89c",
        "description": "Cillum fugiat aute Lorem magna veniam Lorem. Nulla sint et consectetur nisi ipsum. Laboris id culpa anim dolor. Incididunt laborum aliquip ex fugiat eiusmod do. Incididunt ex aliqua deserunt aliquip dolore excepteur.\r\n",
        "time": 123.0597,
        "completed": true,
        "points": 60
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c26f68df750a1a3332",
        "description": "Sint consectetur anim ea laborum. Sunt aliquip magna enim commodo do. Laborum magna ullamco dolor incididunt nostrud in aliquip proident non in eu culpa officia voluptate.\r\n",
        "time": 78.279,
        "completed": true,
        "points": 81
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c24d68831a07de2066",
        "description": "Ad id culpa nulla Lorem voluptate ex duis aliqua reprehenderit. Excepteur anim officia consectetur elit pariatur consequat labore eiusmod. Occaecat minim magna ipsum do consectetur sunt ullamco consequat officia. Non cupidatat enim consequat deserunt ullamco voluptate fugiat consequat ex pariatur qui. Officia irure pariatur sunt duis aliquip incididunt. Nostrud minim ea Lorem ut deserunt aliqua fugiat officia in culpa nisi laboris id.\r\n",
        "time": 102.1094,
        "completed": true,
        "points": 52
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c2f78f7120853201af",
        "description": "Id culpa eu anim adipisicing ea cupidatat aliquip deserunt. Elit Lorem aute officia nisi laboris labore voluptate est consectetur veniam magna. Esse sint deserunt cillum ut fugiat velit excepteur aute. Fugiat qui tempor deserunt ex pariatur proident fugiat occaecat mollit cillum dolor culpa veniam.\r\n",
        "time": 184.3271,
        "completed": true,
        "points": 35
      }
    ]
  },
  {
    "id": "64a9f2c25a4eb5c8e002131d",
    "name": "Iva Mueller",
    "steps": 34988,
    "location": {
      "latitude": -36.88756,
      "longitude": -185.20037
    },
    "quests": [
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2a3cc1dd0c5963baf",
        "description": "Ipsum laborum minim pariatur dolor laboris labore do in ex reprehenderit minim. Commodo magna labore veniam anim. Dolor laborum labore sint dolore reprehenderit. Excepteur sint ut magna cupidatat reprehenderit occaecat esse sint veniam dolor. Minim amet quis ea incididunt labore in occaecat nulla dolore consequat commodo mollit duis eiusmod. Sit exercitation irure ut velit pariatur ipsum reprehenderit.\r\n",
        "time": 131.5857,
        "completed": true,
        "points": 77
      },
      {
        "name": "Karekare",
        "id": "64a9f2c2da556660c0f95932",
        "description": "Veniam non id est aute velit commodo est magna. In sit commodo cillum pariatur minim proident minim. Reprehenderit adipisicing id ullamco proident reprehenderit ea fugiat cillum. Cupidatat aliqua aliqua anim veniam. Sunt veniam officia commodo velit est nostrud laborum laboris elit cillum labore minim deserunt fugiat. Do do ullamco magna exercitation consequat qui id enim laboris ex mollit commodo occaecat. Ex nostrud labore magna voluptate sit Lorem ea ipsum cupidatat cupidatat.\r\n",
        "time": 88.7053,
        "completed": true,
        "points": 71
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9f2c283894e21625c55f3",
        "description": "Voluptate nostrud occaecat quis nulla labore proident sint tempor eu sit elit minim excepteur est. Dolor esse culpa aute et aute. Qui ex voluptate nostrud dolore officia enim esse incididunt aliqua est amet dolor.\r\n",
        "time": 138.8134,
        "completed": true,
        "points": 76
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2c20f59ec3eec8211",
        "description": "Anim nisi veniam culpa quis exercitation ullamco consectetur veniam nostrud sunt qui. Occaecat sunt in occaecat minim minim ea fugiat anim amet commodo. Esse esse commodo cillum nulla ea magna officia culpa sunt ut eiusmod. Anim anim ut cillum do aliquip est minim nulla.\r\n",
        "time": 52.2016,
        "completed": true,
        "points": 20
      },
      {
        "name": "Eden Park",
        "id": "64a9f2c219dbcb91400367cb",
        "description": "Nostrud cillum culpa voluptate irure adipisicing excepteur ut dolore minim ad esse cillum. Lorem minim adipisicing mollit pariatur officia dolor aute reprehenderit officia dolor veniam in commodo. Labore aute enim laboris reprehenderit pariatur tempor irure commodo eiusmod eiusmod aute veniam commodo Lorem.\r\n",
        "time": 185.4236,
        "completed": true,
        "points": 22
      },
      {
        "name": "Hunua Falls",
        "id": "64a9f2c2126b836f89add111",
        "description": "Deserunt consectetur quis commodo Lorem sunt cupidatat id eu officia proident minim. Sint id nulla pariatur consequat. Incididunt est elit consectetur ea in pariatur. Duis quis mollit aute quis. Irure quis esse pariatur aute excepteur veniam. Velit ipsum consequat dolore ad mollit magna culpa occaecat aliqua laboris adipisicing officia laboris sint.\r\n",
        "time": 199.6249,
        "completed": true,
        "points": 98
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9f2c24300759a9ad2e6a4",
        "description": "Quis non irure enim magna. Aliquip velit incididunt adipisicing magna adipisicing quis deserunt laborum ullamco. Consectetur officia adipisicing enim enim veniam aliquip excepteur cupidatat veniam pariatur.\r\n",
        "time": 170.9025,
        "completed": true,
        "points": 59
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9f2c2dfb0c4f849c97e4e",
        "description": "Fugiat eu fugiat id et labore elit veniam aliqua aliquip ea laboris eu est. Est non ut adipisicing et eu mollit laboris laboris amet. Esse enim minim reprehenderit veniam. Ad deserunt reprehenderit aliqua in occaecat mollit aliqua velit duis occaecat id ad dolore. Nostrud ex aliquip nulla non irure aliquip fugiat. Cupidatat officia nulla nisi enim deserunt exercitation.\r\n",
        "time": 79.0701,
        "completed": true,
        "points": 74
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c23c3cc290acc26346",
        "description": "Cillum ad in commodo non tempor excepteur culpa. Quis enim magna occaecat anim exercitation occaecat reprehenderit consequat nulla amet id nostrud. Sint culpa fugiat labore ut eu anim reprehenderit proident laborum irure laborum cupidatat.\r\n",
        "time": 108.693,
        "completed": true,
        "points": 25
      }
    ]
  },
  {
    "id": "64a9f2c2a7fd062e5c47077d",
    "name": "Georgette Carey",
    "steps": 19798,
    "location": {
      "latitude": -36.87364,
      "longitude": -185.23254
    },
    "quests": [
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c2620b42a69a3c6c53",
        "description": "Magna veniam anim minim dolor. Amet pariatur Lorem consequat ad magna dolore mollit deserunt culpa irure. Cupidatat sint pariatur ad consequat sint veniam nulla est non et. Nostrud sunt aute ad et adipisicing ut voluptate Lorem pariatur ullamco consequat non sint. Culpa ipsum Lorem esse fugiat aliquip aliquip ullamco ad velit cillum.\r\n",
        "time": 148.0868,
        "completed": true,
        "points": 73
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c2b3051cfc40fb4d30",
        "description": "Quis ipsum dolor elit anim veniam. Ipsum in irure adipisicing tempor do pariatur proident qui aliqua in officia sit. Commodo elit nulla minim ullamco quis. Qui ullamco occaecat dolor aliqua ut. Sunt laboris pariatur adipisicing consequat ut veniam. Incididunt ad consectetur aute nostrud magna aliqua esse. Veniam minim dolor eu laborum fugiat mollit dolore veniam eu nulla.\r\n",
        "time": 116.5745,
        "completed": true,
        "points": 26
      },
      {
        "name": "Parnell",
        "id": "64a9f2c253cb1e6fea637e85",
        "description": "Laboris aute fugiat do sunt eu minim aliqua eu consequat Lorem voluptate dolor labore. Sit adipisicing sint consequat cupidatat anim elit nostrud labore do elit. Cupidatat anim fugiat aliquip non. Excepteur sint nulla cupidatat non nulla et cupidatat irure fugiat dolore consequat fugiat esse fugiat. Nisi ex nisi amet occaecat sunt laborum voluptate consequat. Ipsum dolor culpa id ex. Est velit elit voluptate non et excepteur excepteur id deserunt enim et excepteur aliquip sunt.\r\n",
        "time": 70.394,
        "completed": true,
        "points": 82
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c25f299dc905131fb2",
        "description": "Sunt duis quis ea do labore. Esse ut reprehenderit velit occaecat sit aliquip occaecat labore cillum adipisicing. Occaecat occaecat esse dolor non dolor ex ad aliqua eiusmod eiusmod. Occaecat aliqua dolore ea nisi nulla reprehenderit cillum reprehenderit deserunt.\r\n",
        "time": 166.1822,
        "completed": true,
        "points": 56
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c20d6204063a7650d8",
        "description": "Eiusmod ipsum anim culpa officia id pariatur. Voluptate esse enim est excepteur. Ullamco aute est cillum do veniam aliquip voluptate. Reprehenderit adipisicing eu pariatur non pariatur cupidatat magna ex. Deserunt incididunt sunt occaecat laborum laborum aliquip.\r\n",
        "time": 93.43,
        "completed": true,
        "points": 43
      },
      {
        "name": "Devonport",
        "id": "64a9f2c26e97610e6ffe0162",
        "description": "Labore labore et aute id est deserunt irure commodo. Do nostrud nisi in aliquip in. Duis minim quis proident elit commodo laboris cillum officia quis. Incididunt exercitation dolore enim magna enim officia tempor eu nostrud ea pariatur fugiat eu mollit. Tempor eu ad excepteur labore reprehenderit in in consectetur qui irure proident reprehenderit. Minim ullamco cillum excepteur cupidatat laboris id adipisicing adipisicing deserunt nulla quis sunt ipsum.\r\n",
        "time": 162.5084,
        "completed": true,
        "points": 54
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2dd0d5c6a75b51990",
        "description": "Officia aliquip minim consequat amet anim proident. Occaecat elit quis do et. In proident laborum irure sunt veniam consectetur exercitation incididunt irure duis. Eu anim id sit consectetur magna ad pariatur minim sint nulla aliqua. Qui culpa qui do veniam reprehenderit Lorem aliqua velit pariatur ullamco aute.\r\n",
        "time": 183.3378,
        "completed": true,
        "points": 89
      },
      {
        "name": "Silo Park",
        "id": "64a9f2c2e4fbf374d3356efd",
        "description": "Tempor occaecat fugiat laborum quis aliqua aute id nostrud id. Pariatur do culpa ad consequat velit Lorem sunt aute dolore id aliquip labore esse cupidatat. Non voluptate voluptate excepteur pariatur. Labore qui cupidatat aliquip labore et qui excepteur consequat. Occaecat aliqua tempor consequat do dolore reprehenderit aliquip nostrud dolore. Irure cupidatat elit aliquip aliqua do. Dolor minim sint pariatur officia adipisicing sint id pariatur.\r\n",
        "time": 160.9597,
        "completed": true,
        "points": 11
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c25d09f5691de0eacd",
        "description": "Labore qui irure aliqua incididunt esse qui eu enim ea. Deserunt consequat occaecat fugiat labore laboris minim. Velit ullamco est amet qui nostrud ut anim dolor labore duis occaecat sunt et exercitation.\r\n",
        "time": 113.9725,
        "completed": true,
        "points": 84
      }
    ]
  },
  {
    "id": "64a9f2c214b24c4f5ec017da",
    "name": "Carver Gonzalez",
    "steps": 9268,
    "location": {
      "latitude": -36.89058,
      "longitude": -185.2144
    },
    "quests": [
      {
        "name": "Silo Park",
        "id": "64a9f2c2c90c677246c2ee4c",
        "description": "Sit minim cupidatat cupidatat culpa velit cillum enim proident sint ad enim nulla ex. Minim nulla laboris amet sint incididunt dolor et elit dolore aliquip. Id sunt tempor in tempor duis do dolore aute laborum in in incididunt aute. Adipisicing aliquip irure eiusmod mollit voluptate et duis. Cillum officia laboris ea reprehenderit sit amet adipisicing. Eiusmod velit culpa ad elit tempor anim labore officia officia amet excepteur duis.\r\n",
        "time": 30.6063,
        "completed": true,
        "points": 59
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2d198bb941a2c42b6",
        "description": "Deserunt qui dolore pariatur esse minim anim tempor ad. Lorem nisi duis sit ad aliquip aliqua consequat id. Veniam aliquip exercitation dolore ullamco laboris adipisicing in fugiat anim.\r\n",
        "time": 123.2728,
        "completed": true,
        "points": 76
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9f2c224375626f14e73ed",
        "description": "Minim aliquip pariatur consequat pariatur in Lorem ea esse aliqua est consectetur consequat labore. Deserunt nulla laborum ut commodo et proident non occaecat cillum dolore esse qui in. Exercitation sit ullamco ea occaecat voluptate ipsum laboris ad duis cillum quis. Commodo incididunt exercitation ex aute laborum occaecat do. Tempor reprehenderit voluptate quis dolore exercitation. Consequat ipsum veniam nostrud elit sunt reprehenderit aliquip minim anim anim aliquip non aliqua sint. Amet dolore commodo tempor laborum ad.\r\n",
        "time": 149.2768,
        "completed": true,
        "points": 83
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c238a2d58a8d044f34",
        "description": "In aliquip proident velit exercitation pariatur occaecat voluptate. Excepteur fugiat exercitation nulla fugiat ad dolore dolor minim occaecat. Lorem voluptate eu consequat aute quis labore veniam cupidatat sit id exercitation. Sint proident est velit consequat reprehenderit mollit irure laborum sit quis ad tempor. Qui nostrud aliqua sunt sint.\r\n",
        "time": 185.534,
        "completed": true,
        "points": 12
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c29e83ba8c852c5564",
        "description": "Mollit sunt sunt consectetur aliqua elit nulla occaecat mollit Lorem irure amet adipisicing exercitation reprehenderit. Ut dolore labore enim sit incididunt. Nisi sunt excepteur dolore in incididunt ut et mollit dolore irure. Deserunt in ea consequat Lorem elit magna nulla fugiat anim elit occaecat.\r\n",
        "time": 105.1913,
        "completed": true,
        "points": 22
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c2abd4a7a03c208704",
        "description": "Magna velit occaecat cillum adipisicing aliqua minim elit ut id. Et sunt enim ipsum amet et sunt minim aliquip ex do. Labore irure eu nisi tempor amet exercitation irure cupidatat. Ut cupidatat aliqua deserunt magna incididunt qui incididunt voluptate deserunt in elit dolor aliqua.\r\n",
        "time": 196.3142,
        "completed": true,
        "points": 16
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9f2c2e469e55742a58309",
        "description": "Veniam consectetur veniam in nostrud. Deserunt eiusmod ipsum commodo ipsum culpa laborum voluptate nisi sint quis do amet voluptate in. Velit et mollit ex qui ex aute veniam anim do. Tempor adipisicing ullamco irure cillum ex dolor anim duis nostrud mollit elit esse. Voluptate sint irure do est excepteur deserunt sunt ex nisi adipisicing in esse magna exercitation. Tempor ipsum sit pariatur anim Lorem quis laborum sunt fugiat. Laboris minim tempor labore reprehenderit elit aliqua est aliquip in tempor quis.\r\n",
        "time": 170.7927,
        "completed": true,
        "points": 21
      },
      {
        "name": "Silo Park",
        "id": "64a9f2c2d2a1d789c9bf3776",
        "description": "Id aliquip reprehenderit do velit. Duis amet ea ex voluptate ipsum non quis ea. Reprehenderit dolore minim consequat consequat culpa labore id aliquip esse. Officia duis exercitation in exercitation. Sit cupidatat est tempor aute veniam non ipsum consequat enim.\r\n",
        "time": 45.7259,
        "completed": true,
        "points": 36
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c2312db8fd8fc2ee06",
        "description": "Eu nisi nisi duis sint id. Dolore do aute nulla esse sit. Sunt ullamco incididunt enim minim esse nisi occaecat et veniam occaecat laborum. Reprehenderit amet ex enim officia consectetur do elit aliquip exercitation ad.\r\n",
        "time": 166.3587,
        "completed": true,
        "points": 66
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c273a2f080c912c3e4",
        "description": "Officia aute nostrud sint irure. Incididunt amet et aliquip nostrud dolor deserunt sint aute. Fugiat id quis pariatur dolor voluptate. Tempor proident labore et et in sit elit incididunt quis officia magna amet in velit. Do et amet nostrud exercitation proident id adipisicing pariatur aliquip. Do non irure qui nostrud qui pariatur consectetur enim labore proident cillum.\r\n",
        "time": 38.4443,
        "completed": true,
        "points": 87
      }
    ]
  },
  {
    "id": "64a9f2c230fbd5bc7a9cafa8",
    "name": "Petersen Edwards",
    "steps": 84104,
    "location": {
      "latitude": -36.88066,
      "longitude": -185.21895
    },
    "quests": [
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9f2c2644facab92c7cb75",
        "description": "Ipsum non esse non et nulla labore occaecat enim ut anim. Aliquip amet esse pariatur nisi. Elit aliquip in deserunt culpa tempor dolor duis. Irure enim sint cupidatat nisi pariatur aliquip. Incididunt exercitation adipisicing officia ullamco consequat aliqua nisi irure. Consequat consectetur mollit fugiat minim nulla eu magna sint dolore. Ea ex enim aliqua velit et veniam minim.\r\n",
        "time": 11.3471,
        "completed": true,
        "points": 64
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2a91c90abdfd26d22",
        "description": "Dolor sit veniam ad aliquip excepteur. Do proident reprehenderit laboris culpa laborum amet. Qui esse magna ipsum sunt veniam exercitation. Nisi occaecat deserunt dolor eiusmod nostrud exercitation in sint Lorem et duis pariatur amet. Enim elit et dolor consequat labore nisi non enim veniam commodo veniam sint labore.\r\n",
        "time": 23.1105,
        "completed": true,
        "points": 93
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9f2c248ab2ae54c244a2d",
        "description": "Labore fugiat qui ea dolore qui sit ex reprehenderit consequat nostrud veniam labore anim. Esse sit ut deserunt in incididunt duis aute quis consectetur reprehenderit. Fugiat incididunt deserunt cupidatat dolor eu nulla fugiat ut cillum laboris.\r\n",
        "time": 105.764,
        "completed": true,
        "points": 100
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9f2c2b0aacdef44fa1c93",
        "description": "Eu enim nostrud velit in aliqua aute ex fugiat pariatur in aliqua sunt eiusmod magna. Labore irure sit dolor anim pariatur do anim. Commodo excepteur esse voluptate labore in sint. Culpa excepteur ullamco ut sit consequat adipisicing qui ex. Incididunt elit ullamco in aute sint velit aute sunt occaecat deserunt. Exercitation anim nisi excepteur cillum proident est.\r\n",
        "time": 112.159,
        "completed": true,
        "points": 79
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2b45baa42dfa2a168",
        "description": "Amet elit sit tempor fugiat non ullamco tempor exercitation elit ad eiusmod et in est. Aliqua pariatur amet quis in nulla eu ullamco aliqua culpa ad ad duis. Fugiat non culpa pariatur ullamco. Duis mollit in minim mollit aute ut laborum sint in aute nulla labore. Excepteur est velit sit eu ex ad veniam sint commodo.\r\n",
        "time": 1.3409,
        "completed": true,
        "points": 77
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2fa6aec5c34e37c92",
        "description": "Voluptate commodo aliquip duis excepteur est consequat ullamco sint et tempor laborum sit. Sint sit in eu eu mollit incididunt nulla occaecat Lorem proident laborum ut est. Excepteur duis duis officia incididunt non ad non proident veniam officia eu. Id exercitation commodo pariatur pariatur adipisicing pariatur tempor dolore et sunt. Id qui occaecat aliqua adipisicing labore nostrud id dolor voluptate anim mollit tempor.\r\n",
        "time": 67.349,
        "completed": true,
        "points": 83
      },
      {
        "name": "Queen Street",
        "id": "64a9f2c283d89078beeb57dc",
        "description": "Tempor minim pariatur id exercitation ullamco est occaecat enim ad fugiat minim commodo. Duis esse voluptate proident consectetur veniam aute anim veniam Lorem aliqua. Eu adipisicing sint voluptate sunt quis mollit consectetur laboris exercitation est. Commodo cillum occaecat quis amet excepteur do nisi Lorem reprehenderit cupidatat aliqua. Minim ex excepteur dolore labore sit reprehenderit occaecat cillum ad duis dolore ipsum aliquip sit. Adipisicing anim amet pariatur incididunt ut ad ad minim. Dolor nulla nisi dolor non eiusmod ut reprehenderit ad.\r\n",
        "time": 70.4977,
        "completed": true,
        "points": 36
      },
      {
        "name": "Parnell",
        "id": "64a9f2c2d9ed0a09945abd4b",
        "description": "Dolor occaecat ea aute excepteur proident incididunt. Ea anim anim veniam duis pariatur aliquip pariatur duis veniam fugiat commodo fugiat aliquip anim. Qui ullamco proident et reprehenderit fugiat aute incididunt eu Lorem esse.\r\n",
        "time": 1.6807,
        "completed": true,
        "points": 89
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9f2c2a02f3226792892e6",
        "description": "Veniam et consequat officia cillum enim culpa. Aute nisi pariatur ipsum officia non laboris. Lorem in voluptate aliqua do cillum. Ea cupidatat duis nostrud labore.\r\n",
        "time": 28.5231,
        "completed": true,
        "points": 11
      },
      {
        "name": "Albert Park",
        "id": "64a9f2c248b5899da31a6dd6",
        "description": "Deserunt pariatur enim officia enim ipsum. Mollit duis ut ullamco irure do occaecat laborum laboris id dolore velit consequat est. Tempor dolore sit ullamco ullamco cupidatat eu mollit.\r\n",
        "time": 181.7775,
        "completed": true,
        "points": 27
      }
    ]
  },
  {
    "id": "64a9f2c2b6315c5103652e23",
    "name": "Gwendolyn Bauer",
    "steps": 54556,
    "location": {
      "latitude": -36.89807,
      "longitude": -185.26159
    },
    "quests": [
      {
        "name": "Eden Park",
        "id": "64a9f2c24e95a9a05834ad09",
        "description": "Nulla veniam elit ad tempor mollit Lorem non adipisicing duis consequat. Fugiat Lorem eiusmod Lorem esse excepteur officia ex aliqua aute adipisicing ex mollit eiusmod. Esse fugiat veniam nisi labore. Nostrud aliqua aliqua ex fugiat reprehenderit commodo dolor qui commodo sint ipsum aliqua fugiat. Est laborum pariatur reprehenderit ad nostrud ea fugiat officia proident dolor laboris. Dolor nulla anim incididunt proident proident cillum non velit qui nisi consequat anim nulla.\r\n",
        "time": 82.8864,
        "completed": true,
        "points": 73
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c25f74dd0b4bf540db",
        "description": "Proident fugiat aliquip minim excepteur sint incididunt occaecat. Est veniam id magna aute ad cillum culpa sit consectetur ullamco fugiat qui quis. Enim et laboris in deserunt esse elit labore laboris.\r\n",
        "time": 82.3335,
        "completed": true,
        "points": 64
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c21ca89def22e5e3cb",
        "description": "Consequat commodo laborum eiusmod excepteur ipsum. Duis culpa ullamco aute dolor do magna ad sit eiusmod do. Culpa cillum labore labore cillum et enim laboris cillum enim elit laboris. Cupidatat quis aute adipisicing in culpa. Culpa laboris eiusmod aliqua ut nulla commodo. Laborum anim adipisicing commodo amet amet aliqua. Lorem aliquip veniam velit est non quis magna elit cupidatat excepteur.\r\n",
        "time": 134.078,
        "completed": true,
        "points": 84
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c22c3513e608c9aea8",
        "description": "Ipsum nostrud proident aliqua incididunt. Eu sit ad labore occaecat enim voluptate sit est cupidatat veniam excepteur. Magna do adipisicing deserunt ipsum duis veniam nisi consectetur. Consectetur amet aliquip aliquip dolore velit occaecat enim officia est. Lorem proident deserunt sunt laborum incididunt duis in exercitation commodo nisi et. Eu sunt exercitation minim esse occaecat anim deserunt Lorem ex. Qui dolor aliquip sunt proident adipisicing excepteur duis dolor adipisicing laboris irure aute.\r\n",
        "time": 114.0947,
        "completed": true,
        "points": 70
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c236bbb6ca23e71a01",
        "description": "Aute in irure proident et ullamco. Eu minim id eu consequat ad minim. Consequat velit deserunt tempor dolore. Sint Lorem non commodo adipisicing elit duis nulla magna dolore proident anim. Ullamco in nulla ad ex ut velit mollit do ea commodo id ex in Lorem. Quis eiusmod eiusmod fugiat laborum id mollit id culpa laborum ex eu laborum minim dolor.\r\n",
        "time": 86.9639,
        "completed": true,
        "points": 13
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c2510127c8ed784efe",
        "description": "Tempor reprehenderit sunt elit non do velit in quis non excepteur. Sint consectetur pariatur do est enim. Ullamco quis ut ad amet anim magna eiusmod eu. In enim voluptate id adipisicing ut et. Laborum esse aute nulla aliqua nisi enim amet amet incididunt.\r\n",
        "time": 23.6348,
        "completed": true,
        "points": 99
      },
      {
        "name": "Sky Tower",
        "id": "64a9f2c2c53827398c6899fd",
        "description": "Minim ad reprehenderit commodo quis aliquip ipsum. Cupidatat adipisicing voluptate sint proident cupidatat. Ea fugiat proident exercitation fugiat elit laborum nulla cupidatat elit non eu excepteur minim aliqua. Nostrud exercitation ea laborum nostrud irure sint adipisicing.\r\n",
        "time": 46.3846,
        "completed": true,
        "points": 37
      },
      {
        "name": "Takapuna",
        "id": "64a9f2c2ec107de0e7605b6d",
        "description": "Enim laborum Lorem eiusmod magna ipsum excepteur consectetur eiusmod proident laboris ex cupidatat nostrud dolore. Laborum eu sint commodo do. Dolor id velit ad nostrud ipsum aute aliquip duis ea nisi ut anim in voluptate.\r\n",
        "time": 49.1319,
        "completed": true,
        "points": 98
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c26c52261ea271ba73",
        "description": "Quis qui labore anim dolor. Exercitation velit qui officia consectetur mollit laboris ipsum sunt. Cillum sint nisi culpa consectetur tempor non dolor aliqua labore esse esse aliquip non. Ullamco deserunt in exercitation commodo dolore adipisicing consequat eu.\r\n",
        "time": 142.2052,
        "completed": true,
        "points": 58
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2a2dc30dc1347a256",
        "description": "Ut consequat non sint non aute. Cupidatat elit occaecat cupidatat dolore ea eu Lorem est ad dolore eiusmod cupidatat ad fugiat. Ut minim ex Lorem tempor eiusmod consectetur. Fugiat elit velit exercitation nulla.\r\n",
        "time": 95.6341,
        "completed": true,
        "points": 29
      }
    ]
  },
  {
    "id": "64a9f2c21062ac24c5cd30d8",
    "name": "Pickett Robbins",
    "steps": 93405,
    "location": {
      "latitude": -36.88917,
      "longitude": -185.27884
    },
    "quests": [
      {
        "name": "Matakana",
        "id": "64a9f2c2d395203a04daf017",
        "description": "Id labore aliqua eiusmod ad proident ad velit nisi pariatur aute qui. Amet do exercitation mollit anim. Velit occaecat aliqua sunt amet cupidatat tempor incididunt magna sit dolore. Cillum voluptate aute duis duis. Sint culpa sunt quis cupidatat do incididunt dolore.\r\n",
        "time": 62.9393,
        "completed": true,
        "points": 39
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c25170399e6794c32d",
        "description": "Sunt anim enim elit excepteur quis. Eiusmod dolor cupidatat officia pariatur irure cupidatat commodo. Lorem proident sunt sunt excepteur in nostrud consectetur nostrud laboris ea minim. Officia exercitation cillum veniam laboris exercitation sunt incididunt.\r\n",
        "time": 169.9076,
        "completed": true,
        "points": 45
      },
      {
        "name": "Parnell",
        "id": "64a9f2c26c247510f74f94f3",
        "description": "Exercitation consectetur enim sit sit sint fugiat laboris laboris eu proident reprehenderit dolore. Quis laboris reprehenderit irure incididunt qui cillum cillum ipsum id magna eu fugiat. In non exercitation ullamco eu. Consequat minim fugiat voluptate cupidatat.\r\n",
        "time": 108.5485,
        "completed": true,
        "points": 65
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9f2c2c51cdbda97ff26bc",
        "description": "Deserunt eu veniam labore consequat in amet est non incididunt. Sunt voluptate non deserunt proident proident. Cillum minim eu cillum adipisicing sunt ipsum culpa. Laborum esse nostrud et consectetur anim fugiat sint ut eiusmod incididunt officia esse. Ea quis tempor sit minim mollit adipisicing ea ullamco ullamco. Qui sint officia aliqua nostrud sunt ea tempor commodo ea aliquip. Laboris proident aliqua quis deserunt occaecat reprehenderit.\r\n",
        "time": 121.3802,
        "completed": true,
        "points": 60
      },
      {
        "name": "Eden Park",
        "id": "64a9f2c296ead175f42ba247",
        "description": "Sit duis ullamco amet mollit tempor ullamco cillum sint minim nulla occaecat. Esse non Lorem pariatur aute non aute magna excepteur ea ut. Pariatur fugiat id amet ex labore deserunt incididunt ut sunt ad nulla fugiat. Est excepteur eu ea do enim non aliquip fugiat.\r\n",
        "time": 186.2976,
        "completed": true,
        "points": 52
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9f2c2f6cbdc71ca9dbb29",
        "description": "Ea enim elit aliquip nisi. Eu velit eu dolor nisi dolor nisi ipsum veniam nostrud. Sit excepteur laborum irure nulla voluptate reprehenderit voluptate eiusmod commodo sint do consequat aliqua amet. Aliqua occaecat deserunt elit laborum consectetur velit enim velit sunt nisi anim.\r\n",
        "time": 134.9816,
        "completed": true,
        "points": 50
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c2156b373349721202",
        "description": "Nulla proident nostrud consectetur proident veniam ea sit esse consequat cupidatat ullamco eu in. Aliquip magna qui irure occaecat nostrud do et. Dolor deserunt dolor labore aliquip est veniam officia. Excepteur nulla mollit quis Lorem ullamco.\r\n",
        "time": 92.7136,
        "completed": true,
        "points": 20
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9f2c28bc7b06b50755615",
        "description": "Occaecat elit dolore tempor magna magna Lorem. Id sit anim culpa laboris ut mollit labore enim. Aliqua proident proident nostrud pariatur ad est non aliqua aute.\r\n",
        "time": 96.1706,
        "completed": true,
        "points": 32
      },
      {
        "name": "Auckland Museum",
        "id": "64a9f2c28d7bff2c43e3a920",
        "description": "Aliqua deserunt cillum minim esse tempor sunt elit duis ea consectetur ea. Est do culpa est aliquip aliqua. Laborum occaecat minim labore magna do ipsum. Veniam aute duis qui ea commodo deserunt duis. Aliqua duis do nostrud deserunt eu. Et eu excepteur enim proident tempor qui veniam eu fugiat eiusmod non.\r\n",
        "time": 191.4329,
        "completed": true,
        "points": 82
      }
    ]
  },
  {
    "id": "64a9f2c200207366bc7bfb1e",
    "name": "Fry Galloway",
    "steps": 57802,
    "location": {
      "latitude": -36.89482,
      "longitude": -185.23892
    },
    "quests": [
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9f2c29350d68e2e1b56e1",
        "description": "Aliqua sit eiusmod sunt ea qui esse sint Lorem adipisicing. Quis et velit id eiusmod. Consequat aliqua aliqua sit reprehenderit duis eiusmod culpa ipsum deserunt. Culpa minim voluptate do ex exercitation.\r\n",
        "time": 152.0598,
        "completed": true,
        "points": 15
      },
      {
        "name": "Albert Park",
        "id": "64a9f2c2b9b9fd9666b6210a",
        "description": "Voluptate ut in exercitation anim dolore aliquip. Consectetur commodo nulla do sit id tempor adipisicing tempor officia ipsum sit cillum. Nisi fugiat dolor velit ipsum elit et anim id.\r\n",
        "time": 133.9676,
        "completed": true,
        "points": 54
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c2d7d217478d0ffa2d",
        "description": "Irure reprehenderit officia in ullamco deserunt commodo amet tempor anim duis adipisicing occaecat. Fugiat esse id Lorem proident excepteur et ex commodo laborum exercitation minim. In sit occaecat proident pariatur veniam excepteur non in pariatur exercitation. Enim occaecat aute occaecat ea occaecat magna aliquip. Enim nostrud ex duis deserunt sint ea.\r\n",
        "time": 122.0414,
        "completed": true,
        "points": 88
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c2182420cff983596c",
        "description": "Esse ea do commodo ad eu reprehenderit. Ut ex minim id velit cillum. In nostrud aliquip enim exercitation laboris qui occaecat aliquip cupidatat nulla laborum nulla minim dolor. Minim officia cillum proident in eiusmod. Reprehenderit commodo ex exercitation occaecat fugiat sunt quis aliquip occaecat ad velit nostrud.\r\n",
        "time": 95.903,
        "completed": true,
        "points": 24
      },
      {
        "name": "Karekare",
        "id": "64a9f2c29a217b29dc7048a9",
        "description": "Exercitation sunt Lorem est amet. Proident qui ea et nulla veniam nostrud officia consectetur culpa ut labore. Sint quis id est eiusmod ut nulla aliqua anim magna labore culpa cillum aliqua occaecat.\r\n",
        "time": 147.7682,
        "completed": true,
        "points": 22
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9f2c20bb429e46ecaf406",
        "description": "Id pariatur occaecat nisi proident occaecat est aute ex pariatur ea eu occaecat. Lorem consequat officia proident in enim ex tempor. Non cupidatat mollit incididunt nisi quis eu labore in reprehenderit irure.\r\n",
        "time": 169.4185,
        "completed": true,
        "points": 56
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9f2c28d47e87d85769c5c",
        "description": "Excepteur consectetur sit deserunt cillum non occaecat eu enim non quis pariatur. Enim tempor sit labore velit magna enim sint. Culpa enim dolore est occaecat. Eu pariatur laborum sit occaecat voluptate aliquip eiusmod laboris elit occaecat eu ut ad reprehenderit. Ut labore excepteur sunt ea ex laboris laboris officia amet consectetur aute occaecat cupidatat. Anim eu Lorem proident anim et Lorem et eiusmod ex minim incididunt laboris tempor.\r\n",
        "time": 174.6608,
        "completed": true,
        "points": 11
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c2b375db6479407962",
        "description": "Dolor ipsum mollit in nisi commodo. Minim aliqua cillum anim fugiat dolore consequat enim fugiat fugiat voluptate et ex consectetur sit. Cillum consequat cillum fugiat pariatur veniam officia tempor fugiat irure pariatur aliquip. Enim ad labore in aute minim do Lorem aute sint ea. Labore cupidatat labore nisi id deserunt est adipisicing consectetur. Anim consequat aliqua amet cupidatat fugiat laborum tempor ut enim ipsum incididunt consequat dolore officia.\r\n",
        "time": 1.0358,
        "completed": true,
        "points": 24
      },
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9f2c2641036b5ae81b346",
        "description": "Nisi sit adipisicing veniam exercitation aute esse sit sit. Ut est enim id sint mollit labore exercitation cupidatat proident officia velit exercitation laborum aute. Amet ea minim dolor duis.\r\n",
        "time": 154.1458,
        "completed": true,
        "points": 16
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9f2c2132a6b0b17cea55d",
        "description": "Labore incididunt ea elit tempor laborum deserunt. Incididunt ad enim pariatur ipsum occaecat sunt id eu labore amet fugiat est velit. Minim quis consequat nulla cillum ipsum tempor occaecat nisi. Aliquip fugiat sit deserunt laboris officia ut excepteur excepteur duis.\r\n",
        "time": 41.2295,
        "completed": true,
        "points": 84
      }
    ]
  },
  {
    "id": "64a9f2c2c89883685bda63c3",
    "name": "Mckee Collins",
    "steps": 69715,
    "location": {
      "latitude": -36.88857,
      "longitude": -185.22416
    },
    "quests": [
      {
        "name": "Ponsonby",
        "id": "64a9f2c285002f6edbd05470",
        "description": "Labore qui veniam minim nostrud aute tempor aliqua in elit. Dolore tempor amet officia et et occaecat sunt aliqua cupidatat nisi. Minim adipisicing sunt culpa incididunt eu ut non elit ullamco. Consectetur elit consectetur exercitation esse esse mollit reprehenderit in minim veniam ullamco occaecat. Fugiat labore qui commodo exercitation.\r\n",
        "time": 77.8316,
        "completed": true,
        "points": 73
      },
      {
        "name": "Queen Street",
        "id": "64a9f2c29db46477a03ae233",
        "description": "Tempor consequat mollit quis id eiusmod culpa non eiusmod consequat dolor ad laboris qui ipsum. Eiusmod fugiat adipisicing occaecat dolore reprehenderit est veniam ex sit occaecat sit cillum. Qui qui veniam elit aliqua ullamco nisi tempor. Quis Lorem reprehenderit do id nulla minim est laboris aute consectetur reprehenderit ad. Sint duis fugiat voluptate ut est id eu cillum minim ea aliquip non laboris. Fugiat eu non excepteur officia proident id ex.\r\n",
        "time": 145.687,
        "completed": true,
        "points": 77
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2218925848147a818",
        "description": "Qui veniam laborum id sint ipsum qui labore incididunt. Laborum et proident enim voluptate eu anim et laboris cupidatat. Deserunt occaecat non do enim in enim exercitation dolor irure occaecat aliqua id nisi amet. Laborum exercitation elit id pariatur ad mollit. Sint eu excepteur sunt duis ex pariatur magna deserunt excepteur. Officia exercitation exercitation dolor nulla labore culpa commodo mollit irure velit nulla adipisicing sint nulla.\r\n",
        "time": 156.3801,
        "completed": true,
        "points": 18
      },
      {
        "name": "Parnell",
        "id": "64a9f2c29012e130d5833153",
        "description": "Laboris aute sit dolore tempor. Labore enim adipisicing id occaecat elit laboris deserunt mollit culpa labore. Commodo ipsum Lorem dolor aliqua est nulla ex pariatur ad est id deserunt ut officia. Aliqua amet labore mollit et amet. Officia esse consectetur in id aliqua amet et fugiat labore irure nostrud.\r\n",
        "time": 70.557,
        "completed": true,
        "points": 99
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9f2c2820da1b115e49828",
        "description": "Nulla velit do consequat excepteur do cillum. In exercitation dolore ut nisi mollit consequat ullamco ut. Do officia laborum est id minim non laboris cillum non velit nulla fugiat quis enim. Laborum incididunt irure duis nostrud tempor in ipsum proident. Adipisicing aliqua amet reprehenderit id aute in anim proident irure reprehenderit Lorem qui reprehenderit. Laboris duis id minim incididunt labore aliquip adipisicing.\r\n",
        "time": 180.549,
        "completed": true,
        "points": 25
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c26a262447b1fcf809",
        "description": "Nostrud cillum dolore aute officia elit consectetur proident ex aliqua duis nulla voluptate ad enim. Do voluptate non id esse ad. Reprehenderit ad laboris reprehenderit exercitation in qui ipsum adipisicing est. Est quis eiusmod culpa nostrud veniam duis. Sint consequat eu aliquip nisi ad deserunt aliqua aliqua fugiat in dolor qui.\r\n",
        "time": 31.3278,
        "completed": true,
        "points": 76
      },
      {
        "name": "Bethells Beach",
        "id": "64a9f2c2c1e0cfb66ad05f7d",
        "description": "Non non ipsum in laborum exercitation cupidatat duis sunt irure. Excepteur adipisicing quis ea laboris id aliquip veniam id duis ut est sit. Incididunt mollit magna in dolor eiusmod sint. Culpa ad amet Lorem cillum. Officia consequat et elit qui minim ipsum minim irure.\r\n",
        "time": 198.2317,
        "completed": true,
        "points": 46
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9f2c23ebf93b4b046036f",
        "description": "Qui commodo eiusmod ipsum dolore qui enim pariatur id consectetur officia labore nisi qui. Voluptate enim occaecat id cupidatat irure. Velit qui ea reprehenderit veniam est. Labore id labore qui ullamco irure duis dolor non minim. Labore quis do in veniam consectetur non et.\r\n",
        "time": 73.0694,
        "completed": true,
        "points": 73
      }
    ]
  },
  {
    "id": "64a9f2c2ce1d39de47294e30",
    "name": "Gaines Keith",
    "steps": 15784,
    "location": {
      "latitude": -36.88973,
      "longitude": -185.26993
    },
    "quests": [
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c2020b45f11397701d",
        "description": "Nisi voluptate proident adipisicing pariatur. Lorem officia ipsum nostrud incididunt elit anim. Culpa sint et in ad. Incididunt laboris aliqua nulla tempor consequat aliquip et anim nulla cupidatat.\r\n",
        "time": 70.3669,
        "completed": true,
        "points": 96
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2b01bdc995999801f",
        "description": "Commodo reprehenderit aliqua esse ullamco anim. Aliquip non aliquip aliquip velit anim consequat. Occaecat qui exercitation reprehenderit id ea duis quis. Enim veniam dolore duis culpa ut Lorem consectetur duis Lorem anim ullamco non. Consequat excepteur eiusmod excepteur id enim adipisicing aliqua minim sunt enim sunt. Ea ullamco officia duis nulla cillum adipisicing laborum deserunt. Dolore laboris excepteur sint deserunt voluptate laboris.\r\n",
        "time": 4.386,
        "completed": true,
        "points": 50
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c25c9723cd810835af",
        "description": "Dolor sit quis ipsum proident in tempor. Culpa cupidatat excepteur irure ea magna occaecat adipisicing commodo laborum cupidatat consectetur. Sit fugiat ea sit enim sint ullamco in. Culpa eu deserunt sint esse anim proident anim dolor id aute sunt. Proident nostrud non voluptate cillum consequat amet. Esse nostrud ea dolore ad culpa id exercitation quis. Velit non dolore quis laborum ullamco proident aliqua sunt elit incididunt pariatur et nisi sunt.\r\n",
        "time": 101.9604,
        "completed": true,
        "points": 85
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c25a07215f08efe5c8",
        "description": "Do reprehenderit eu aliqua ullamco officia proident cillum minim fugiat voluptate occaecat quis id. Ea deserunt consectetur enim ullamco proident veniam officia excepteur velit sunt excepteur occaecat nisi. Non officia id et enim reprehenderit velit in.\r\n",
        "time": 100.5588,
        "completed": true,
        "points": 15
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c28214142a78d1d8da",
        "description": "Minim aliquip in non elit nostrud reprehenderit est reprehenderit anim nostrud nostrud. Pariatur tempor excepteur exercitation reprehenderit. Ipsum consequat dolor consequat aliquip laboris consectetur est et. Qui culpa ea labore eu occaecat culpa nulla nostrud consectetur. Anim Lorem ipsum excepteur dolor minim duis elit. Deserunt minim qui quis est ex.\r\n",
        "time": 106.5884,
        "completed": true,
        "points": 40
      },
      {
        "name": "Silo Park",
        "id": "64a9f2c2de9702f01ea4e6e9",
        "description": "Irure est veniam exercitation eiusmod sunt. Esse ea duis ad ea. Aute id non ad esse. Aliquip ipsum aliqua laboris ex veniam amet nisi enim eiusmod ipsum Lorem aliquip.\r\n",
        "time": 110.1596,
        "completed": true,
        "points": 88
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c2d60e17fa0be31372",
        "description": "Consectetur deserunt incididunt ea excepteur in ad irure consequat non duis magna. Mollit ipsum laboris fugiat deserunt commodo irure fugiat commodo cillum deserunt nostrud ipsum. Et qui labore aute Lorem qui. Est non ad qui elit id tempor. Mollit fugiat reprehenderit cillum mollit enim aliquip fugiat sunt. Mollit eu sunt occaecat reprehenderit.\r\n",
        "time": 76.6693,
        "completed": true,
        "points": 50
      },
      {
        "name": "Queen Street",
        "id": "64a9f2c26831ee4b5c3f2a37",
        "description": "Sint nisi do incididunt velit proident. Ipsum sit in id tempor fugiat aute sunt aliquip sit id anim. Veniam exercitation magna fugiat sint adipisicing est. Consectetur consectetur consequat ad esse qui aliqua qui ullamco officia. Duis magna dolor nisi in id occaecat veniam duis mollit Lorem pariatur. Minim deserunt excepteur eiusmod pariatur amet veniam quis duis sit do. Nulla reprehenderit sint pariatur eu Lorem nostrud ipsum cillum.\r\n",
        "time": 164.9259,
        "completed": true,
        "points": 50
      },
      {
        "name": "Orewa Beach",
        "id": "64a9f2c26322df349c76797b",
        "description": "Irure proident culpa veniam voluptate fugiat adipisicing qui adipisicing duis ea anim. Laborum in elit anim veniam dolore ea dolore ipsum. Cupidatat veniam dolor esse laborum occaecat qui eu consectetur cillum proident id. Est consectetur ad fugiat excepteur Lorem proident consequat. Tempor sit ipsum ex magna amet laboris voluptate labore ullamco ea mollit. Et in fugiat in proident cillum laborum ad sunt quis laborum.\r\n",
        "time": 136.7095,
        "completed": true,
        "points": 95
      },
      {
        "name": "Oneroa",
        "id": "64a9f2c29d831cd8f847569e",
        "description": "Ipsum laboris consequat magna do Lorem non voluptate. Reprehenderit pariatur eiusmod aliqua consectetur aute do cillum pariatur. Laboris ad incididunt eu irure aute.\r\n",
        "time": 45.0102,
        "completed": true,
        "points": 45
      }
    ]
  },
  {
    "id": "64a9f2c28c12f8468374dc45",
    "name": "Valentine Walls",
    "steps": 59377,
    "location": {
      "latitude": -36.87102,
      "longitude": -185.25288
    },
    "quests": [
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c2c7fd9b97335f8fd1",
        "description": "Ea veniam amet ea dolore ullamco sit sunt sit eu ipsum cupidatat aute excepteur amet. Eiusmod sunt dolore incididunt aliqua nisi qui exercitation esse officia veniam. Dolor duis consectetur veniam nostrud proident incididunt eiusmod. Occaecat incididunt ad culpa velit est do fugiat aliquip eiusmod mollit velit et. Exercitation excepteur ut labore consectetur duis ea. Excepteur officia occaecat enim eu excepteur commodo officia sunt id proident eiusmod adipisicing do.\r\n",
        "time": 142.5877,
        "completed": true,
        "points": 22
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9f2c259e4ddc56fc35185",
        "description": "Deserunt commodo cupidatat velit reprehenderit amet aute sunt. Cillum pariatur irure cillum officia. Occaecat deserunt eiusmod tempor incididunt mollit ea ea esse non mollit culpa ex dolore. Amet in occaecat et nisi in minim commodo consectetur. Reprehenderit aliqua commodo duis anim exercitation magna tempor labore cillum. Mollit exercitation amet fugiat commodo tempor est. Nisi laboris nisi cupidatat ullamco cillum sit.\r\n",
        "time": 16.9719,
        "completed": true,
        "points": 19
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c209ac623df616b33e",
        "description": "Pariatur veniam adipisicing occaecat consequat sunt. Esse do laboris aute in non. Cupidatat commodo sint quis deserunt aliqua consectetur ut non pariatur id irure qui magna. Dolor labore nulla velit anim cupidatat aliquip velit mollit duis. Sit ipsum occaecat sunt incididunt magna est aute deserunt.\r\n",
        "time": 154.7995,
        "completed": true,
        "points": 78
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c2e2ba0b809416cd4b",
        "description": "Laborum consectetur proident consequat cupidatat exercitation in aliqua commodo ipsum ea. In reprehenderit ea ad mollit anim. Ut magna nostrud et ullamco. Qui laboris magna nulla deserunt consequat magna reprehenderit consequat aute adipisicing nisi cillum adipisicing cupidatat.\r\n",
        "time": 176.5015,
        "completed": true,
        "points": 66
      },
      {
        "name": "Waiheke Island",
        "id": "64a9f2c29b237de838b0026b",
        "description": "Laboris mollit consectetur sint sint elit esse occaecat reprehenderit fugiat quis qui ut voluptate. Et officia magna nulla culpa cillum minim. Excepteur ex ad ex est irure cupidatat sunt qui do eu fugiat. Minim eu incididunt ullamco proident eiusmod laborum occaecat culpa eiusmod consequat consequat fugiat mollit.\r\n",
        "time": 176.8977,
        "completed": true,
        "points": 80
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c2d638c9d7abce0206",
        "description": "Qui consequat sint enim sint quis non sunt. Proident officia pariatur adipisicing occaecat elit labore minim enim ea voluptate Lorem. Minim pariatur sint nulla aliquip sunt eu ad Lorem dolore velit labore velit enim. Consequat duis ea nisi laboris sunt magna. Ut do pariatur aliquip sunt proident. Do excepteur ipsum adipisicing irure sit fugiat ea velit occaecat ut. Irure minim occaecat labore proident.\r\n",
        "time": 123.8482,
        "completed": true,
        "points": 73
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9f2c24d554c124da11c74",
        "description": "Nisi occaecat esse cupidatat labore nulla minim nostrud exercitation anim. Fugiat cillum anim culpa minim mollit. Amet pariatur minim aliqua cillum. Mollit nisi aliquip ut adipisicing amet.\r\n",
        "time": 67.0097,
        "completed": true,
        "points": 69
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c28b2886ed21d731fb",
        "description": "In aute ullamco ut occaecat qui amet est et cillum nulla minim duis pariatur. Deserunt voluptate esse dolor cupidatat. Ea culpa nostrud nulla laborum dolor consequat proident. Aliqua ullamco esse labore cillum reprehenderit ex ex culpa Lorem excepteur labore incididunt. Laborum proident Lorem dolore cupidatat amet ad in ex pariatur tempor eu. Incididunt elit veniam aute sit.\r\n",
        "time": 164.7195,
        "completed": true,
        "points": 17
      }
    ]
  },
  {
    "id": "64a9f2c21987f52a72aa45d2",
    "name": "Vaughan Craft",
    "steps": 52371,
    "location": {
      "latitude": -36.89122,
      "longitude": -185.27221
    },
    "quests": [
      {
        "name": "Gulf Harbour",
        "id": "64a9f2c2910297fe5635a544",
        "description": "Non nisi culpa fugiat id mollit consequat Lorem. Amet quis tempor velit commodo duis ipsum labore. Sunt officia et eiusmod incididunt aliqua est cupidatat dolore cupidatat aute. Anim excepteur enim aliqua laborum.\r\n",
        "time": 111.5395,
        "completed": true,
        "points": 93
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9f2c2b9628b17edab0ddf",
        "description": "Qui ea aute cillum exercitation minim enim ut. Consectetur cupidatat dolore ipsum sit id mollit id deserunt exercitation veniam et voluptate ea proident. Est deserunt est sint nisi velit occaecat dolore in amet pariatur velit laboris est. Excepteur ea esse excepteur occaecat ut laborum duis cillum voluptate deserunt. Mollit adipisicing velit cillum ea. Velit non esse nostrud eiusmod reprehenderit mollit aliquip sint aliquip aliquip consectetur anim. Ea laborum dolore reprehenderit adipisicing nisi tempor est id.\r\n",
        "time": 148.4362,
        "completed": true,
        "points": 77
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9f2c2352e0cbc2057bc5d",
        "description": "Nostrud do cupidatat sunt eu adipisicing ullamco eu. Duis esse aliquip duis duis tempor dolor labore aliqua est nisi amet incididunt irure. Cillum eiusmod qui sint ut cupidatat. Elit magna anim aliquip voluptate consectetur nisi aliqua laboris culpa ad. Ut ex minim exercitation sint ullamco. Do culpa officia sunt Lorem veniam in.\r\n",
        "time": 162.0609,
        "completed": true,
        "points": 23
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c2ce184dcdb448a84d",
        "description": "Et minim pariatur cillum eiusmod dolore velit. Sint ex fugiat enim mollit exercitation adipisicing eiusmod tempor consequat. Ullamco ad laboris Lorem ex duis eiusmod nisi occaecat. Nostrud irure mollit ipsum sint excepteur nisi aute consectetur Lorem tempor in irure ea. Anim aliqua esse adipisicing ad sunt laboris enim culpa nisi in ea pariatur non veniam. Commodo occaecat fugiat occaecat eiusmod duis sint esse Lorem.\r\n",
        "time": 76.4743,
        "completed": true,
        "points": 71
      },
      {
        "name": "Takapuna",
        "id": "64a9f2c225cffac4943da5cd",
        "description": "Minim eu in exercitation excepteur non sint culpa do est in minim. Esse nostrud commodo aliquip adipisicing labore veniam non adipisicing velit. Do adipisicing laboris esse esse reprehenderit cillum non do deserunt esse quis enim ad ut. Voluptate dolor esse laborum magna ut.\r\n",
        "time": 114.6696,
        "completed": true,
        "points": 68
      },
      {
        "name": "Eden Park",
        "id": "64a9f2c2bedde75ec8bbe93a",
        "description": "Culpa qui aliquip culpa ea nisi nisi ullamco pariatur occaecat nostrud. Est commodo elit ea tempor. Elit sunt qui officia occaecat reprehenderit veniam culpa aute occaecat esse non. Reprehenderit aliquip amet magna do eu. Id laborum excepteur veniam consequat consequat proident consequat consectetur ullamco tempor duis excepteur pariatur.\r\n",
        "time": 196.1522,
        "completed": true,
        "points": 81
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c2fec7ff4cfe64ca5f",
        "description": "Nostrud incididunt adipisicing non eu Lorem voluptate dolor veniam. Magna quis quis elit id amet ea esse elit qui. Ea exercitation ad veniam tempor fugiat quis do. Ullamco labore cillum duis occaecat elit elit velit commodo aute sint proident laborum sit Lorem. Eiusmod sint proident magna veniam officia ut mollit.\r\n",
        "time": 46.5247,
        "completed": true,
        "points": 90
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9f2c2227420bcb3c62587",
        "description": "Fugiat anim occaecat deserunt ea labore. Enim sunt aute do do ipsum minim duis mollit dolore proident eu proident nostrud. Ut Lorem et reprehenderit Lorem exercitation id labore incididunt labore excepteur irure et laborum et. Magna adipisicing in pariatur aliquip. Anim dolor dolor aliqua exercitation nulla sunt consectetur in ea pariatur minim. Incididunt pariatur ex enim est culpa nulla magna amet irure cupidatat cillum quis. Nisi Lorem aliqua voluptate id labore voluptate ipsum elit do aliquip exercitation sint veniam veniam.\r\n",
        "time": 151.1541,
        "completed": true,
        "points": 51
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9f2c294aa6433c169877d",
        "description": "Laboris commodo occaecat ex in quis eiusmod incididunt. Non deserunt labore qui in elit in. Cupidatat eiusmod ipsum esse consequat aliquip Lorem aliquip velit. Exercitation id tempor veniam excepteur ad culpa nulla. Qui consequat velit ex incididunt enim qui id incididunt consectetur excepteur dolore qui. Amet aliqua laborum est reprehenderit Lorem cupidatat veniam sint dolore ex.\r\n",
        "time": 38.3349,
        "completed": true,
        "points": 11
      }
    ]
  },
  {
    "id": "64a9f2c21d79dfdf71b4b666",
    "name": "Terry Brady",
    "steps": 30831,
    "location": {
      "latitude": -36.89937,
      "longitude": -185.22656
    },
    "quests": [
      {
        "name": "One Tree Hill",
        "id": "64a9f2c253b91e288c24cb4c",
        "description": "Id labore aliquip duis cillum. Magna anim proident deserunt aute Lorem fugiat aute ea mollit velit. Laborum irure incididunt ullamco aliqua esse. Adipisicing non sint adipisicing cupidatat. Labore labore incididunt minim cupidatat cupidatat proident veniam et.\r\n",
        "time": 63.1195,
        "completed": true,
        "points": 76
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2bd0227308e3eb809",
        "description": "Commodo culpa pariatur dolor et ipsum excepteur pariatur est non pariatur consectetur non laboris. Labore est nisi dolore minim proident ipsum cupidatat in irure laborum elit et velit. Labore amet in ipsum sit aliquip sunt cupidatat et. Nulla ut commodo laboris sit. Enim officia quis enim qui ullamco ut nostrud aliquip deserunt in tempor excepteur.\r\n",
        "time": 2.0957,
        "completed": true,
        "points": 82
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c2e99eb152a183eb57",
        "description": "Sit est minim ut excepteur enim duis pariatur non nulla. Sint magna elit ad labore aute exercitation excepteur dolore est. Excepteur incididunt amet dolor in esse voluptate ad adipisicing sunt veniam.\r\n",
        "time": 10.3539,
        "completed": true,
        "points": 52
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c22a61281062e796bd",
        "description": "Irure sint proident commodo nostrud non. Dolor laboris ex fugiat ad ad fugiat tempor Lorem. Labore ullamco eu incididunt dolor tempor ea incididunt magna aute ea. Fugiat esse nulla non laboris laboris non cupidatat ea eiusmod. Dolore ipsum non et sit esse nisi voluptate cillum eiusmod.\r\n",
        "time": 95.7883,
        "completed": true,
        "points": 72
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c255ae941219b3bb11",
        "description": "Consectetur cupidatat laboris eu magna laboris non est velit. Lorem fugiat enim amet occaecat deserunt consequat sint quis occaecat eiusmod. Minim occaecat incididunt consectetur ad esse ea non non et anim tempor reprehenderit labore do. Nostrud et reprehenderit eu laboris.\r\n",
        "time": 136.7615,
        "completed": true,
        "points": 75
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9f2c24d6b09cc09ca8a67",
        "description": "Quis dolore sint do pariatur duis. Veniam Lorem sint laborum aliqua dolor est ullamco pariatur ex laboris. Consectetur ex irure aliqua Lorem.\r\n",
        "time": 6.2296,
        "completed": true,
        "points": 85
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c2b205a35bac22d042",
        "description": "Cupidatat anim ipsum deserunt quis elit irure incididunt. Laborum enim do magna velit reprehenderit aute excepteur enim irure minim exercitation do. Dolore ea et irure sit mollit fugiat velit aliqua velit nisi tempor aliqua sit velit. Incididunt cillum ullamco occaecat eiusmod cupidatat elit eu cupidatat cillum aliqua nostrud quis. Occaecat consequat ullamco eiusmod ipsum veniam sit nulla. Aliqua qui ad occaecat duis consectetur excepteur elit cillum mollit eu quis proident. Enim amet ut tempor incididunt.\r\n",
        "time": 199.1977,
        "completed": true,
        "points": 42
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9f2c2f7a1287936f0995d",
        "description": "Pariatur deserunt commodo dolor laborum consectetur nostrud anim duis enim nostrud incididunt. Ex est quis pariatur dolor dolor enim qui et deserunt quis labore. Nostrud qui cillum cillum non reprehenderit sunt amet consectetur sit voluptate minim qui culpa. Anim magna est ex magna nostrud do veniam consectetur adipisicing fugiat consequat. Elit adipisicing magna occaecat eu eiusmod qui enim mollit esse reprehenderit ipsum do.\r\n",
        "time": 161.4611,
        "completed": true,
        "points": 100
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9f2c25858212ef832dc46",
        "description": "Velit do mollit incididunt ipsum occaecat ex enim ut duis cupidatat eu cupidatat. Laborum nostrud eiusmod incididunt commodo tempor proident ex ex. Est commodo dolor nisi consequat do nostrud. Irure proident do qui exercitation non ad.\r\n",
        "time": 110.8102,
        "completed": true,
        "points": 40
      }
    ]
  },
  {
    "id": "64a9f2c2cb8db0fe34b24d58",
    "name": "Murphy Vinson",
    "steps": 18452,
    "location": {
      "latitude": -36.88011,
      "longitude": -185.2337
    },
    "quests": [
      {
        "name": "Stardome Observatory",
        "id": "64a9f2c26631539f05022d65",
        "description": "Et sit amet ullamco amet magna ullamco officia proident aliquip. Laborum cillum occaecat proident culpa culpa sint laborum enim occaecat. Commodo adipisicing cupidatat adipisicing labore velit quis nisi aliqua commodo sint. Occaecat fugiat anim excepteur enim esse non mollit est officia id aliqua. Laborum irure commodo quis voluptate nisi reprehenderit adipisicing veniam.\r\n",
        "time": 3.3166,
        "completed": true,
        "points": 94
      },
      {
        "name": "Mount Eden",
        "id": "64a9f2c2faa2dbd198d153e3",
        "description": "Duis proident sit proident sit nulla occaecat qui ea ullamco occaecat Lorem Lorem. Elit et ipsum anim do esse commodo dolor est deserunt sunt veniam. Commodo incididunt officia aute in est non dolore enim irure nisi laboris consectetur duis. Ad irure quis sit anim magna ullamco sint sint et aliquip. Dolore adipisicing laboris dolor irure sint amet minim esse veniam minim cupidatat adipisicing. Exercitation pariatur minim sunt sint irure excepteur Lorem dolor laborum eiusmod consequat proident minim fugiat. Nisi aute ea cupidatat velit.\r\n",
        "time": 109.4066,
        "completed": true,
        "points": 42
      },
      {
        "name": "Parnell",
        "id": "64a9f2c20aadfe8d21a0f4fc",
        "description": "Aute laboris et ea fugiat id ea labore eiusmod officia fugiat ea sunt occaecat amet. Aliqua ipsum fugiat mollit commodo mollit labore est cillum. Est quis quis ex est cupidatat in laborum ex in ex dolor minim magna est.\r\n",
        "time": 195.1738,
        "completed": true,
        "points": 17
      },
      {
        "name": "Parnell",
        "id": "64a9f2c26a3b41ae36f7f8e2",
        "description": "Non dolore cupidatat occaecat id. Mollit cillum pariatur cupidatat sit eiusmod anim. Fugiat occaecat sit sint id duis nulla ea. Velit reprehenderit mollit sit magna est aliquip est. Quis et nisi incididunt dolor incididunt in cillum ut sit aute. Et sint proident dolor aliquip in nulla cillum exercitation. Commodo fugiat ipsum consequat commodo amet elit enim culpa elit est.\r\n",
        "time": 96.2134,
        "completed": true,
        "points": 13
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9f2c2125659deb13812d0",
        "description": "Culpa tempor aliquip quis cupidatat fugiat dolor sunt. Ad reprehenderit velit reprehenderit duis. Deserunt Lorem officia excepteur occaecat aute aliquip Lorem dolore. Laborum mollit id est fugiat esse magna dolor eiusmod elit mollit quis. Exercitation laborum consectetur anim non pariatur duis nisi exercitation officia sunt sit dolor proident. Non velit ad cillum laborum velit ut sunt.\r\n",
        "time": 32.0123,
        "completed": true,
        "points": 80
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2985dfc566cce9b26",
        "description": "Et eu ullamco dolor id. Cupidatat sit adipisicing eiusmod magna proident officia culpa ipsum. Velit occaecat cupidatat ad ut veniam esse velit pariatur dolor.\r\n",
        "time": 78.5778,
        "completed": true,
        "points": 49
      },
      {
        "name": "Orewa Beach",
        "id": "64a9f2c29eee561db6ec73f4",
        "description": "Mollit sit aute deserunt in cillum laborum reprehenderit. Cillum aliquip excepteur aute labore do dolor proident adipisicing laborum nostrud. Ullamco incididunt Lorem laboris non ad laborum consequat aute. Mollit anim magna culpa nulla ut proident excepteur id sunt. Deserunt laboris magna anim eu ullamco in commodo et magna laboris nulla. Pariatur est qui et officia ea sint voluptate.\r\n",
        "time": 140.9734,
        "completed": true,
        "points": 29
      },
      {
        "name": "Auckland Art Fair",
        "id": "64a9f2c273c4c4e221f4d6ab",
        "description": "Nostrud est consequat cupidatat reprehenderit commodo nisi duis esse sunt proident aliqua enim. Nostrud aliqua tempor commodo minim exercitation irure tempor quis laboris. Adipisicing officia pariatur labore esse eiusmod laborum magna laborum duis ea. Excepteur non elit magna irure ad proident adipisicing. Consectetur quis culpa velit minim adipisicing fugiat incididunt proident officia proident ut ut.\r\n",
        "time": 37.5944,
        "completed": true,
        "points": 25
      },
      {
        "name": "Takapuna",
        "id": "64a9f2c2c076fce7ddc1b102",
        "description": "Excepteur eu do dolor dolore ipsum. Eiusmod adipisicing occaecat laboris aute ullamco magna qui. Sunt aute magna nisi exercitation nostrud ea incididunt deserunt commodo ea consequat ipsum. Cupidatat cillum sunt labore nostrud quis est consectetur minim ut. Deserunt commodo sunt nostrud mollit esse deserunt nulla id laborum. Ullamco amet veniam dolore exercitation dolor aliqua duis.\r\n",
        "time": 133.7644,
        "completed": true,
        "points": 21
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c2e35c7a51e0925ad3",
        "description": "Id veniam reprehenderit commodo ad aliquip dolor ut eiusmod eiusmod nisi non excepteur laboris eiusmod. Qui dolore Lorem nostrud aliquip ea ipsum ad tempor ea proident magna laboris. Cillum minim duis magna officia incididunt ipsum fugiat culpa nisi cupidatat. Ipsum laboris eu sit non culpa anim cupidatat dolor do. Anim et voluptate Lorem officia proident minim ut. Nostrud anim duis officia nulla velit sunt nostrud voluptate laborum. Elit enim commodo non laboris commodo duis.\r\n",
        "time": 58.6034,
        "completed": true,
        "points": 71
      }
    ]
  },
  {
    "id": "64a9f2c2a3b00f25601401ba",
    "name": "Bright Sharp",
    "steps": 8241,
    "location": {
      "latitude": -36.88899,
      "longitude": -185.27634
    },
    "quests": [
      {
        "name": "Cornwall Park",
        "id": "64a9f2c2b1a45ed9f2cec511",
        "description": "Do id eiusmod non ullamco proident cupidatat sit enim minim minim veniam ad eu eiusmod. Nostrud officia tempor adipisicing fugiat cupidatat reprehenderit consequat fugiat. Pariatur tempor id dolor aliquip officia Lorem incididunt. Exercitation mollit culpa magna ea enim non velit sit in. Culpa irure esse deserunt eu proident adipisicing anim elit ut mollit ea sunt. Consectetur occaecat laboris esse laboris nulla duis pariatur laboris. Minim culpa irure ullamco deserunt dolor consectetur laborum incididunt fugiat.\r\n",
        "time": 40.3205,
        "completed": true,
        "points": 76
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c28a9892367d9f3e8b",
        "description": "Cillum in incididunt culpa commodo reprehenderit sint ullamco cillum proident. Pariatur minim ea dolore aute sunt aute culpa duis consectetur. Veniam quis non id enim minim ea do elit proident ea do. Fugiat reprehenderit consectetur cillum culpa culpa cupidatat ex ea sint. Elit eu aliquip exercitation enim anim do commodo cillum nisi in laborum sint consequat adipisicing. Excepteur cillum quis amet nulla voluptate velit dolor adipisicing sit laborum veniam.\r\n",
        "time": 135.5548,
        "completed": true,
        "points": 13
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2ba94c2da80a221aa",
        "description": "Ea Lorem sit laboris nostrud commodo amet anim et occaecat. Adipisicing consequat excepteur ex duis ipsum cupidatat aliqua ex fugiat aute ea deserunt non. Magna sint exercitation mollit do do minim reprehenderit nulla minim aliquip. Reprehenderit sunt velit mollit nisi eiusmod. Qui laborum adipisicing magna sit nostrud non proident mollit exercitation sint dolor.\r\n",
        "time": 113.9496,
        "completed": true,
        "points": 55
      },
      {
        "name": "Auckland Museum",
        "id": "64a9f2c214b88f31517016cc",
        "description": "Cillum officia consequat exercitation ipsum elit non exercitation sit amet ullamco ex aliquip et. Aute ullamco et officia deserunt id adipisicing sunt excepteur ad exercitation non. Culpa voluptate anim ullamco excepteur eiusmod duis magna mollit deserunt ut ad.\r\n",
        "time": 73.1648,
        "completed": true,
        "points": 23
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2aaf30e2ddabd28c3",
        "description": "Incididunt amet aute elit consectetur sunt fugiat. Ipsum qui nostrud anim nostrud. Elit eiusmod consectetur eu irure voluptate ex proident ad incididunt sit Lorem. Ea dolor deserunt amet adipisicing nostrud dolor fugiat. Sint ullamco anim quis aute id nulla tempor aute commodo sunt.\r\n",
        "time": 120.2509,
        "completed": true,
        "points": 98
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c223305ed045daf94b",
        "description": "Reprehenderit officia anim esse elit ipsum incididunt esse magna officia excepteur. Magna consectetur anim exercitation laboris ut ea ad velit irure sit pariatur est. Enim ad duis nostrud aliquip cillum enim ex.\r\n",
        "time": 19.6415,
        "completed": true,
        "points": 70
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9f2c2fa2defede3c39dbb",
        "description": "Voluptate officia proident labore quis eiusmod tempor reprehenderit. Consectetur minim anim ad pariatur quis quis reprehenderit. Adipisicing consequat ad mollit eu.\r\n",
        "time": 124.7731,
        "completed": true,
        "points": 53
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2639cdf0a35a91445",
        "description": "Incididunt est laborum proident veniam quis cupidatat velit consectetur exercitation veniam amet. Nulla est in in incididunt consectetur qui laborum veniam qui. Commodo exercitation ad dolore do labore reprehenderit officia id labore ullamco veniam officia irure incididunt. Do amet ex ipsum duis non aute deserunt non elit. Aute Lorem mollit deserunt do enim laboris esse id non dolor.\r\n",
        "time": 182.6366,
        "completed": true,
        "points": 82
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9f2c276545db6804278bd",
        "description": "Ut pariatur consequat nulla est id. Nostrud culpa incididunt velit sunt aliqua esse voluptate ipsum. Dolor cillum minim Lorem reprehenderit do aliqua qui commodo adipisicing ex dolor ut. Esse aute in esse ad magna dolore sint esse dolore fugiat. Fugiat excepteur cillum consectetur ipsum cillum eiusmod nulla mollit anim ad commodo sunt ea laboris.\r\n",
        "time": 11.9103,
        "completed": true,
        "points": 52
      }
    ]
  },
  {
    "id": "64a9f2c228120a1eaac1d444",
    "name": "Blackburn Gardner",
    "steps": 43741,
    "location": {
      "latitude": -36.89922,
      "longitude": -185.21096
    },
    "quests": [
      {
        "name": "Howick Historical Village",
        "id": "64a9f2c2f0ff2e5620fb98c3",
        "description": "Laborum quis occaecat ad reprehenderit et consectetur adipisicing. Commodo in qui eu enim deserunt deserunt nisi elit cupidatat labore et culpa in. Ea ullamco dolore enim ullamco. Mollit amet eu tempor voluptate excepteur id labore ad sint labore do pariatur. Quis labore do adipisicing pariatur ea laboris magna occaecat. Amet anim exercitation do aliquip Lorem. Ut irure officia sint deserunt ea officia pariatur sunt non.\r\n",
        "time": 75.749,
        "completed": true,
        "points": 15
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c24123792751c3a33a",
        "description": "Qui magna labore id Lorem et aliquip minim dolore anim dolore dolor tempor. Aliqua nostrud do amet laboris. Nisi adipisicing culpa tempor enim ipsum qui.\r\n",
        "time": 38.8423,
        "completed": true,
        "points": 90
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9f2c2ce340f29ca8db201",
        "description": "Laborum aute adipisicing deserunt officia eu. Commodo pariatur sunt aliqua laborum excepteur ad. Proident laborum est anim enim ullamco dolor nulla excepteur adipisicing dolore sint cillum deserunt magna. Duis esse occaecat fugiat veniam consequat tempor. Laborum consectetur pariatur consectetur excepteur cupidatat sint excepteur. Lorem sit enim nostrud ullamco nisi cillum tempor nisi et non exercitation eu. Proident exercitation excepteur reprehenderit nulla elit.\r\n",
        "time": 55.8417,
        "completed": true,
        "points": 21
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c27b1a7e443176982d",
        "description": "Pariatur dolor cillum nulla eiusmod cillum sit velit ut eiusmod consectetur in ut enim. Labore ipsum ut cupidatat non in est cillum aliquip voluptate nisi cupidatat. Minim cupidatat fugiat pariatur labore do nostrud eu tempor culpa. Adipisicing pariatur nostrud aliquip nulla mollit. Sunt incididunt exercitation ad non duis sint aute exercitation. Labore nisi pariatur sint laborum ex aliqua velit veniam aliqua.\r\n",
        "time": 88.6173,
        "completed": true,
        "points": 51
      },
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9f2c259011c075c6bcd00",
        "description": "Dolor tempor amet commodo officia ullamco laboris qui. Labore adipisicing irure commodo velit duis sint eiusmod laboris commodo. Esse est mollit dolor cupidatat consequat exercitation velit ad dolor sit. Voluptate adipisicing cupidatat aliqua laboris velit. Tempor ea quis amet dolore laboris quis cupidatat velit nulla. Reprehenderit occaecat et sunt ea dolore.\r\n",
        "time": 102.4817,
        "completed": true,
        "points": 79
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9f2c2b48c04555078290d",
        "description": "Cillum mollit incididunt in occaecat ut et labore sint sit labore ut excepteur aute. Id ex non nisi reprehenderit officia duis. Anim dolore dolore duis sunt culpa enim exercitation est dolor laboris laboris nisi. Nisi aliquip quis eu excepteur proident sunt nulla excepteur laborum do sint nulla. Velit aute ex velit officia eiusmod minim dolor ad laborum commodo. Eu do laboris nostrud ad qui.\r\n",
        "time": 48.1771,
        "completed": true,
        "points": 68
      },
      {
        "name": "Takapuna",
        "id": "64a9f2c2ddbfbc8479a872ee",
        "description": "Tempor qui exercitation enim reprehenderit laboris minim in ex culpa nulla. Nisi aute nulla sint incididunt commodo reprehenderit consequat incididunt aliqua id esse in occaecat eiusmod. Irure sit est fugiat elit. Do pariatur aliqua occaecat nulla commodo deserunt deserunt nisi ullamco.\r\n",
        "time": 112.359,
        "completed": true,
        "points": 74
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c209eccadeaf1abeda",
        "description": "Exercitation ut non quis Lorem cillum id Lorem duis consequat enim. Enim magna aliquip culpa veniam sit consectetur incididunt ipsum labore non proident ullamco amet. Excepteur enim cillum irure occaecat aliquip velit consequat excepteur tempor. Nulla id veniam esse incididunt aute. Dolore cillum labore id Lorem. Consectetur ex ex laborum eiusmod magna nisi ex voluptate quis fugiat elit aliquip laboris.\r\n",
        "time": 175.2263,
        "completed": true,
        "points": 81
      }
    ]
  },
  {
    "id": "64a9f2c2f6ab19ca82efaf0f",
    "name": "Cara Gibson",
    "steps": 94482,
    "location": {
      "latitude": -36.88659,
      "longitude": -185.21764
    },
    "quests": [
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9f2c2684aedf5dbdfc50c",
        "description": "Excepteur irure labore ex nulla sunt nisi consequat sunt pariatur ex. Commodo culpa enim Lorem ex ex ut aliqua pariatur. Dolore dolore adipisicing ipsum do do cupidatat consectetur nisi irure enim fugiat. Et culpa non do aute laborum proident id deserunt qui anim. Cupidatat eiusmod irure eu nulla pariatur aliqua aute magna pariatur duis eiusmod sit. Deserunt ad excepteur laboris ex esse veniam irure ipsum ex eiusmod.\r\n",
        "time": 131.3044,
        "completed": true,
        "points": 42
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2877af9f01e0d6ba4",
        "description": "Quis nostrud proident velit enim occaecat sunt commodo incididunt esse id laborum. Veniam incididunt ex qui adipisicing veniam ullamco proident id tempor aute quis. Non et pariatur cillum tempor tempor irure ipsum. Officia sit in culpa adipisicing tempor pariatur ut dolor qui. Aute reprehenderit eu labore cupidatat nulla tempor quis exercitation cupidatat.\r\n",
        "time": 73.2893,
        "completed": true,
        "points": 15
      },
      {
        "name": "Eden Park",
        "id": "64a9f2c211514d43962a67b7",
        "description": "Veniam adipisicing velit ullamco exercitation culpa ad sunt culpa nostrud aliquip eu ut. Id elit incididunt consequat tempor id eu fugiat quis magna dolore culpa sunt culpa ipsum. Velit ullamco in commodo sunt labore officia fugiat reprehenderit labore ut exercitation mollit eiusmod cupidatat. Consectetur esse proident exercitation labore incididunt pariatur sit eu ut occaecat dolor aute id. Ad sit consectetur minim Lorem exercitation. Voluptate non voluptate duis Lorem ea. Officia nostrud adipisicing dolor non do enim.\r\n",
        "time": 133.0123,
        "completed": true,
        "points": 20
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2bcc3ffa1af8d3a41",
        "description": "Ad exercitation tempor deserunt veniam culpa consectetur. Laborum qui dolor amet ullamco est esse anim. Tempor laborum reprehenderit ad mollit sunt cillum ullamco occaecat. Ea nisi mollit ullamco sint adipisicing aliqua enim laboris culpa deserunt incididunt labore. In mollit do laborum culpa amet duis exercitation. Incididunt ut eiusmod aliquip voluptate. Adipisicing voluptate magna nostrud nulla fugiat non.\r\n",
        "time": 61.2132,
        "completed": true,
        "points": 26
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c29b3c07bf65d24965",
        "description": "Ad reprehenderit cillum irure aute. Aute reprehenderit esse reprehenderit consequat do dolor mollit adipisicing elit ex ad proident esse. Dolor proident excepteur minim enim est esse incididunt laborum officia laboris exercitation qui eu fugiat. Aliquip amet fugiat aliqua consectetur non duis proident minim. Cupidatat eu minim incididunt enim Lorem id fugiat elit occaecat ipsum.\r\n",
        "time": 45.5444,
        "completed": true,
        "points": 69
      },
      {
        "name": "Bethells Beach",
        "id": "64a9f2c2b52626c844acc424",
        "description": "Enim commodo est nulla dolore adipisicing cupidatat voluptate incididunt anim. Cupidatat culpa consequat aliqua est voluptate est cillum. Duis proident sit Lorem elit aliquip ipsum nisi laborum reprehenderit commodo proident.\r\n",
        "time": 122.6727,
        "completed": true,
        "points": 66
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9f2c2c8caabd110138e78",
        "description": "Sint sunt nisi ullamco magna labore exercitation dolor. Quis ullamco in anim Lorem duis culpa magna qui tempor cillum eiusmod non commodo ipsum. Nulla eiusmod nisi qui Lorem anim cupidatat consectetur in eu pariatur qui et irure excepteur. Qui consequat aliqua laboris enim ullamco magna deserunt nostrud commodo consequat nisi minim velit. Laboris id duis veniam laborum consectetur. Aliquip nisi fugiat duis enim elit irure et Lorem in. Est proident nisi ad velit elit consectetur dolor excepteur fugiat consequat dolor incididunt consequat commodo.\r\n",
        "time": 163.5633,
        "completed": true,
        "points": 28
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c2d8633bcd8741d4f3",
        "description": "Deserunt eu nostrud proident cillum amet ut. Duis pariatur nulla sunt cillum magna ullamco ut ullamco elit mollit sunt pariatur aute. Sunt eiusmod cupidatat cupidatat eu ea exercitation. Irure ipsum proident amet officia velit occaecat cillum incididunt commodo qui tempor aliquip incididunt. Anim nostrud adipisicing dolor proident culpa dolore qui veniam excepteur ad sint consectetur labore id. Eiusmod adipisicing eiusmod id amet in.\r\n",
        "time": 153.5468,
        "completed": true,
        "points": 40
      }
    ]
  },
  {
    "id": "64a9f2c2cb7f451a3177b9b5",
    "name": "Michelle Weaver",
    "steps": 24538,
    "location": {
      "latitude": -36.88384,
      "longitude": -185.22875
    },
    "quests": [
      {
        "name": "Aotea Square",
        "id": "64a9f2c2896197cf79dbe063",
        "description": "Nulla deserunt officia nostrud minim esse. Nisi in eu laboris exercitation magna fugiat cillum ad enim amet eu pariatur. Elit tempor labore commodo sit. Enim minim consectetur dolor fugiat eu enim adipisicing amet veniam adipisicing sunt qui. Irure fugiat dolore incididunt aliquip labore nisi laborum nulla dolor reprehenderit anim non. Consectetur minim ipsum ut culpa sit eu qui. Irure tempor veniam dolor dolor occaecat voluptate id laboris.\r\n",
        "time": 71.0454,
        "completed": true,
        "points": 85
      },
      {
        "name": "Orewa Beach",
        "id": "64a9f2c2af5279366e3d2aeb",
        "description": "Exercitation eu exercitation et proident dolor in. Ut culpa do elit nulla sit ex culpa sit veniam occaecat. Sint in eiusmod sint officia.\r\n",
        "time": 151.7142,
        "completed": true,
        "points": 19
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c24a2a92331f7dd761",
        "description": "Pariatur minim consequat duis cupidatat laborum fugiat. Fugiat consectetur irure esse cupidatat eiusmod excepteur proident consequat ullamco. Labore voluptate elit eiusmod cupidatat voluptate non deserunt nulla. Id enim non enim nulla aliqua non adipisicing labore adipisicing. Ullamco et exercitation anim tempor culpa anim. Ex elit anim aliquip consequat et velit incididunt occaecat irure nisi do consequat. Ullamco id nostrud cupidatat in aliquip do in quis excepteur mollit dolor do non.\r\n",
        "time": 117.7242,
        "completed": true,
        "points": 46
      },
      {
        "name": "Queen Street",
        "id": "64a9f2c2ceabce0efa8461d7",
        "description": "Minim consequat nulla ut labore aliquip non laboris elit laboris ipsum pariatur duis. Laborum excepteur sunt dolore incididunt sunt proident cillum aute sint. Cillum commodo pariatur incididunt non occaecat laborum minim do.\r\n",
        "time": 65.7445,
        "completed": true,
        "points": 39
      },
      {
        "name": "Oneroa",
        "id": "64a9f2c2efe46b58cd79ca61",
        "description": "Tempor est deserunt magna enim ex Lorem qui magna. Id fugiat ipsum exercitation sint velit. Quis commodo quis voluptate ullamco incididunt id sunt do quis eu. Lorem sit cupidatat non consectetur minim aute exercitation.\r\n",
        "time": 26.8505,
        "completed": true,
        "points": 69
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9f2c233d60500119dcb31",
        "description": "Reprehenderit id pariatur laboris sunt laboris ea est enim sit. Ut laboris laboris dolor duis id elit velit nisi non sunt incididunt. Proident sint qui duis adipisicing. Velit est esse est quis dolore quis sit ipsum. Culpa aute voluptate fugiat ad consequat.\r\n",
        "time": 92.7879,
        "completed": true,
        "points": 75
      },
      {
        "name": "Albert Park",
        "id": "64a9f2c2ceda69e07db79a6b",
        "description": "Laboris Lorem qui labore occaecat non voluptate aliquip amet qui cillum. Deserunt est nisi anim voluptate adipisicing id. Veniam ullamco voluptate quis nisi laboris est nostrud nisi aliquip proident magna voluptate non excepteur. Reprehenderit quis deserunt deserunt quis. Voluptate deserunt sunt veniam aute enim reprehenderit aliqua sit dolor ut dolor occaecat amet.\r\n",
        "time": 158.6917,
        "completed": true,
        "points": 90
      },
      {
        "name": "Karekare",
        "id": "64a9f2c2961b1a55450fac8e",
        "description": "Quis officia sunt consequat deserunt quis sint aliqua occaecat esse est pariatur ex. Voluptate consectetur anim qui mollit proident ex consectetur eiusmod nisi veniam aliqua qui fugiat. Nulla officia qui quis sunt quis pariatur eiusmod reprehenderit laborum minim aliquip. Commodo nulla laborum cupidatat esse. Minim consectetur pariatur sint consequat enim laboris nisi exercitation laborum aliquip ex amet in. Lorem nisi aliquip ea officia elit non incididunt.\r\n",
        "time": 91.8138,
        "completed": true,
        "points": 71
      },
      {
        "name": "Aotea Square",
        "id": "64a9f2c2d75ed20cc4889862",
        "description": "Amet veniam commodo consectetur enim enim sit ea cillum voluptate voluptate dolor magna nisi. Culpa veniam Lorem enim ut. Ullamco laborum eiusmod elit veniam sunt ut qui voluptate esse. Adipisicing deserunt ex eu sit Lorem ad. Excepteur eiusmod sunt aute excepteur laboris nostrud. Ullamco fugiat non excepteur mollit laboris eu.\r\n",
        "time": 93.2279,
        "completed": true,
        "points": 91
      }
    ]
  },
  {
    "id": "64a9f2c2c0e11d2d0fbe06a9",
    "name": "Susanna Guzman",
    "steps": 41234,
    "location": {
      "latitude": -36.87746,
      "longitude": -185.21463
    },
    "quests": [
      {
        "name": "Piha Beach",
        "id": "64a9f2c2fb2e6eceaaa6594a",
        "description": "Cillum do aliquip tempor duis aliqua. Ut labore veniam consectetur qui commodo cupidatat. Officia irure laboris laboris deserunt esse do qui excepteur dolor elit. Amet esse elit ea ex sunt ullamco id fugiat reprehenderit sint.\r\n",
        "time": 57.2356,
        "completed": true,
        "points": 34
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c29e705eba3a1c3843",
        "description": "Ea ex nisi officia velit aliqua amet cillum non occaecat officia. Laboris adipisicing irure occaecat fugiat deserunt ut consequat. Ad consectetur est do culpa minim id pariatur cillum non veniam.\r\n",
        "time": 72.183,
        "completed": true,
        "points": 87
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2e0b922bf0b1b22df",
        "description": "Velit nostrud est eiusmod laborum veniam ut quis dolor officia proident ut. Sint aliqua voluptate adipisicing ullamco velit incididunt aute enim duis mollit. Ea quis aliquip officia pariatur quis ullamco ad ullamco ullamco fugiat amet. Amet tempor aliqua aute ut sint.\r\n",
        "time": 56.1911,
        "completed": true,
        "points": 34
      },
      {
        "name": "Oneroa",
        "id": "64a9f2c25b925fc1365d7967",
        "description": "Adipisicing Lorem dolore amet eiusmod commodo voluptate. In non reprehenderit amet qui laborum irure sunt laboris consectetur nisi. Mollit officia elit veniam est ea. Cillum ex consectetur minim minim velit deserunt elit dolor culpa dolore. Incididunt esse minim officia tempor aliquip ut magna voluptate dolor elit irure proident esse.\r\n",
        "time": 87.5787,
        "completed": true,
        "points": 100
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c262b85ed19248e34f",
        "description": "Incididunt esse elit cupidatat nisi ex enim anim qui enim Lorem nostrud. Mollit et consequat excepteur Lorem proident mollit Lorem deserunt non sint cupidatat incididunt. Cupidatat nostrud consequat est amet fugiat ad consectetur aliquip. Labore aliquip adipisicing commodo anim ipsum consectetur aliqua adipisicing fugiat aliquip elit minim. Quis qui duis non sit aliqua nisi minim cupidatat occaecat duis deserunt quis elit aliquip. Nostrud dolor dolor aliqua pariatur magna tempor aliqua et irure mollit commodo proident ex nostrud.\r\n",
        "time": 138.1585,
        "completed": true,
        "points": 89
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2df6e8235f8041786",
        "description": "Tempor tempor exercitation duis velit. Reprehenderit minim cillum proident sunt sunt excepteur officia nostrud. Officia duis voluptate Lorem sit ipsum quis do est amet in. Commodo quis velit velit incididunt laboris. Nostrud fugiat Lorem qui excepteur exercitation nulla incididunt eu elit consectetur do esse veniam.\r\n",
        "time": 150.8807,
        "completed": true,
        "points": 56
      },
      {
        "name": "Parnell",
        "id": "64a9f2c2fff861c4c8192007",
        "description": "Cupidatat excepteur nisi dolor et nulla ullamco nisi duis esse. Dolore ad dolor ea nulla laboris officia ad officia velit est. Dolore id velit irure ipsum magna est labore ad dolor aute nulla commodo commodo eu. Irure nostrud consequat laborum cillum cillum sit ullamco aliquip fugiat. Ipsum nostrud laborum dolore dolor sint.\r\n",
        "time": 7.3457,
        "completed": true,
        "points": 59
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9f2c206b406044486d147",
        "description": "Do quis enim non commodo et ut elit do eu veniam fugiat ea. Sint in tempor est sint aliquip ut proident aute tempor anim dolor elit dolore. Quis aute laborum mollit deserunt consectetur ut aliquip eu velit ullamco sint. Ea cupidatat non proident consectetur exercitation est ut ipsum voluptate et est veniam. Officia enim irure laboris id ipsum culpa ad commodo nostrud voluptate nostrud mollit sunt labore. Qui aliqua fugiat aute aliquip esse non adipisicing mollit consectetur adipisicing veniam velit eu. Velit culpa aute esse cillum adipisicing eu.\r\n",
        "time": 36.272,
        "completed": true,
        "points": 40
      }
    ]
  },
  {
    "id": "64a9f2c230a18f4f8ccb53ca",
    "name": "Tanya Buchanan",
    "steps": 19394,
    "location": {
      "latitude": -36.89916,
      "longitude": -185.22275
    },
    "quests": [
      {
        "name": "Maraetai Beach",
        "id": "64a9f2c2fa8c53c5a4a6301a",
        "description": "Irure mollit fugiat fugiat ea. Velit excepteur irure veniam esse deserunt consectetur tempor minim eiusmod in nisi fugiat. Ex duis excepteur commodo incididunt Lorem culpa id esse proident deserunt qui ipsum velit id.\r\n",
        "time": 195.9199,
        "completed": true,
        "points": 40
      },
      {
        "name": "Albert Park",
        "id": "64a9f2c203aa1e0d301aa575",
        "description": "Magna velit culpa id mollit. Exercitation labore commodo do anim. Exercitation sint culpa pariatur consequat dolor aliquip et qui non. Magna elit est commodo occaecat sunt fugiat consectetur id quis ut excepteur non cillum commodo. Ullamco veniam magna et occaecat pariatur proident qui adipisicing. Mollit mollit ullamco reprehenderit cupidatat irure nostrud ullamco ea irure culpa quis eu enim.\r\n",
        "time": 108.1784,
        "completed": true,
        "points": 72
      },
      {
        "name": "Devonport",
        "id": "64a9f2c28f90d515dd2cc386",
        "description": "Reprehenderit sit in et elit cillum eu reprehenderit irure ea cupidatat ullamco elit. Lorem do esse reprehenderit nulla nisi in id non sit quis. Deserunt proident et est aute id quis esse cillum quis culpa. Reprehenderit non adipisicing ex enim proident laborum deserunt dolor esse eu. Nostrud minim ex esse Lorem eiusmod consectetur excepteur. Eiusmod eiusmod excepteur incididunt commodo non. Reprehenderit anim magna consequat commodo irure mollit tempor nisi veniam amet et duis exercitation.\r\n",
        "time": 147.0027,
        "completed": true,
        "points": 84
      },
      {
        "name": "Hunua Falls",
        "id": "64a9f2c25fcdcb91c547253c",
        "description": "Laborum consectetur anim in fugiat nisi ullamco reprehenderit aute minim labore aliquip ad. Esse laboris sunt culpa ea qui elit adipisicing est reprehenderit. Cupidatat consequat adipisicing do laborum ipsum labore reprehenderit minim dolore proident. Fugiat consequat ad cupidatat ex cupidatat et occaecat ut.\r\n",
        "time": 2.1213,
        "completed": true,
        "points": 17
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9f2c2ec331152218a0212",
        "description": "Ex adipisicing aliquip aute tempor sunt incididunt quis culpa. Nostrud sit deserunt veniam sunt fugiat non. Enim fugiat mollit adipisicing duis ad. Nulla exercitation sint ea ullamco nostrud dolor ea adipisicing mollit commodo sint officia nostrud. Non eu incididunt nisi proident dolore. Ut elit qui irure non aliquip. Id laborum reprehenderit aliquip anim dolore eiusmod velit.\r\n",
        "time": 25.6332,
        "completed": true,
        "points": 55
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c24a38018c535bc13a",
        "description": "Duis in aliqua non elit id exercitation in eu magna aliqua laborum ex. Consequat occaecat consequat dolore mollit fugiat voluptate. Fugiat consequat incididunt nostrud consectetur in elit consequat magna cupidatat commodo. Do consectetur officia culpa sint aliqua. Aute nostrud officia laborum enim commodo. Fugiat ad Lorem sit tempor. Dolore aliquip ullamco adipisicing ex ex non laboris dolor sint.\r\n",
        "time": 147.3035,
        "completed": true,
        "points": 55
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9f2c24e50bedd9b3e60af",
        "description": "Voluptate labore sunt aliqua culpa. Consectetur laborum nostrud cupidatat esse nisi cillum veniam anim enim dolor excepteur commodo. Consectetur veniam consectetur sint est veniam excepteur mollit excepteur duis pariatur id laborum nostrud eiusmod. Et reprehenderit culpa ullamco cupidatat et dolore commodo adipisicing consectetur occaecat labore amet magna pariatur. Minim nulla fugiat anim nostrud non cupidatat.\r\n",
        "time": 144.9552,
        "completed": true,
        "points": 27
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c214720691270e3215",
        "description": "Amet velit ea ex duis cupidatat excepteur velit fugiat. Nostrud tempor Lorem amet id incididunt nostrud. Anim deserunt mollit anim eu eiusmod mollit irure aute. Esse commodo ad tempor aliquip ullamco duis cupidatat ut. Exercitation nulla eu do elit eu nulla esse enim labore excepteur. Aliquip velit ullamco sint magna et esse voluptate irure tempor nulla sint velit do laboris. Exercitation minim in mollit voluptate consectetur culpa minim dolor sit ullamco commodo fugiat.\r\n",
        "time": 66.459,
        "completed": true,
        "points": 79
      }
    ]
  },
  {
    "id": "64a9f2c2ecbe714937bff9c1",
    "name": "Alana Odonnell",
    "steps": 60664,
    "location": {
      "latitude": -36.87021,
      "longitude": -185.27755
    },
    "quests": [
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c2e6b3a1b1f0e260a0",
        "description": "Non sunt deserunt non consequat consequat anim adipisicing elit eu excepteur mollit cupidatat voluptate duis. Et dolor eu enim ut mollit dolore sunt voluptate ea duis. Velit occaecat quis exercitation velit commodo veniam veniam irure anim duis elit Lorem enim. Adipisicing reprehenderit quis dolor aliquip sit ad ad do adipisicing sunt Lorem.\r\n",
        "time": 83.2894,
        "completed": true,
        "points": 42
      },
      {
        "name": "Parnell",
        "id": "64a9f2c265bde283738eb459",
        "description": "Id qui cillum eiusmod ipsum cupidatat cupidatat aliquip occaecat ad cillum. Incididunt pariatur eiusmod dolore elit quis deserunt. Sit laboris consectetur eu sunt. Esse irure est sint do irure minim. Deserunt minim nulla est pariatur sunt. Veniam ea pariatur eiusmod Lorem aliqua sint dolor excepteur exercitation anim amet culpa minim culpa. Nisi dolor pariatur amet laborum nulla elit sint quis.\r\n",
        "time": 167.1772,
        "completed": true,
        "points": 49
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c2ecbb35a9c3399bd5",
        "description": "Id ut nulla id do sint quis cillum elit fugiat officia esse dolore eiusmod. Velit laborum proident id commodo adipisicing irure cillum. Amet commodo voluptate commodo magna nisi cillum consectetur nulla tempor excepteur in. Sint consequat non velit ut aliquip laborum reprehenderit non. Anim eu culpa nulla laboris nulla minim aliqua Lorem mollit excepteur dolore labore amet. Lorem dolore sit ex ullamco aute consequat adipisicing dolor. Duis irure nostrud officia amet anim ad deserunt sit mollit ipsum.\r\n",
        "time": 188.6133,
        "completed": true,
        "points": 88
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2cf4f3abe79b7dd1b",
        "description": "Lorem laborum sunt mollit aliqua labore nostrud minim ad nisi ut amet sunt consectetur. Reprehenderit aute amet cillum adipisicing elit dolore occaecat ipsum id fugiat sit consectetur minim ad. Amet amet aute amet dolore et. Commodo cillum duis aliqua ad incididunt laboris adipisicing officia aute non esse et qui sit. Fugiat anim nostrud enim qui quis esse. Officia Lorem tempor amet quis fugiat officia non labore officia culpa duis. Officia esse ea quis voluptate ex eiusmod velit in sint.\r\n",
        "time": 136.2962,
        "completed": true,
        "points": 28
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9f2c255da149368dfc162",
        "description": "Laboris incididunt adipisicing tempor irure qui sit exercitation et id veniam aliquip. Officia cupidatat dolore consequat voluptate eu esse sit non id anim ex. Incididunt elit veniam non consequat ea ipsum minim adipisicing et aliquip.\r\n",
        "time": 78.7408,
        "completed": true,
        "points": 54
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2ac2fbb604e4111a3",
        "description": "Aute aliquip non nostrud nulla aute sint dolore non nulla. Aute et labore culpa sit veniam ullamco sint. Id irure irure reprehenderit dolor cupidatat duis.\r\n",
        "time": 199.6084,
        "completed": true,
        "points": 98
      },
      {
        "name": "Mount Eden",
        "id": "64a9f2c256aa914fcd74cbe5",
        "description": "Ex minim Lorem est adipisicing ex minim enim cupidatat quis esse qui duis. Nulla amet consectetur do excepteur do. Consectetur cillum deserunt amet laborum dolore. Ut eu ex velit irure laboris commodo excepteur irure anim do officia dolore do. Mollit mollit pariatur tempor nisi id velit. Labore nisi nostrud veniam exercitation quis eu elit pariatur. Elit minim duis pariatur duis in dolore anim laboris minim nisi culpa eu.\r\n",
        "time": 118.4974,
        "completed": true,
        "points": 23
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2a638dec7884d005b",
        "description": "In quis irure deserunt et nulla. Labore eu sit enim ut est reprehenderit sint deserunt aliqua dolore consequat incididunt duis. Ea duis proident irure reprehenderit minim occaecat sit. Non occaecat ad aute velit non ullamco dolore.\r\n",
        "time": 115.6523,
        "completed": true,
        "points": 94
      }
    ]
  },
  {
    "id": "64a9f2c2e67250422e8b5605",
    "name": "Georgina Meyer",
    "steps": 80202,
    "location": {
      "latitude": -36.88237,
      "longitude": -185.27121
    },
    "quests": [
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2c1c42322a761d958",
        "description": "Aliqua deserunt eu nisi aliqua. Fugiat quis officia labore laborum cupidatat nulla aliquip veniam aute labore anim excepteur. Sunt esse minim duis consequat laboris commodo commodo anim consectetur ut ipsum Lorem aliqua consequat. Exercitation consectetur elit consectetur labore laboris. Id occaecat adipisicing non irure elit do labore ex laboris tempor pariatur incididunt. Fugiat laboris dolor nulla sit do do fugiat est est voluptate adipisicing sit nisi.\r\n",
        "time": 53.0889,
        "completed": true,
        "points": 45
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c2cdcd05760cbde523",
        "description": "Anim do laborum sunt nulla. Fugiat aute occaecat velit commodo Lorem est labore ex consectetur incididunt sit. Aliqua proident consequat aliqua quis et incididunt laborum cupidatat ea commodo do nisi cupidatat. Magna mollit eiusmod ipsum et adipisicing aliquip anim amet elit. Reprehenderit quis cillum amet enim. Ipsum ad aliquip eiusmod sit duis.\r\n",
        "time": 75.3853,
        "completed": true,
        "points": 28
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c213fb5e18bcdab4f8",
        "description": "Officia in amet voluptate reprehenderit proident ex ex excepteur reprehenderit est officia amet qui. Dolor do cupidatat cupidatat incididunt fugiat et culpa excepteur enim id eiusmod consequat ea. Do laborum pariatur irure et id ea fugiat et consequat esse magna. Dolor ad pariatur incididunt veniam consectetur cillum incididunt id ad ex adipisicing. Irure exercitation qui ea laborum ut voluptate voluptate ipsum fugiat proident.\r\n",
        "time": 61.6682,
        "completed": true,
        "points": 83
      },
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9f2c224253176f956929f",
        "description": "Magna cillum aliqua id eu. Amet cillum sit aliquip aliqua id deserunt eu tempor irure. Tempor incididunt minim eu non sint id eiusmod id velit do Lorem veniam excepteur.\r\n",
        "time": 185.5983,
        "completed": true,
        "points": 33
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c295b379781962cbde",
        "description": "Anim in adipisicing fugiat incididunt Lorem magna eiusmod. Do nostrud est qui culpa ea adipisicing non anim ut. Dolor magna quis minim labore. Officia sint mollit dolore officia.\r\n",
        "time": 33.8491,
        "completed": true,
        "points": 100
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c2fc77cb506ab2197d",
        "description": "Reprehenderit sint aute incididunt nostrud ipsum duis. Consequat adipisicing laboris aliqua quis ullamco eiusmod dolor eu enim. Proident incididunt magna aliqua qui deserunt Lorem Lorem esse. Sit aute sint culpa veniam. Cupidatat nisi in sunt pariatur Lorem tempor est aliqua ullamco exercitation veniam voluptate. Adipisicing non ad deserunt qui ut ipsum nisi consequat culpa elit sunt. Voluptate adipisicing voluptate qui elit ex magna et exercitation non.\r\n",
        "time": 99.4992,
        "completed": true,
        "points": 11
      },
      {
        "name": "Bethells Beach",
        "id": "64a9f2c29756a9194f8261e9",
        "description": "Quis aliquip ex adipisicing dolore do eiusmod sunt. Id anim deserunt ad eiusmod culpa laboris duis ea veniam. Elit id quis proident nisi. Consequat anim minim aliqua cillum aliqua. Officia reprehenderit do et dolor sunt anim fugiat reprehenderit dolor. Proident Lorem mollit veniam eu cupidatat ea pariatur anim dolore. Anim quis dolor eiusmod occaecat id id nostrud amet sint irure incididunt veniam.\r\n",
        "time": 47.5588,
        "completed": true,
        "points": 71
      },
      {
        "name": "Devonport",
        "id": "64a9f2c2d4f2ab39800da771",
        "description": "Et ex irure ullamco quis commodo ipsum. Exercitation culpa fugiat ex nisi ullamco cillum commodo. Labore est aliqua in sunt magna in.\r\n",
        "time": 1.0273,
        "completed": true,
        "points": 66
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c280c4059c387edaa8",
        "description": "Magna labore sint ex nisi sit id consequat velit ex labore et. Est tempor ut nisi ad aliqua dolore aliqua aliquip consequat. Duis enim irure proident aute nisi nostrud et aute adipisicing aliqua. Eiusmod Lorem amet elit elit consequat mollit laboris.\r\n",
        "time": 22.7412,
        "completed": true,
        "points": 47
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2a766bf1505ac8313",
        "description": "Culpa ea exercitation deserunt amet incididunt. Eu ipsum nulla est nostrud voluptate nulla amet voluptate aute duis. Ex deserunt sunt voluptate incididunt irure irure. Deserunt incididunt dolore magna et minim ipsum. Exercitation enim labore cillum magna commodo cillum. Culpa eu ea dolore consequat voluptate. Adipisicing quis excepteur ex veniam.\r\n",
        "time": 29.9505,
        "completed": true,
        "points": 67
      }
    ]
  },
  {
    "id": "64a9f2c27044cc2068739bac",
    "name": "Agnes Baxter",
    "steps": 43013,
    "location": {
      "latitude": -36.87617,
      "longitude": -185.26838
    },
    "quests": [
      {
        "name": "Kawau Island",
        "id": "64a9f2c2f2232a38ba04337a",
        "description": "Velit incididunt cupidatat adipisicing sit labore ex magna cillum quis cillum pariatur aute velit occaecat. Esse voluptate dolor ea elit dolore mollit. Ut sunt dolore enim duis. Nostrud quis duis ullamco sint.\r\n",
        "time": 140.0009,
        "completed": true,
        "points": 97
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9f2c2467e4a49ff2b55eb",
        "description": "Amet anim tempor sit cupidatat duis. Nulla sit ut proident qui commodo cupidatat. Consequat proident dolore aute eu culpa. Proident voluptate dolore est esse consequat. Aute tempor ullamco excepteur aliquip labore. Elit dolore Lorem est nulla.\r\n",
        "time": 5.212,
        "completed": true,
        "points": 45
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c2322b02c999aa6258",
        "description": "Enim labore irure officia sint laborum reprehenderit veniam proident ex esse cupidatat ut sunt. Qui quis eu cillum officia magna Lorem proident esse et ad minim culpa dolore nisi. Ea consequat adipisicing cupidatat cupidatat excepteur exercitation consectetur nulla. Sit ullamco quis ipsum irure duis irure dolore excepteur. Sint Lorem exercitation amet reprehenderit voluptate excepteur occaecat enim labore. Fugiat ad laborum amet anim cillum exercitation.\r\n",
        "time": 111.2912,
        "completed": true,
        "points": 10
      },
      {
        "name": "Karekare Beach",
        "id": "64a9f2c2c0e95971a07bc6f4",
        "description": "Cillum veniam ex amet consectetur esse exercitation deserunt ad do ea aliquip eiusmod. Nisi officia dolor et laboris irure quis ea cillum nostrud. Et ex est dolor cupidatat veniam. Sunt anim aliquip mollit pariatur commodo anim eiusmod minim dolore.\r\n",
        "time": 37.2356,
        "completed": true,
        "points": 42
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c2fa7b622c708bdb62",
        "description": "Nostrud sit occaecat irure labore velit commodo nostrud Lorem laborum occaecat. Sunt labore culpa magna do in nostrud sunt eu aute. Labore velit ipsum enim nulla nulla ad proident dolor cillum. Exercitation fugiat ullamco ullamco do. Ipsum proident anim est proident dolore cillum sint veniam ea quis culpa aliquip veniam cupidatat. Proident deserunt ex et minim occaecat culpa labore aute aliquip reprehenderit sint officia eu sunt. Anim elit id et ullamco proident minim occaecat ut esse non.\r\n",
        "time": 66.7053,
        "completed": true,
        "points": 93
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2cd4cc401b42f4670",
        "description": "Mollit duis eiusmod cillum elit. Labore sunt minim do laboris ea proident aliqua consequat ad tempor mollit aute ipsum. Aliquip sunt pariatur occaecat duis ea in reprehenderit veniam ad. Irure qui ea irure officia cupidatat sunt sit qui adipisicing non labore. Labore officia sint magna incididunt ea esse sit aute fugiat dolor eu adipisicing excepteur. Deserunt dolor anim enim incididunt exercitation qui cupidatat cillum dolor. Lorem ad minim pariatur non incididunt fugiat laborum velit.\r\n",
        "time": 1.4654,
        "completed": true,
        "points": 71
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c2031f7b3649b8f841",
        "description": "Ea eiusmod velit quis adipisicing nostrud consectetur. Laborum Lorem incididunt commodo enim irure est magna nulla aliquip et sint culpa tempor id. Ea veniam laborum duis nulla occaecat sit ex incididunt. Elit ut ipsum voluptate excepteur. Aliquip irure fugiat voluptate aliquip in ipsum et aliqua ut sunt ex.\r\n",
        "time": 38.6065,
        "completed": true,
        "points": 79
      },
      {
        "name": "Devonport",
        "id": "64a9f2c2a0598f82ee1fe0f7",
        "description": "Officia aliqua cupidatat qui consectetur. Pariatur velit ut laborum eiusmod incididunt tempor. Est in dolore incididunt aute reprehenderit anim non cupidatat mollit do laboris culpa dolore. Voluptate ullamco irure magna sint quis dolor veniam minim velit incididunt culpa incididunt sunt ullamco. Lorem esse culpa ex ex.\r\n",
        "time": 19.1821,
        "completed": true,
        "points": 56
      }
    ]
  },
  {
    "id": "64a9f2c2d6c6baf984ef4310",
    "name": "Rose Kline",
    "steps": 70159,
    "location": {
      "latitude": -36.88823,
      "longitude": -185.25484
    },
    "quests": [
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c266b767afe210ce61",
        "description": "Ipsum cillum sit incididunt labore cillum reprehenderit sit minim duis ea tempor Lorem anim. Eu ea Lorem aliqua occaecat exercitation cupidatat commodo ea. Est deserunt fugiat quis nostrud officia mollit non consequat eiusmod ex magna. Elit nisi culpa veniam commodo nisi pariatur officia labore in non aute reprehenderit.\r\n",
        "time": 72.6405,
        "completed": true,
        "points": 13
      },
      {
        "name": "Sky Tower",
        "id": "64a9f2c269123b80eec2f660",
        "description": "Elit enim pariatur veniam magna sit eu sint velit laborum velit nostrud. Reprehenderit commodo occaecat tempor proident ipsum est ullamco ut consequat fugiat adipisicing qui proident enim. Labore dolor occaecat ipsum ex eiusmod nostrud voluptate officia anim. Eu deserunt in sit ullamco incididunt duis dolore.\r\n",
        "time": 182.7099,
        "completed": true,
        "points": 36
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9f2c28320dcc314434883",
        "description": "Nulla officia cillum adipisicing adipisicing eu mollit do mollit ea reprehenderit ipsum irure eu enim. Ullamco excepteur sunt consectetur sit deserunt in do id mollit sint. Non consequat do eu non anim id irure qui incididunt veniam sint cillum aute ad. Ad dolor minim aute nulla aute consequat. Id Lorem laborum aliqua veniam magna tempor laboris ut adipisicing.\r\n",
        "time": 120.2717,
        "completed": true,
        "points": 28
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9f2c2259b38f3dbbbc836",
        "description": "Exercitation reprehenderit commodo commodo officia commodo nulla id cupidatat consectetur nulla culpa sint minim sunt. Nostrud ad eiusmod nostrud nostrud sunt cillum occaecat ad exercitation Lorem Lorem. Consectetur sunt labore culpa nostrud ea enim elit fugiat laborum consequat excepteur commodo sit. Lorem ut duis exercitation esse ea non dolore ex sint voluptate ad. Do elit irure ipsum aute reprehenderit culpa nisi fugiat ipsum nisi Lorem fugiat est.\r\n",
        "time": 80.1909,
        "completed": true,
        "points": 21
      },
      {
        "name": "Aotea Square",
        "id": "64a9f2c29ba151340fa12688",
        "description": "Sint aliqua fugiat incididunt anim id est ea proident. Sunt ipsum quis reprehenderit officia officia ad exercitation non anim. Reprehenderit excepteur ea laborum proident. Aliquip cillum consequat nisi consequat. Ex qui qui voluptate ut eiusmod sint culpa labore officia do. Id deserunt culpa et minim tempor esse ad amet magna esse laboris eu fugiat laboris.\r\n",
        "time": 83.6705,
        "completed": true,
        "points": 74
      },
      {
        "name": "Maraetai Beach",
        "id": "64a9f2c22138f8bd0facc579",
        "description": "Irure exercitation occaecat nisi nulla eu laboris nisi quis sunt duis nisi reprehenderit nulla nulla. Non reprehenderit commodo mollit quis dolor ea veniam aliqua exercitation minim commodo mollit. Eu tempor mollit amet deserunt. Minim anim deserunt aliquip esse id proident quis sit. Ut id adipisicing exercitation cillum eiusmod reprehenderit labore minim non commodo nostrud ipsum.\r\n",
        "time": 89.7857,
        "completed": true,
        "points": 17
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2b6dc176aaf0e442a",
        "description": "Magna et minim non tempor. Laborum ipsum ut sint nostrud enim tempor. Ea veniam enim amet irure. Ad commodo ipsum reprehenderit elit commodo mollit in commodo qui.\r\n",
        "time": 187.6609,
        "completed": true,
        "points": 35
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c2a8da27a0f976864c",
        "description": "Laborum elit voluptate tempor proident sint. Ex exercitation eiusmod enim proident. Quis qui excepteur quis dolor mollit dolor sit mollit tempor labore in. Enim cupidatat nulla labore consectetur commodo occaecat labore dolore.\r\n",
        "time": 139.9271,
        "completed": true,
        "points": 82
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c2eb72b8969fdbfe95",
        "description": "Tempor ea deserunt Lorem sunt consectetur reprehenderit laboris pariatur magna et laboris minim. Proident elit tempor et non cupidatat aliqua ut officia do labore. Esse voluptate magna excepteur sint cupidatat quis dolore consectetur voluptate occaecat.\r\n",
        "time": 30.346,
        "completed": true,
        "points": 48
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c26e595b8f969a6eb4",
        "description": "Cupidatat ipsum est tempor eiusmod proident incididunt labore. Mollit do occaecat eu labore excepteur ad eu. Ullamco nulla nisi irure cupidatat consequat nisi ad tempor. Sunt nulla occaecat duis tempor incididunt occaecat incididunt dolor nulla. Enim dolore cupidatat ea duis enim consectetur tempor labore duis in. Aliquip irure anim ad deserunt quis veniam qui fugiat dolor et.\r\n",
        "time": 15.3986,
        "completed": true,
        "points": 47
      }
    ]
  },
  {
    "id": "64a9f2c258225962c69eec7c",
    "name": "Rose Pickett",
    "steps": 56824,
    "location": {
      "latitude": -36.89365,
      "longitude": -185.22061
    },
    "quests": [
      {
        "name": "Hunua Falls",
        "id": "64a9f2c2202a38a2f49ade83",
        "description": "Proident velit esse nulla culpa aliquip deserunt aliquip velit nisi pariatur non. Elit eiusmod do laborum ea culpa sint ut. Laboris tempor esse officia incididunt anim ea elit ut adipisicing aliqua non pariatur consequat exercitation. Cillum ea ullamco pariatur in in enim ut. Minim non duis magna nulla non et adipisicing eiusmod aliquip duis consequat pariatur.\r\n",
        "time": 81.5403,
        "completed": true,
        "points": 39
      },
      {
        "name": "Gulf Harbour",
        "id": "64a9f2c2833110ffc5542461",
        "description": "Nisi veniam deserunt quis proident duis ut qui mollit in adipisicing veniam. Nulla culpa exercitation consequat officia esse reprehenderit cillum tempor fugiat nisi et non. Esse anim dolore mollit incididunt ut tempor esse eu reprehenderit enim sint quis. Consectetur et ex sunt laboris. Officia deserunt ad officia anim commodo id nulla. Mollit aliqua amet commodo et aliquip irure commodo qui voluptate nulla in cupidatat aute Lorem. Adipisicing duis cillum tempor laborum quis officia elit incididunt ad est.\r\n",
        "time": 30.8932,
        "completed": true,
        "points": 83
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c2d332e46a8483ce56",
        "description": "Ut excepteur sunt enim culpa cillum occaecat irure sit. Aute laborum officia in eu fugiat consectetur ut qui est ullamco. Anim deserunt velit nisi nisi commodo duis magna sint Lorem quis est reprehenderit nulla. Qui adipisicing quis mollit dolor. Id minim pariatur occaecat fugiat ullamco quis sint excepteur non ex ullamco. Consectetur mollit do dolor Lorem eiusmod excepteur ex voluptate adipisicing. Laborum ad irure pariatur anim proident commodo cupidatat duis culpa ea.\r\n",
        "time": 98.2171,
        "completed": true,
        "points": 56
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c28413cef4ead221c1",
        "description": "Pariatur exercitation cillum eiusmod sit id aliquip eiusmod laborum nulla laborum occaecat ad dolore est. Pariatur labore proident esse consequat laboris incididunt nisi minim quis magna dolore. Voluptate exercitation ex duis eu ad consequat cillum nisi.\r\n",
        "time": 191.7268,
        "completed": true,
        "points": 99
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2b5af3658a0d5716e",
        "description": "Excepteur minim ipsum id eiusmod deserunt reprehenderit minim. Nisi aliqua cillum aliquip sit non nulla id magna. Ad nisi consectetur labore velit. Ipsum anim laboris veniam fugiat nisi anim. Aute tempor dolore aute consectetur cillum laborum irure velit ullamco commodo aliqua est sit. Reprehenderit eiusmod dolor incididunt eu enim.\r\n",
        "time": 160.6427,
        "completed": true,
        "points": 75
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c26fdbdb305138cc63",
        "description": "Incididunt elit proident laboris excepteur adipisicing amet non esse est ullamco incididunt nisi. Veniam velit magna duis est eu enim pariatur ut. Irure ut reprehenderit minim esse culpa. Eu aliqua magna incididunt non proident voluptate id et quis magna. Nulla veniam laboris ex dolore aliqua. Aliqua et culpa ad ullamco quis cupidatat ut. Ex culpa sunt ut aute reprehenderit labore laborum aute officia.\r\n",
        "time": 130.7851,
        "completed": true,
        "points": 39
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c27781d9f576006480",
        "description": "Ea anim aliqua veniam ullamco minim. Enim fugiat non nisi exercitation aliquip id laborum fugiat in sint labore non qui. Enim mollit dolore adipisicing non culpa Lorem aute occaecat. Dolor velit cupidatat amet nisi ad. Pariatur consectetur officia est excepteur quis consectetur nostrud anim aliquip amet cupidatat sit enim consequat. Lorem fugiat reprehenderit qui fugiat fugiat anim pariatur cupidatat cillum adipisicing ut voluptate nulla. Id pariatur dolore cillum amet culpa reprehenderit sunt non culpa et.\r\n",
        "time": 199.7505,
        "completed": true,
        "points": 38
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c24fa5830c8fd31095",
        "description": "Eiusmod sunt quis velit mollit. Proident amet et eiusmod mollit ad ullamco ea adipisicing et minim nostrud. Sint ut consectetur ullamco et reprehenderit officia occaecat sint nisi. Dolore ullamco consequat adipisicing Lorem est Lorem ipsum sunt deserunt id.\r\n",
        "time": 148.682,
        "completed": true,
        "points": 66
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c2099caea55cfacc8d",
        "description": "Irure commodo veniam ullamco culpa cupidatat adipisicing aute minim cupidatat dolore laborum adipisicing pariatur veniam. Duis duis consequat est cupidatat dolor labore nostrud ex. Proident consectetur veniam laborum dolore mollit cupidatat. Aliquip aliqua qui quis do mollit velit nulla culpa sit labore dolore enim irure. Labore commodo voluptate quis officia tempor ea anim commodo ex Lorem nostrud non fugiat est. Dolor deserunt ut veniam anim aliqua officia eiusmod id aliqua qui sunt quis.\r\n",
        "time": 33.7943,
        "completed": true,
        "points": 25
      }
    ]
  },
  {
    "id": "64a9f2c23629be905acb95ac",
    "name": "Brewer Mcleod",
    "steps": 84269,
    "location": {
      "latitude": -36.87498,
      "longitude": -185.20516
    },
    "quests": [
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c23d16578f0292c2b2",
        "description": "Ut consequat amet nostrud elit adipisicing duis cillum cupidatat incididunt culpa ex reprehenderit Lorem. Officia in aliqua do laboris. Proident sunt esse ipsum reprehenderit ipsum sunt ipsum incididunt exercitation ex sunt non fugiat. Ad quis occaecat quis deserunt dolor excepteur elit voluptate. Dolor esse tempor aute ad qui laborum quis.\r\n",
        "time": 40.8897,
        "completed": true,
        "points": 66
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c2778cab2e5fb16b2b",
        "description": "Ea deserunt labore et ullamco adipisicing elit labore ex aute veniam sit. Ullamco esse voluptate sit tempor reprehenderit nostrud sint voluptate adipisicing ut consequat do pariatur eu. Ipsum labore dolor ipsum in. Amet ex nulla sit laboris. Voluptate deserunt proident eu culpa. Minim dolore amet eiusmod laborum eu exercitation ullamco minim ad.\r\n",
        "time": 57.3486,
        "completed": true,
        "points": 51
      },
      {
        "name": "Orewa Beach",
        "id": "64a9f2c22aa4a653caacef8a",
        "description": "Quis velit id laboris est in magna voluptate esse amet magna. Commodo proident nisi eu aliquip dolor aute sint ullamco culpa. Ut ut sint anim consectetur in labore non. Incididunt et sunt proident mollit id culpa anim. Ut adipisicing sit exercitation in ad laborum dolore magna.\r\n",
        "time": 153.1828,
        "completed": true,
        "points": 21
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c2b7ce57063f8dd458",
        "description": "Pariatur magna commodo duis velit veniam. Ipsum ullamco commodo non veniam magna elit consectetur adipisicing nulla consequat id reprehenderit minim consectetur. Consectetur est ut in dolore reprehenderit aute duis ut. Aliquip veniam voluptate adipisicing qui nisi. Esse culpa qui sit ipsum velit incididunt cillum id. Labore deserunt fugiat minim proident ea culpa magna consectetur duis aute.\r\n",
        "time": 21.1135,
        "completed": true,
        "points": 49
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c2738212e3f1c9b066",
        "description": "Ad Lorem velit tempor ex tempor anim irure officia in irure aute. Ea enim proident eiusmod in magna dolore exercitation qui non sit. Incididunt Lorem dolore qui ex anim anim laborum consequat elit sit. Id ea sit velit nulla in Lorem anim ex mollit quis eiusmod proident.\r\n",
        "time": 126.8009,
        "completed": true,
        "points": 93
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c259a1fe2698e73fe4",
        "description": "Nulla esse id proident culpa irure reprehenderit fugiat sit fugiat irure laborum duis do consectetur. Exercitation dolor nostrud ut eiusmod nulla. Duis cupidatat nulla ut laborum. Reprehenderit voluptate duis nulla irure elit veniam incididunt cupidatat aliqua. Pariatur officia exercitation quis et eu enim mollit in non velit. Elit fugiat exercitation sint labore fugiat Lorem elit culpa aliquip in fugiat irure nostrud. Aute commodo et non anim qui commodo fugiat culpa.\r\n",
        "time": 186.1763,
        "completed": true,
        "points": 90
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c2f30d0b28250e56f1",
        "description": "Culpa elit consequat do labore. Fugiat eiusmod consectetur dolor aute ex duis Lorem deserunt. Aute ullamco duis laboris tempor dolore proident pariatur irure velit aute quis occaecat do. Voluptate esse veniam eiusmod est esse eu dolore voluptate consequat labore. Sunt laborum voluptate ut qui sint fugiat pariatur et veniam. Ea qui enim nulla eu pariatur id elit dolor commodo sint pariatur.\r\n",
        "time": 112.9825,
        "completed": true,
        "points": 97
      },
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9f2c2018ace4c9a071c40",
        "description": "Excepteur cupidatat esse laborum sint nisi adipisicing ut officia. Ad minim dolore nostrud non non ex tempor pariatur Lorem labore eiusmod anim velit commodo. Minim labore excepteur enim sint ad eiusmod laborum aliqua ut eu. Minim dolore anim velit ut laborum eu. Adipisicing fugiat non sint aliquip cupidatat esse nulla non do culpa laboris nisi dolore. Incididunt fugiat mollit eiusmod laboris quis pariatur nisi proident cupidatat ex velit ea ipsum. Pariatur nisi in nostrud nisi amet adipisicing officia laboris velit dolore ad reprehenderit deserunt.\r\n",
        "time": 45.1555,
        "completed": true,
        "points": 12
      },
      {
        "name": "Parnell",
        "id": "64a9f2c2852e85b9ca448930",
        "description": "Ullamco ut et deserunt in et. Sit consectetur id sint reprehenderit et officia velit aute non Lorem. Eiusmod nulla esse enim duis culpa aute pariatur enim.\r\n",
        "time": 140.5047,
        "completed": true,
        "points": 79
      }
    ]
  },
  {
    "id": "64a9f2c2d937490182ebb958",
    "name": "Lina Mccullough",
    "steps": 28368,
    "location": {
      "latitude": -36.87336,
      "longitude": -185.2248
    },
    "quests": [
      {
        "name": "One Tree Hill",
        "id": "64a9f2c20d186664e807de8e",
        "description": "Reprehenderit mollit dolor ut ea officia deserunt amet esse irure deserunt. Labore incididunt enim nostrud cupidatat cillum nostrud esse quis reprehenderit ullamco. Est incididunt velit consequat nisi sint reprehenderit voluptate.\r\n",
        "time": 77.8671,
        "completed": true,
        "points": 86
      },
      {
        "name": "Takapuna",
        "id": "64a9f2c2763857f56b461772",
        "description": "Labore incididunt tempor est veniam est reprehenderit minim deserunt eiusmod occaecat commodo fugiat mollit. Duis occaecat cupidatat voluptate non aliquip occaecat aliquip officia voluptate. Mollit reprehenderit ex culpa pariatur laborum occaecat. Quis et ipsum laboris dolore ullamco proident aute incididunt occaecat irure. Et laborum amet non laboris laborum aute adipisicing et culpa exercitation adipisicing fugiat excepteur et. Culpa veniam nostrud eiusmod enim proident est duis eu excepteur consectetur deserunt officia labore quis.\r\n",
        "time": 187.3483,
        "completed": true,
        "points": 63
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2b7498aa4f4423b4d",
        "description": "Cupidatat proident anim anim irure ex velit in. Dolor aliquip eu laboris laborum commodo non proident eu dolore enim laboris do ullamco. Occaecat enim nostrud nulla elit eiusmod ut dolore quis duis enim id elit anim aliqua.\r\n",
        "time": 21.2116,
        "completed": true,
        "points": 16
      },
      {
        "name": "Devonport",
        "id": "64a9f2c2ec3ac4983da440b1",
        "description": "Consequat laborum veniam magna dolor velit eu enim aliquip. Elit officia ad deserunt sit ipsum veniam anim consequat aliqua magna aliquip laboris duis. Voluptate et reprehenderit pariatur anim. Cillum minim nisi aliquip consectetur sint et qui consequat incididunt eu. Culpa anim non sit proident anim non sit fugiat. Veniam ex consequat aliquip culpa magna.\r\n",
        "time": 140.2061,
        "completed": true,
        "points": 56
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c2dac9c79f11179f40",
        "description": "Irure cupidatat pariatur in veniam ad sint reprehenderit eiusmod reprehenderit proident. Ea cupidatat quis consectetur dolore. Proident commodo anim dolore adipisicing in aliqua eu labore ullamco enim est.\r\n",
        "time": 169.3981,
        "completed": true,
        "points": 14
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2cd32549c73f01924",
        "description": "Incididunt mollit magna excepteur exercitation anim qui. Ad adipisicing officia veniam elit ex tempor enim tempor tempor nulla do irure. Cillum amet occaecat commodo dolore pariatur nostrud consectetur do ea veniam excepteur velit sit consectetur. Reprehenderit aliqua dolore minim sint occaecat qui sit veniam commodo nostrud. Irure Lorem eu elit ad elit cillum sit velit mollit cupidatat aliqua ex dolor excepteur. Veniam reprehenderit tempor eu duis irure.\r\n",
        "time": 52.4752,
        "completed": true,
        "points": 44
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2bd3217bdae781cbc",
        "description": "Magna sint eu cillum culpa laboris veniam anim nostrud duis. Duis laboris nulla consequat consectetur sint duis aute. Occaecat in aliqua sunt laborum exercitation nisi ex cupidatat occaecat officia qui excepteur. Mollit id magna adipisicing proident velit est commodo. Nulla eu veniam amet esse dolor culpa amet labore consectetur dolore veniam consequat. Proident reprehenderit id tempor sint anim sit voluptate sunt veniam ex velit reprehenderit.\r\n",
        "time": 63.4798,
        "completed": true,
        "points": 82
      },
      {
        "name": "SkyCity Auckland",
        "id": "64a9f2c2f27adc54de193465",
        "description": "Mollit est nulla cillum laboris ipsum non nostrud tempor irure. Reprehenderit ullamco dolore nisi sunt incididunt aliqua. Magna amet sit id non ipsum eiusmod.\r\n",
        "time": 93.2815,
        "completed": true,
        "points": 92
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9f2c24c0fbda9473f57f8",
        "description": "Veniam id adipisicing ullamco deserunt ad laboris aliqua commodo reprehenderit aliquip mollit sunt ut occaecat. Qui magna ullamco non et minim esse labore aliqua voluptate enim non mollit. Ex sit laboris Lorem voluptate reprehenderit enim irure adipisicing elit aliqua ex.\r\n",
        "time": 64.9569,
        "completed": true,
        "points": 58
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c299f152900db6472e",
        "description": "Dolore excepteur laboris non cupidatat qui cupidatat occaecat minim non tempor. Aute excepteur quis ea aliquip ea ipsum ea adipisicing ad. Sit laborum enim et proident laborum enim quis labore ipsum eu. Reprehenderit eiusmod est eiusmod veniam non eiusmod do consectetur quis eu.\r\n",
        "time": 43.5109,
        "completed": true,
        "points": 23
      }
    ]
  },
  {
    "id": "64a9f2c2f560f805428a5bd1",
    "name": "Regina Church",
    "steps": 35088,
    "location": {
      "latitude": -36.87288,
      "longitude": -185.21747
    },
    "quests": [
      {
        "name": "Cornwall Park",
        "id": "64a9f2c2c97ce29594c18f4e",
        "description": "Cupidatat cillum cillum nisi elit est velit qui qui aliquip laborum ullamco sit amet dolore. Mollit dolore sunt commodo deserunt velit qui aliqua. Aute enim laboris amet cillum sit ut culpa est et cupidatat do. Occaecat id sint veniam nostrud sit excepteur quis.\r\n",
        "time": 152.256,
        "completed": true,
        "points": 47
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c29b3a1c7ba2517f15",
        "description": "Officia do aliquip id culpa duis. Elit aliquip non ut proident est excepteur ea deserunt eiusmod aliquip non tempor proident veniam. Laboris mollit commodo aute ipsum anim duis anim ullamco dolore laborum culpa dolor nulla qui. Laboris in laboris sunt tempor reprehenderit ex excepteur elit. Excepteur tempor nostrud ea enim ad eiusmod excepteur et voluptate sunt cupidatat consectetur nisi proident. Esse mollit nisi dolor voluptate ex culpa Lorem ad tempor.\r\n",
        "time": 119.6283,
        "completed": true,
        "points": 65
      },
      {
        "name": "Mount Eden",
        "id": "64a9f2c22a21c7aafea438f2",
        "description": "Reprehenderit qui laborum id occaecat ullamco. Occaecat sit esse amet ullamco dolore adipisicing cillum aliquip ipsum ut incididunt ut proident. Consectetur laboris laboris occaecat id nostrud nisi amet. Ad sunt aliqua cupidatat cupidatat do quis cupidatat proident. Do cillum mollit pariatur sunt. Nostrud cillum aliqua anim eu fugiat veniam excepteur. Amet ipsum laborum dolore ipsum mollit.\r\n",
        "time": 50.8201,
        "completed": true,
        "points": 68
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c2bebe0d702e21f4f3",
        "description": "Minim laboris et voluptate commodo do consequat enim laboris sint magna nulla minim labore. Tempor mollit consequat ullamco ipsum aliquip. Enim dolore esse velit cupidatat proident duis mollit eu laboris aliqua. Enim quis cillum commodo commodo dolore ad culpa.\r\n",
        "time": 89.6264,
        "completed": true,
        "points": 48
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c287552a4c594d26b9",
        "description": "Eiusmod ad id velit in velit eiusmod exercitation duis dolore quis dolor duis cupidatat. Aute et dolore amet ullamco. Dolor laborum incididunt sit consequat velit do eu. Do minim id id nisi anim.\r\n",
        "time": 100.0303,
        "completed": true,
        "points": 17
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2deb11edfd1f4fe26",
        "description": "Sit commodo dolore voluptate ea voluptate aliqua exercitation ut officia consequat est. Ullamco velit ad consequat minim voluptate laboris id nulla ex elit qui anim tempor. Amet incididunt veniam voluptate duis tempor. Et tempor ut proident eu aute aliqua mollit labore fugiat sit laborum eu enim qui. Reprehenderit sunt enim ullamco id ad excepteur duis. Do minim id irure magna ullamco.\r\n",
        "time": 155.001,
        "completed": true,
        "points": 56
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c2a8ac7dc735f4927c",
        "description": "Consequat fugiat culpa veniam exercitation sit eiusmod non cupidatat dolor. Velit in excepteur quis anim sint elit et veniam. Voluptate in tempor laboris fugiat irure in mollit. In officia cillum Lorem velit pariatur. Veniam incididunt sunt laborum laborum incididunt culpa. Reprehenderit id laborum id est enim minim minim aliqua occaecat nostrud culpa nisi eiusmod. Labore reprehenderit in aliquip consectetur.\r\n",
        "time": 17.0531,
        "completed": true,
        "points": 25
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c22682d41fa5360137",
        "description": "Excepteur aliqua ullamco eu minim reprehenderit. Amet ipsum aliquip Lorem officia occaecat voluptate. Sunt exercitation laborum cupidatat anim deserunt occaecat ut exercitation aliqua Lorem velit eiusmod cillum. Irure ex tempor tempor irure ad deserunt cupidatat magna esse sint. Do minim aute aliquip veniam duis in deserunt et sint consequat reprehenderit pariatur. Pariatur adipisicing anim exercitation ullamco ullamco velit.\r\n",
        "time": 87.1506,
        "completed": true,
        "points": 90
      }
    ]
  },
  {
    "id": "64a9f2c2dacf515f05af652f",
    "name": "Stuart Washington",
    "steps": 96739,
    "location": {
      "latitude": -36.88625,
      "longitude": -185.21085
    },
    "quests": [
      {
        "name": "Silo Park",
        "id": "64a9f2c26a6cfe5d84580624",
        "description": "Quis consequat id occaecat aliquip in deserunt cupidatat deserunt sunt nostrud. Laboris ex esse eu occaecat. Voluptate ea et ipsum sint minim. Ut commodo anim amet dolore deserunt eu labore ut in amet irure id. Cupidatat cupidatat do ullamco ipsum. Nostrud occaecat sunt ea qui minim mollit nisi officia id ex in amet. Aute non ullamco id reprehenderit dolore magna irure pariatur qui eiusmod proident et dolore nisi.\r\n",
        "time": 21.9109,
        "completed": true,
        "points": 97
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c23fa1d669969b26ae",
        "description": "Consequat labore magna pariatur dolor tempor ut quis. Duis ex cupidatat excepteur consectetur ut. Minim velit nulla amet in sit ullamco incididunt do veniam officia nisi in ea enim. Ut esse est ullamco amet commodo cupidatat reprehenderit. Consectetur nostrud magna magna ex incididunt nostrud amet aliqua veniam incididunt occaecat veniam do.\r\n",
        "time": 12.8117,
        "completed": true,
        "points": 35
      },
      {
        "name": "Bethells Beach",
        "id": "64a9f2c226bcd49981bb4ac0",
        "description": "Eiusmod Lorem dolor mollit nulla et nostrud cillum. Qui incididunt fugiat minim eu ipsum quis pariatur et do irure sit pariatur est. Dolor consectetur eiusmod et pariatur Lorem aliqua. Aliquip eiusmod voluptate cillum incididunt elit ea do exercitation sit in. Aliqua ea amet sint cupidatat deserunt. In incididunt sint quis amet voluptate eu consequat est ad ut consectetur excepteur qui eu.\r\n",
        "time": 80.7546,
        "completed": true,
        "points": 76
      },
      {
        "name": "Waiheke Island",
        "id": "64a9f2c2ff3cc3e4d3be3c0c",
        "description": "Et amet mollit dolor voluptate do eiusmod ea. Velit adipisicing laborum anim eu. Dolor proident aute enim sit. Dolor in ad ex laboris aliquip cillum est adipisicing qui nulla.\r\n",
        "time": 51.7389,
        "completed": true,
        "points": 23
      },
      {
        "name": "Eden Park",
        "id": "64a9f2c2cc8fd7915b9eb7f4",
        "description": "Cillum qui consequat nisi est aute. Eiusmod adipisicing aliquip pariatur et quis laborum deserunt ipsum eiusmod ex id fugiat nisi ipsum. Enim ad sit laboris est exercitation. Laboris dolore pariatur laborum eu occaecat duis consectetur. Ad qui et ad in nostrud pariatur id est mollit amet voluptate proident.\r\n",
        "time": 23.8476,
        "completed": true,
        "points": 16
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c222e06cf0ec67783e",
        "description": "Irure dolore aute nisi magna enim enim deserunt ea ullamco. Laboris nostrud in irure nulla labore nostrud do nulla ex. Adipisicing do dolore est cillum reprehenderit proident cupidatat fugiat Lorem nostrud velit cillum sit. Proident sunt non nisi proident ut id. Elit consequat do laborum labore sit consequat. Aute cupidatat deserunt Lorem cillum consectetur magna officia dolore tempor elit adipisicing ea aliqua.\r\n",
        "time": 129.3275,
        "completed": true,
        "points": 44
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c2f655a0dde3188042",
        "description": "Ut ex fugiat irure esse occaecat deserunt laboris dolor velit cupidatat. Velit cupidatat in proident anim officia irure amet ea veniam nisi culpa minim. Cupidatat aliqua elit minim velit elit non mollit ea voluptate officia est. Officia id velit quis et occaecat exercitation.\r\n",
        "time": 122.9678,
        "completed": true,
        "points": 64
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c20a30bebe7b3a480c",
        "description": "Veniam proident laborum non dolore aliquip deserunt. Mollit consectetur duis ex pariatur anim. Ipsum cillum officia adipisicing dolor elit. Dolor amet ad culpa nulla sunt veniam esse culpa. Enim ea velit sit deserunt cupidatat aute.\r\n",
        "time": 115.9881,
        "completed": true,
        "points": 62
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c29c87a6bffa6168ef",
        "description": "Incididunt aute ad ipsum ad sit et non exercitation dolore est eu laborum anim ex. Exercitation voluptate aliqua sit enim id Lorem et mollit quis voluptate consectetur. Eu culpa officia ipsum sint deserunt enim sunt laboris minim in exercitation incididunt voluptate. Culpa velit sit non sint eiusmod irure adipisicing reprehenderit do dolor. Occaecat excepteur consequat aute irure nisi.\r\n",
        "time": 185.8797,
        "completed": true,
        "points": 12
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c242a14a37650189b2",
        "description": "Id dolor elit nulla aute qui non laboris amet reprehenderit velit qui Lorem amet. Dolor laborum minim dolor aliqua. Ut excepteur in dolor amet exercitation cillum. Nulla do dolore sit amet officia est est nisi. Quis id enim dolore minim quis eu excepteur do laborum ad voluptate eiusmod. Non et proident ullamco ullamco duis cillum dolor irure eiusmod eiusmod officia incididunt occaecat amet. Commodo minim Lorem consequat reprehenderit eiusmod nisi irure cupidatat quis cillum labore.\r\n",
        "time": 97.8542,
        "completed": true,
        "points": 14
      }
    ]
  },
  {
    "id": "64a9f2c2ddd949fe63fb4840",
    "name": "Dawn Santos",
    "steps": 24093,
    "location": {
      "latitude": -36.88421,
      "longitude": -185.2175
    },
    "quests": [
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c22841cc0159ad1e93",
        "description": "Veniam dolor dolore id magna ea eiusmod elit. Minim amet proident ullamco commodo cillum dolor proident. Esse velit consectetur laboris cillum et anim aliqua esse et laborum mollit voluptate. Deserunt ea laborum veniam proident non laborum commodo nisi cupidatat cupidatat do nisi occaecat commodo. Aliquip dolore cillum aute aliqua excepteur tempor.\r\n",
        "time": 146.6076,
        "completed": true,
        "points": 53
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c279d96495c5d2bcc3",
        "description": "Magna ut culpa exercitation aliqua cillum officia aute Lorem irure et aliquip quis. Laborum irure aliqua deserunt labore fugiat esse eiusmod. Reprehenderit sunt est culpa sint commodo duis ad commodo dolore. Aliquip veniam duis non reprehenderit enim voluptate.\r\n",
        "time": 80.5067,
        "completed": true,
        "points": 74
      },
      {
        "name": "Matakana",
        "id": "64a9f2c248c038a1b51bae97",
        "description": "Id ut exercitation aliqua eiusmod excepteur eiusmod aliqua irure fugiat enim et exercitation. Pariatur pariatur ut incididunt sint. Sit id cupidatat excepteur ad aliquip reprehenderit aliqua ex laborum. Consequat aliquip culpa cupidatat reprehenderit anim. Labore eiusmod aute officia sint. Irure exercitation duis est sit et.\r\n",
        "time": 72.1768,
        "completed": true,
        "points": 52
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c218720a003ace1990",
        "description": "Aute Lorem mollit sunt aute laborum nulla sit sit consequat in tempor cillum. Excepteur sit veniam occaecat magna consectetur do culpa dolor tempor. Ex esse esse sit laborum. Enim dolor sunt irure eu officia incididunt excepteur elit voluptate. Et quis esse est nostrud. Exercitation in enim fugiat incididunt voluptate et sint minim amet. Et amet consequat consequat ullamco dolore tempor et.\r\n",
        "time": 22.1026,
        "completed": true,
        "points": 94
      },
      {
        "name": "Silo Park",
        "id": "64a9f2c256636c8ed86fb728",
        "description": "Aliquip est id consequat mollit deserunt eu anim dolor veniam sunt reprehenderit. Est id veniam sint eiusmod velit deserunt amet aute nisi ut reprehenderit excepteur. Ut aliquip labore sit culpa ex commodo sunt enim. Laboris non qui est sint amet id ullamco commodo ut Lorem esse. Laboris mollit sit Lorem ea. Velit adipisicing ullamco sint dolor aute aliqua ullamco.\r\n",
        "time": 121.4176,
        "completed": true,
        "points": 77
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9f2c2561b58560f60d2fa",
        "description": "Magna sit in sint enim reprehenderit officia cupidatat non ad ut nulla labore. Est culpa exercitation eiusmod irure mollit sint ea qui quis aliqua exercitation mollit anim ex. Elit tempor consequat excepteur sunt in ullamco cillum non cillum. Sunt dolore non eu amet incididunt mollit deserunt minim. Anim excepteur est commodo aliqua do commodo do nisi excepteur.\r\n",
        "time": 102.6809,
        "completed": true,
        "points": 76
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c22eb7552f3580838f",
        "description": "Eu velit adipisicing nulla dolore ea anim dolor. Proident nisi elit tempor occaecat ad Lorem minim aute aliqua fugiat ad in qui et. Culpa cupidatat voluptate duis do anim velit id. Occaecat culpa officia exercitation voluptate enim fugiat qui voluptate do. Est aliqua dolor incididunt in ad ex.\r\n",
        "time": 41.4341,
        "completed": true,
        "points": 58
      },
      {
        "name": "Karekare Beach",
        "id": "64a9f2c2dfa9f40f2a31ae6f",
        "description": "Ut minim non consequat tempor elit quis. Dolore labore deserunt velit cupidatat consequat qui eu elit dolore. Adipisicing ipsum nostrud occaecat fugiat Lorem.\r\n",
        "time": 9.0395,
        "completed": true,
        "points": 71
      }
    ]
  },
  {
    "id": "64a9f2c222ec8d310a322012",
    "name": "Julianne Fleming",
    "steps": 83813,
    "location": {
      "latitude": -36.8781,
      "longitude": -185.23745
    },
    "quests": [
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2705808eae6cd1875",
        "description": "Voluptate fugiat minim dolore elit ea occaecat esse. Commodo est velit officia sit aliquip nostrud. Cupidatat sit irure qui cillum voluptate officia pariatur enim proident irure nisi culpa sit duis. Est exercitation exercitation ad laboris incididunt incididunt cupidatat deserunt anim. Proident do laborum ullamco cupidatat reprehenderit mollit sit enim eu minim dolore. Aute tempor amet consequat sint cupidatat commodo voluptate nisi.\r\n",
        "time": 2.5338,
        "completed": true,
        "points": 36
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c21dd5771c6e65bec7",
        "description": "Consectetur dolor nulla quis proident tempor ad ullamco nisi velit. Commodo aute et elit do occaecat ut. Minim elit voluptate proident ad sint laborum exercitation. Velit eiusmod laborum amet proident sunt laborum minim sint ut veniam sint.\r\n",
        "time": 75.8788,
        "completed": true,
        "points": 60
      },
      {
        "name": "Tawharanui Regional Park",
        "id": "64a9f2c24ccd803a58afbb32",
        "description": "Id pariatur culpa proident ullamco culpa amet aute deserunt officia. Aliqua ex voluptate tempor ad ut nulla aute quis elit est. Adipisicing veniam non esse ad dolore. Mollit veniam consequat ex duis. Mollit eu dolor dolor exercitation laboris magna. Labore duis reprehenderit ullamco sit irure consequat duis sunt sunt fugiat ipsum nisi. Quis voluptate nostrud eiusmod deserunt nostrud ullamco adipisicing pariatur irure culpa velit ullamco cupidatat sit.\r\n",
        "time": 189.3463,
        "completed": true,
        "points": 89
      },
      {
        "name": "Orewa Beach",
        "id": "64a9f2c230fcf1f40338a17e",
        "description": "Sint culpa est ad velit deserunt proident culpa eiusmod aute duis. Eu qui ad non duis consequat dolore laboris non irure excepteur non. Occaecat elit velit culpa nulla elit esse excepteur id pariatur labore Lorem consequat laboris. Officia est reprehenderit non in eu ex proident Lorem deserunt. Proident consectetur labore anim esse incididunt. Occaecat exercitation duis nisi pariatur consequat laboris ea velit in est. Sint eiusmod incididunt irure aliquip nisi qui cupidatat cupidatat dolor tempor aliqua sit do mollit.\r\n",
        "time": 85.1429,
        "completed": true,
        "points": 51
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c2dab1671d0b1e225e",
        "description": "Ut officia culpa sit anim veniam deserunt consequat ut ex. Ut incididunt ad magna eu eu duis sit exercitation. Fugiat et ad dolor consequat id aute est cillum proident qui mollit occaecat. Aliqua do excepteur aliqua tempor consequat dolor sint et voluptate excepteur commodo officia sint. Nostrud reprehenderit tempor cillum cupidatat aliquip magna et aliqua pariatur commodo laboris veniam cillum elit. Sit aliqua labore pariatur incididunt proident ea cillum deserunt. In aute ad velit ad cupidatat irure ut cillum adipisicing ea.\r\n",
        "time": 179.7091,
        "completed": true,
        "points": 82
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9f2c2323b32bae84184a5",
        "description": "Velit proident minim irure aliquip et. Ea adipisicing aliqua irure sit. Aliquip adipisicing magna aute ullamco qui proident nulla fugiat labore mollit ut. Proident cillum sint irure minim ullamco. Voluptate nostrud magna amet esse incididunt amet. Nostrud est quis qui nulla amet sunt quis ad culpa ipsum do ullamco adipisicing excepteur.\r\n",
        "time": 71.1649,
        "completed": true,
        "points": 75
      },
      {
        "name": "Eden Park",
        "id": "64a9f2c294a64018e9f7863e",
        "description": "Nostrud adipisicing laboris irure tempor dolor. Sint fugiat aliqua consectetur tempor. Exercitation magna ut minim ut in duis laborum ut velit culpa laborum. Tempor est pariatur exercitation sit ad voluptate ex proident. Laborum velit quis do velit laborum veniam reprehenderit qui commodo. Elit Lorem Lorem dolor in pariatur ipsum aute pariatur commodo eiusmod proident veniam deserunt dolor.\r\n",
        "time": 164.0579,
        "completed": true,
        "points": 25
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c2730f0064c0ab778a",
        "description": "Tempor ad laboris excepteur deserunt tempor mollit reprehenderit qui adipisicing fugiat irure. Dolor do est mollit officia cillum nisi. Eiusmod non commodo reprehenderit amet.\r\n",
        "time": 75.8483,
        "completed": true,
        "points": 59
      }
    ]
  },
  {
    "id": "64a9f2c28a0c40a0c0d9a757",
    "name": "Krystal Lynch",
    "steps": 28240,
    "location": {
      "latitude": -36.87945,
      "longitude": -185.27022
    },
    "quests": [
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c2e04ba92b4fa6d430",
        "description": "Sit et cupidatat exercitation Lorem enim tempor labore sit anim exercitation do ullamco labore minim. Esse et quis elit duis sint duis consequat elit adipisicing do ea minim. Ut minim dolore consequat elit aliqua nulla sit eu. Cillum reprehenderit labore aliquip enim duis incididunt esse labore nulla eu. Officia irure sint nulla exercitation laborum cillum incididunt aliquip eu occaecat anim est. Ea veniam ex aliquip laborum tempor duis fugiat commodo velit labore dolor dolore deserunt fugiat. Dolor adipisicing proident magna elit cupidatat esse elit consequat dolore aute minim commodo.\r\n",
        "time": 60.2874,
        "completed": true,
        "points": 45
      },
      {
        "name": "Eden Park",
        "id": "64a9f2c212d0918ead56c149",
        "description": "Laboris tempor do aliquip cillum officia proident. Minim est nulla proident proident officia ut. Eu deserunt sit incididunt labore do. Id adipisicing cupidatat aute excepteur aute et ipsum tempor fugiat aute Lorem. Dolor nulla irure id sint laboris deserunt in consequat proident dolor pariatur sint. Est fugiat irure reprehenderit velit in in pariatur exercitation ea non eu aliqua commodo amet.\r\n",
        "time": 93.925,
        "completed": true,
        "points": 76
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c279ca497bfee46293",
        "description": "Laboris aute Lorem et quis excepteur incididunt ex. Culpa sint tempor officia magna eiusmod sint. Ex aliquip aute duis tempor aute sunt qui cillum veniam consequat esse. Sunt proident minim esse laboris proident ut sint nostrud ad. Sunt incididunt ipsum est amet minim pariatur dolore fugiat nisi culpa cupidatat sint.\r\n",
        "time": 11.7036,
        "completed": true,
        "points": 22
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c28936affdde7d28ec",
        "description": "Incididunt sint quis pariatur proident labore qui occaecat magna irure aliqua. Culpa voluptate incididunt ea exercitation sit id ea. Fugiat commodo culpa ex commodo. Excepteur voluptate amet cupidatat magna quis sint ipsum exercitation.\r\n",
        "time": 104.9618,
        "completed": true,
        "points": 68
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9f2c2e03d97f116131f8e",
        "description": "Dolor dolore magna esse sint laborum nisi commodo ea reprehenderit proident est aute sint. Excepteur reprehenderit consectetur proident enim veniam. Esse ea culpa cillum consectetur consectetur dolor nisi aute fugiat. Non id fugiat velit ex laborum excepteur eiusmod amet occaecat elit veniam culpa commodo sit.\r\n",
        "time": 198.0996,
        "completed": true,
        "points": 75
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c2c9a77b330c24a9d4",
        "description": "Id est ea ipsum veniam deserunt sit aute nulla adipisicing anim. Minim minim ut nostrud ut laboris sunt fugiat id culpa. Tempor elit aliqua in veniam esse commodo Lorem adipisicing. Culpa ad cupidatat do amet adipisicing cillum ullamco sit id ea mollit consectetur nisi. Nostrud laborum velit proident ad incididunt eu elit proident aliqua eiusmod qui laboris qui. Quis cillum qui quis adipisicing labore elit consectetur deserunt cupidatat ad enim velit.\r\n",
        "time": 111.404,
        "completed": true,
        "points": 40
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c20b365e8716ade1e2",
        "description": "Do esse officia enim exercitation adipisicing non velit adipisicing dolore. Voluptate ex non labore cillum qui aliqua ipsum consequat. Anim ipsum et aliqua sit consequat labore duis occaecat qui aliquip. Et labore veniam non est elit dolor minim exercitation aliqua ex sit commodo tempor.\r\n",
        "time": 107.1828,
        "completed": true,
        "points": 51
      },
      {
        "name": "Piha Beach",
        "id": "64a9f2c28bbc763e87ae84c2",
        "description": "Pariatur cupidatat cillum minim incididunt ad veniam aliquip minim nulla aliqua ullamco duis irure qui. Qui occaecat magna laboris est reprehenderit sint non elit sint eu minim. Aute sunt nisi adipisicing amet magna fugiat et officia ad culpa adipisicing fugiat. Minim dolore pariatur proident nisi. Non minim sunt mollit in est sunt duis veniam cupidatat do culpa eiusmod in mollit.\r\n",
        "time": 186.5901,
        "completed": true,
        "points": 31
      }
    ]
  },
  {
    "id": "64a9f2c2ecc9b49247c41fd9",
    "name": "Curtis Stout",
    "steps": 25587,
    "location": {
      "latitude": -36.8874,
      "longitude": -185.21759
    },
    "quests": [
      {
        "name": "Otara Market",
        "id": "64a9f2c28327913b4784dde5",
        "description": "Nulla aute dolore aliqua veniam non fugiat fugiat. Proident dolor in ex officia velit non est aute. Lorem veniam aliquip amet labore reprehenderit nostrud incididunt mollit aute nostrud non.\r\n",
        "time": 86.6705,
        "completed": true,
        "points": 35
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9f2c2e20f780493e87b60",
        "description": "Lorem nostrud veniam irure occaecat in. Ut reprehenderit tempor adipisicing aliquip sit ut anim excepteur laborum eiusmod. Incididunt amet cupidatat nulla officia deserunt nostrud. Ipsum irure Lorem anim sint. Commodo enim quis labore proident do aliqua est commodo dolore enim. Nostrud laboris aute qui do minim velit.\r\n",
        "time": 0.1559,
        "completed": true,
        "points": 75
      },
      {
        "name": "Silo Park",
        "id": "64a9f2c238d00989dd7c001b",
        "description": "Voluptate aliquip pariatur labore laborum quis. Reprehenderit nulla eu magna sint. Enim ullamco eiusmod quis aliqua enim Lorem exercitation non laboris in et mollit. Ipsum occaecat pariatur duis aliqua aliquip. Ex sint ipsum velit dolore excepteur duis.\r\n",
        "time": 192.5502,
        "completed": true,
        "points": 22
      },
      {
        "name": "Takapuna",
        "id": "64a9f2c2fb7b6850159c95c0",
        "description": "Amet enim eiusmod reprehenderit enim sit eu culpa. Nisi nostrud voluptate elit qui aliquip et ut deserunt mollit proident. Enim incididunt dolor aliqua cupidatat irure excepteur tempor. Non incididunt exercitation ipsum dolore nostrud minim nostrud incididunt commodo excepteur ut.\r\n",
        "time": 182.5987,
        "completed": true,
        "points": 41
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2ebeeace4a801d27d",
        "description": "Excepteur aliquip pariatur ex magna commodo aliqua voluptate nostrud sunt quis consectetur nisi. Adipisicing aliquip nisi dolor Lorem in. Cupidatat id ut aliquip ut. Ullamco irure anim aliquip eu incididunt nostrud in officia aute nulla dolor. Nostrud anim reprehenderit adipisicing aute. Qui occaecat qui qui excepteur sint duis laboris eu exercitation tempor occaecat quis elit nisi.\r\n",
        "time": 66.9491,
        "completed": true,
        "points": 15
      },
      {
        "name": "Matakana",
        "id": "64a9f2c2b3859adda3cc4fdb",
        "description": "Pariatur mollit amet mollit id sunt amet incididunt. Laboris ipsum officia nulla irure. Aliqua veniam culpa pariatur culpa amet ullamco nisi officia enim. Duis officia sit sunt aliquip minim anim ea consequat elit proident duis irure. Sunt velit anim ex nisi ipsum. Ut nisi excepteur ea culpa amet non cupidatat est aliqua. Qui aute ad exercitation magna anim officia enim ipsum officia velit.\r\n",
        "time": 142.1354,
        "completed": true,
        "points": 49
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c26fb54081433d43a0",
        "description": "Laboris nisi deserunt voluptate culpa proident ad. Do id aute id mollit. Cillum sit et laboris voluptate. Do ad mollit ex consectetur aliqua ullamco id.\r\n",
        "time": 189.0654,
        "completed": true,
        "points": 54
      },
      {
        "name": "Takapuna",
        "id": "64a9f2c24d9bfdb5c60dc800",
        "description": "Officia cupidatat quis Lorem nulla proident enim irure ullamco duis incididunt ea. Eiusmod sunt cupidatat occaecat nisi reprehenderit. Eiusmod anim quis tempor enim aliquip commodo aute esse consectetur nostrud quis nulla eiusmod. Laboris incididunt ea cupidatat voluptate elit laboris anim. Tempor quis ut nulla culpa proident nostrud pariatur velit ad sunt est. Est sunt cillum consequat ea excepteur adipisicing consectetur fugiat minim nisi.\r\n",
        "time": 49.0546,
        "completed": true,
        "points": 85
      },
      {
        "name": "Auckland Town Hall",
        "id": "64a9f2c2affe5ce7ce13ff1d",
        "description": "Ullamco magna voluptate Lorem ut consequat laborum magna laborum consequat elit minim. Non ad ut reprehenderit fugiat exercitation culpa aute occaecat aliqua occaecat mollit esse. Velit officia tempor nostrud magna anim. Ea tempor nulla eiusmod Lorem fugiat tempor et ullamco non ut laborum non nisi adipisicing. Elit occaecat quis reprehenderit excepteur irure.\r\n",
        "time": 197.6964,
        "completed": true,
        "points": 87
      },
      {
        "name": "Aotea Square",
        "id": "64a9f2c2afec672ed9b32dc1",
        "description": "Aliqua qui ad pariatur nostrud excepteur esse enim ea Lorem nisi et. Officia sint occaecat qui sit. Anim nisi do velit dolore amet minim proident aliqua ex quis. In reprehenderit elit nisi id pariatur eiusmod ad. Deserunt Lorem in labore cillum id non consequat minim aute. Deserunt ex pariatur aliqua occaecat in reprehenderit amet sunt adipisicing aliquip culpa adipisicing eu.\r\n",
        "time": 170.8296,
        "completed": true,
        "points": 91
      }
    ]
  },
  {
    "id": "64a9f2c2e5b76b1969c7ad0b",
    "name": "Jolene Roberts",
    "steps": 4591,
    "location": {
      "latitude": -36.8763,
      "longitude": -185.20347
    },
    "quests": [
      {
        "name": "Western Springs",
        "id": "64a9f2c2ad9c213ea0bb33d1",
        "description": "Cillum quis nostrud deserunt reprehenderit consequat. Anim nisi Lorem mollit consequat consectetur mollit. Enim laborum aute adipisicing magna occaecat sint elit laborum sit. Pariatur irure pariatur Lorem ipsum consectetur minim commodo eiusmod dolor excepteur ullamco. Dolore Lorem quis ea velit tempor deserunt ut commodo. Voluptate culpa tempor voluptate adipisicing deserunt duis duis proident officia.\r\n",
        "time": 42.5529,
        "completed": true,
        "points": 27
      },
      {
        "name": "Auckland Museum",
        "id": "64a9f2c2956f072202379ff9",
        "description": "Nisi cupidatat ex velit magna sunt minim excepteur excepteur. Mollit occaecat amet voluptate excepteur. In laboris id laboris pariatur sint commodo adipisicing. Ullamco tempor amet commodo ad. Excepteur eiusmod ex sit enim. Qui nostrud eu laboris pariatur aliquip culpa officia non ad ullamco ut aliqua ad.\r\n",
        "time": 131.3942,
        "completed": true,
        "points": 10
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c277abae9cea026876",
        "description": "Incididunt sunt consectetur eu occaecat sunt nulla deserunt velit. Ut cillum officia esse ullamco sit cillum consectetur consequat quis veniam laboris sunt. Reprehenderit tempor non do dolore.\r\n",
        "time": 5.7932,
        "completed": true,
        "points": 13
      },
      {
        "name": "Silo Park",
        "id": "64a9f2c293424b9298e2919e",
        "description": "Consequat eu occaecat cillum fugiat quis. Occaecat nisi do ex consectetur Lorem exercitation pariatur enim laborum culpa. Dolore velit cillum ea do culpa magna laboris enim elit velit duis et. Eu exercitation consequat do deserunt eiusmod elit. Dolor duis pariatur esse cupidatat fugiat minim sit mollit ipsum cillum elit deserunt incididunt proident. Laborum adipisicing eiusmod cupidatat elit quis est est duis cupidatat occaecat sit.\r\n",
        "time": 57.5218,
        "completed": true,
        "points": 84
      },
      {
        "name": "Waiheke Island",
        "id": "64a9f2c2dc833a08c5956f0f",
        "description": "Consequat exercitation amet occaecat voluptate duis enim proident reprehenderit. Ad ad dolor eiusmod adipisicing occaecat incididunt consequat ut id magna est. Nostrud fugiat veniam cupidatat ipsum aliquip. Officia elit ullamco sit amet ex exercitation Lorem quis elit laborum. Ut voluptate culpa proident elit ipsum est. Aute mollit cillum ullamco consectetur. Magna labore in in ut exercitation.\r\n",
        "time": 37.2388,
        "completed": true,
        "points": 62
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c2b5332a1b02744a75",
        "description": "Minim eiusmod tempor ad dolor reprehenderit proident mollit reprehenderit ea. In elit consequat officia ut. Esse mollit quis minim pariatur fugiat velit officia. Et dolore esse pariatur id tempor irure ex reprehenderit culpa. Ad exercitation ut ex eiusmod cillum deserunt quis ea ea id non reprehenderit. Incididunt aliquip eu duis Lorem adipisicing in ea adipisicing.\r\n",
        "time": 179.5306,
        "completed": true,
        "points": 56
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c23807b631cf6adad5",
        "description": "In duis ad consequat exercitation deserunt excepteur minim proident voluptate ea anim culpa esse Lorem. Esse ex duis officia do. Amet dolore aliqua amet velit eiusmod in officia officia do do laborum. Deserunt incididunt sit incididunt cillum officia. Pariatur sunt cupidatat id nostrud officia ea nulla minim irure nulla nulla exercitation. Mollit nulla culpa occaecat ut eiusmod cillum dolore velit enim cillum cillum eu fugiat et. Aliqua sunt fugiat velit esse do quis occaecat officia et consectetur.\r\n",
        "time": 7.5917,
        "completed": true,
        "points": 28
      },
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9f2c247b28482f899fb2c",
        "description": "Duis duis minim dolore aute labore dolor. Qui minim qui ea aliqua aute veniam. Excepteur exercitation eu irure non sit commodo Lorem voluptate ad excepteur. Occaecat enim dolor est nostrud eiusmod nisi commodo amet est. Ea velit velit ullamco eiusmod laborum proident.\r\n",
        "time": 62.3407,
        "completed": true,
        "points": 54
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9f2c2ea8686e9809a39de",
        "description": "Sit do veniam occaecat exercitation esse nulla exercitation commodo. Enim culpa est occaecat amet in laborum sint do labore in cillum anim nulla. Commodo aliquip exercitation fugiat id eiusmod duis anim tempor enim culpa anim aliquip mollit minim. Commodo deserunt ipsum labore ex enim culpa duis Lorem. In ullamco adipisicing ex consequat veniam sint exercitation laborum. Qui excepteur minim velit esse ex eu id veniam et veniam. In ut laboris elit culpa ullamco excepteur.\r\n",
        "time": 69.8858,
        "completed": true,
        "points": 95
      },
      {
        "name": "Piha Beach",
        "id": "64a9f2c262f201d3daa7d732",
        "description": "Exercitation nisi adipisicing adipisicing magna Lorem officia commodo labore. Reprehenderit minim amet dolore eiusmod duis velit ullamco incididunt eiusmod. Culpa officia excepteur do cillum duis culpa. Nisi ad ullamco deserunt cupidatat sunt nostrud duis labore sit sit incididunt aliquip reprehenderit. Sit labore non ea deserunt dolore adipisicing consequat aliquip.\r\n",
        "time": 130.1781,
        "completed": true,
        "points": 44
      }
    ]
  },
  {
    "id": "64a9f2c2d76179bd49d42075",
    "name": "Kim Mullen",
    "steps": 25567,
    "location": {
      "latitude": -36.89599,
      "longitude": -185.21233
    },
    "quests": [
      {
        "name": "Queen Street",
        "id": "64a9f2c2c12347312baba711",
        "description": "Ad sunt adipisicing occaecat qui adipisicing. Laboris est minim magna labore officia. Laboris do adipisicing amet laboris. Minim quis sunt aliquip magna nostrud esse irure labore. Amet exercitation adipisicing id nulla ad aliquip culpa duis nisi amet sit sit aliquip.\r\n",
        "time": 39.3564,
        "completed": true,
        "points": 86
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c2b064047a31b5055c",
        "description": "Fugiat incididunt tempor nostrud ipsum cillum quis cillum. Sunt commodo tempor nisi esse duis eiusmod. Consectetur cupidatat cillum exercitation laborum do esse amet in est officia. Pariatur nostrud id sit dolore. Amet magna aliqua id consequat eu aliquip irure exercitation quis aute esse sint id. Id occaecat sunt eiusmod tempor dolore commodo sit.\r\n",
        "time": 35.6727,
        "completed": true,
        "points": 15
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c2352ab07026b91e12",
        "description": "Consequat quis ex aliqua occaecat eiusmod nostrud ad consequat duis est qui. Et aute veniam fugiat sint nulla incididunt qui pariatur occaecat eu exercitation pariatur esse adipisicing. Tempor anim aliquip labore consectetur ullamco sunt excepteur mollit anim dolor officia ea. Nisi consectetur tempor occaecat excepteur magna non laborum quis velit adipisicing non.\r\n",
        "time": 36.351,
        "completed": true,
        "points": 63
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c216273994222a5d36",
        "description": "Ipsum veniam commodo culpa incididunt velit nisi laboris adipisicing proident cupidatat commodo anim. Laboris mollit exercitation deserunt quis laboris incididunt exercitation esse quis cillum pariatur cupidatat. Et commodo nisi mollit enim quis veniam officia in aliquip cupidatat Lorem labore duis. Non qui dolor duis elit qui Lorem ut est culpa nostrud ullamco quis incididunt. Occaecat eu quis aliqua eiusmod Lorem nostrud.\r\n",
        "time": 9.7856,
        "completed": true,
        "points": 15
      },
      {
        "name": "Wynyard Quarter",
        "id": "64a9f2c26a6b19de7173c3fc",
        "description": "Sint culpa in incididunt enim laborum in. Tempor pariatur ut dolor sit. Exercitation ex non reprehenderit amet cillum tempor nostrud est consequat occaecat minim fugiat. Reprehenderit minim et minim est ullamco ea esse. Non commodo anim excepteur aute fugiat veniam in do minim dolore voluptate aliquip sit qui. Ut velit non irure consequat labore Lorem culpa occaecat quis anim cupidatat sit sunt. Consequat est consectetur adipisicing aute et proident esse ea sint est reprehenderit aute magna.\r\n",
        "time": 118.4486,
        "completed": true,
        "points": 36
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c27a7867f66e82f915",
        "description": "Eiusmod eiusmod mollit laboris laboris mollit eu fugiat esse officia minim dolore. Deserunt eu veniam duis eu fugiat laborum do qui eiusmod proident ut do. Occaecat non consequat sunt officia irure dolor non id labore ut nulla pariatur cillum deserunt. Veniam non voluptate pariatur amet laborum dolor magna. Laboris dolor culpa minim esse est tempor commodo eu ex. Sunt consequat eu sunt ad dolor.\r\n",
        "time": 48.6603,
        "completed": true,
        "points": 88
      },
      {
        "name": "Silo Park",
        "id": "64a9f2c2ddcce6805a51f83b",
        "description": "Occaecat id non officia duis aliquip do nisi do exercitation anim cillum voluptate. Sunt laborum pariatur qui enim ex voluptate magna. Velit eu laboris sunt sit laborum nisi. Ad voluptate dolor qui cupidatat exercitation nostrud. Irure dolor ut duis nostrud reprehenderit quis et.\r\n",
        "time": 115.6179,
        "completed": true,
        "points": 63
      },
      {
        "name": "Muriwai Beach",
        "id": "64a9f2c2405e39d2fb8b2240",
        "description": "Ad commodo culpa tempor commodo. Eiusmod cillum irure qui nisi occaecat est. Lorem eiusmod velit sint occaecat minim labore sunt amet consectetur cupidatat.\r\n",
        "time": 73.504,
        "completed": true,
        "points": 31
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c2d6d9ff216d430193",
        "description": "Sit Lorem laborum tempor non irure amet. Consequat labore cillum excepteur minim sunt sit magna laboris aliquip aliqua ullamco anim id excepteur. Minim aliqua deserunt labore ut anim aute veniam. Est incididunt mollit enim sunt adipisicing magna Lorem fugiat quis.\r\n",
        "time": 65.8694,
        "completed": true,
        "points": 20
      },
      {
        "name": "Oneroa",
        "id": "64a9f2c23eb0520e89b19195",
        "description": "Incididunt ex commodo dolor sit nostrud ipsum in cupidatat quis cillum quis. Velit aliqua dolore eu commodo Lorem excepteur et irure consectetur amet. Veniam non sint velit aute eiusmod laboris aliquip anim quis proident cillum. Pariatur duis exercitation voluptate ex esse enim cillum dolore tempor aute voluptate sit officia. Consequat deserunt velit minim laboris id dolor aute. Adipisicing ex amet adipisicing duis nulla Lorem culpa tempor. Pariatur nisi quis excepteur aliquip nulla nisi officia est fugiat mollit consequat.\r\n",
        "time": 56.0131,
        "completed": true,
        "points": 15
      }
    ]
  },
  {
    "id": "64a9f2c21aea01e6d13d6e33",
    "name": "Rosa Ramsey",
    "steps": 80427,
    "location": {
      "latitude": -36.89903,
      "longitude": -185.20443
    },
    "quests": [
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c2aa50904638c146fa",
        "description": "Commodo sit nostrud aliquip aliquip aute commodo esse dolor id sint. Aute officia ut cillum ipsum occaecat non duis anim culpa ex excepteur Lorem consequat. Esse exercitation voluptate aliquip tempor elit dolor ad ea laborum ex duis dolor.\r\n",
        "time": 32.9276,
        "completed": true,
        "points": 25
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c2a70ec126bfefdd5b",
        "description": "Id dolore incididunt pariatur fugiat magna veniam excepteur reprehenderit dolore sit ex quis id. Eiusmod magna qui tempor ullamco eiusmod dolore id. Ut cupidatat culpa sunt quis labore do deserunt laboris amet dolore adipisicing.\r\n",
        "time": 132.8005,
        "completed": true,
        "points": 76
      },
      {
        "name": "Auckland Botanic Gardens",
        "id": "64a9f2c267c067914118ea25",
        "description": "In sunt cupidatat quis occaecat velit. Fugiat in in laboris aliqua enim excepteur dolor ipsum culpa sunt pariatur. Aliquip sunt minim ipsum ullamco minim.\r\n",
        "time": 76.4204,
        "completed": true,
        "points": 29
      },
      {
        "name": "Piha Beach",
        "id": "64a9f2c2a0a24e7b660f106c",
        "description": "Laborum officia reprehenderit amet ut reprehenderit nulla eiusmod qui. Pariatur magna sunt fugiat sint anim mollit occaecat cillum aliquip reprehenderit qui ea enim. Est qui consequat minim labore ullamco enim consectetur. Do reprehenderit sunt aliquip magna quis dolore magna. Occaecat amet consectetur ut cupidatat labore duis labore ullamco duis aliqua consequat Lorem adipisicing incididunt. Aliqua duis dolor culpa Lorem id consectetur ea laboris labore excepteur id anim ullamco ut.\r\n",
        "time": 174.6781,
        "completed": true,
        "points": 69
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c27b65cba415136d3a",
        "description": "Id amet enim commodo sit ut sit veniam aliqua in magna. Non anim excepteur ex exercitation fugiat qui laborum id. Anim irure quis exercitation commodo cupidatat ad. Ullamco ipsum aliquip officia tempor nulla nulla dolor amet. Id adipisicing minim eiusmod commodo laboris Lorem et nulla excepteur deserunt nisi adipisicing et labore. Lorem voluptate proident fugiat consequat consequat consectetur magna irure reprehenderit minim deserunt minim. Lorem nulla culpa incididunt sunt cillum velit reprehenderit sint.\r\n",
        "time": 49.4157,
        "completed": true,
        "points": 18
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c2d5876e8896391fe1",
        "description": "Officia ad aliquip nulla proident Lorem reprehenderit exercitation deserunt. Esse est esse commodo commodo incididunt. Anim do mollit irure veniam cupidatat esse laboris id.\r\n",
        "time": 191.5313,
        "completed": true,
        "points": 39
      },
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2ecd24f9ba3dd83f2",
        "description": "Cillum do enim magna deserunt enim proident est esse. Dolor consequat enim tempor sit aliqua dolor incididunt aute veniam. Ut velit sunt anim cupidatat laborum veniam pariatur sunt nisi fugiat. Anim labore commodo incididunt deserunt labore nisi nisi amet duis minim excepteur tempor est. Eiusmod anim consequat laboris aliquip nostrud ea proident. Qui magna dolor commodo eu veniam. Incididunt amet qui esse labore eiusmod eiusmod pariatur tempor labore reprehenderit.\r\n",
        "time": 124.3132,
        "completed": true,
        "points": 100
      },
      {
        "name": "Mangere Mountain",
        "id": "64a9f2c2d13f2fcd76c9ccbc",
        "description": "Excepteur adipisicing proident est velit deserunt veniam. Fugiat aliqua sunt irure occaecat ipsum magna eiusmod do ipsum et quis. Deserunt incididunt sint excepteur nostrud sit commodo ex occaecat labore ullamco. Anim deserunt nostrud duis eiusmod eu consequat. Aliquip eu consequat nisi consectetur adipisicing mollit labore non exercitation ipsum culpa sit. Ut enim amet non officia. Ad exercitation in nulla adipisicing tempor aliqua laboris velit minim occaecat consectetur eiusmod.\r\n",
        "time": 129.512,
        "completed": true,
        "points": 11
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c2089928d7a3b16751",
        "description": "Proident ea enim ipsum officia exercitation nulla. Mollit consectetur laborum aliqua in voluptate pariatur. Laborum labore consectetur laborum id in veniam consectetur eu quis qui laboris do magna. Anim sunt cillum consectetur eu. Anim esse qui quis laborum proident. Nulla id sunt exercitation nisi id aute labore qui et.\r\n",
        "time": 116.9471,
        "completed": true,
        "points": 51
      },
      {
        "name": "Matakana",
        "id": "64a9f2c2a895360bf34c00aa",
        "description": "Sunt qui nulla officia enim esse elit laboris cupidatat consequat fugiat ut adipisicing sint. Cupidatat sint mollit irure Lorem magna do ea fugiat occaecat ullamco excepteur magna. Consectetur ad cillum aliqua sit commodo qui. Sint sit amet proident aliquip excepteur consectetur ea dolor eu consectetur aliqua non laborum dolore. Non minim aliquip elit labore laboris. Deserunt dolor magna nostrud dolor exercitation.\r\n",
        "time": 86.5635,
        "completed": true,
        "points": 35
      }
    ]
  },
  {
    "id": "64a9f2c2c968b037622d42f4",
    "name": "Gray Baldwin",
    "steps": 86727,
    "location": {
      "latitude": -36.88812,
      "longitude": -185.22068
    },
    "quests": [
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c2f121f8763557423a",
        "description": "Commodo Lorem enim consectetur consequat aute pariatur ullamco magna commodo. Lorem deserunt laborum enim nisi ea aute non et enim reprehenderit nulla laboris. Pariatur veniam anim esse qui ad. Ullamco quis duis nostrud aliqua enim laboris ipsum esse aliqua aliquip ullamco. Aliqua amet eu ullamco sit do reprehenderit incididunt officia anim. Elit tempor sint deserunt fugiat reprehenderit officia laboris occaecat sunt consectetur id tempor. Est ad reprehenderit tempor tempor qui culpa consequat ex eiusmod.\r\n",
        "time": 106.1688,
        "completed": true,
        "points": 31
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2ca06959f6e0eceb2",
        "description": "Consequat et sit sint id quis fugiat ex laborum adipisicing. Lorem aliquip dolore est et ut laboris nisi commodo exercitation. Eu mollit voluptate nostrud esse dolor et cupidatat do elit aliqua. Laborum velit minim nisi do laboris. Id cillum cupidatat esse sit et.\r\n",
        "time": 191.3531,
        "completed": true,
        "points": 64
      },
      {
        "name": "Otara Market",
        "id": "64a9f2c2147bb5fbab4903b9",
        "description": "Nostrud aliquip anim cupidatat quis laborum. Occaecat labore ea esse laboris. Elit magna non ad exercitation ad nisi nulla sit consectetur aliquip.\r\n",
        "time": 153.754,
        "completed": true,
        "points": 72
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c2ca0d5db92384a64a",
        "description": "Elit adipisicing magna consectetur laborum occaecat dolor sit aliqua irure esse quis ad. Irure ex nostrud minim exercitation et dolor Lorem amet proident. Qui occaecat voluptate exercitation laborum do aliqua non ea ipsum in quis consequat excepteur sunt.\r\n",
        "time": 117.8171,
        "completed": true,
        "points": 78
      },
      {
        "name": "Wynyard Quarter",
        "id": "64a9f2c2f57466b7d5f7ceec",
        "description": "Pariatur eu mollit ipsum non irure esse dolore magna cupidatat aliqua anim aliquip. Ut est mollit aute cillum anim in fugiat cillum sunt officia labore. Nostrud cupidatat amet ut fugiat ullamco qui aliquip esse nisi officia. Pariatur exercitation ea esse consequat ut sunt ullamco ullamco laborum consectetur eiusmod.\r\n",
        "time": 54.5214,
        "completed": true,
        "points": 28
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c25ba6d31f12ed70eb",
        "description": "Labore dolor irure duis pariatur est veniam aute eu velit irure mollit pariatur consectetur minim. Reprehenderit et duis anim adipisicing non esse ipsum sunt nulla aliqua dolore velit Lorem est. Nostrud aute tempor laboris eiusmod magna. Qui ullamco Lorem aute non ea commodo proident voluptate et minim labore. Fugiat est id nulla adipisicing officia minim id laborum voluptate laboris nostrud quis esse.\r\n",
        "time": 33.1142,
        "completed": true,
        "points": 68
      },
      {
        "name": "Mission Bay",
        "id": "64a9f2c24f91c8b07b1ae721",
        "description": "Cillum deserunt ad sit enim duis esse ad mollit occaecat do adipisicing dolor labore velit. Ut esse laboris ullamco aute sit sint ea Lorem non sunt tempor amet officia. Velit dolor ad veniam aute. Lorem eu sint consectetur voluptate. Ea exercitation incididunt culpa ut ad ad Lorem ea Lorem labore nulla laboris. Tempor aliquip sint voluptate amet. Consequat laboris do eu laboris incididunt anim anim ut ipsum.\r\n",
        "time": 109.4629,
        "completed": true,
        "points": 12
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c21f4d127ea31b7896",
        "description": "Fugiat occaecat est velit in adipisicing amet labore qui adipisicing et ex cillum veniam officia. Dolor duis officia ad ullamco consequat fugiat. Eu consectetur minim ut mollit qui culpa. Ex officia do ex et magna eu ipsum laboris do in est aute eiusmod. Ex minim tempor Lorem minim aliquip fugiat et consectetur culpa irure nulla nisi officia laborum. Est sit velit cupidatat minim quis qui officia anim.\r\n",
        "time": 171.9393,
        "completed": true,
        "points": 67
      },
      {
        "name": "Karekare",
        "id": "64a9f2c2b1921b7555d54174",
        "description": "Commodo culpa qui duis cillum anim ad est irure nisi aliquip laboris labore enim. Cupidatat tempor culpa nulla dolor Lorem quis est veniam non fugiat sint. Sint officia ad proident fugiat mollit minim labore sit cillum esse aute reprehenderit occaecat labore. Exercitation deserunt occaecat fugiat in nulla.\r\n",
        "time": 199.3104,
        "completed": true,
        "points": 44
      }
    ]
  },
  {
    "id": "64a9f2c261caeb54a9705043",
    "name": "Chaney Sparks",
    "steps": 5699,
    "location": {
      "latitude": -36.89552,
      "longitude": -185.27145
    },
    "quests": [
      {
        "name": "Otara Market",
        "id": "64a9f2c21d2181054cc17204",
        "description": "Et adipisicing sunt deserunt quis elit tempor commodo voluptate exercitation nulla quis. Reprehenderit officia nulla officia irure qui ullamco pariatur cillum et aliqua. Occaecat commodo sit ea eiusmod ipsum est ea pariatur aliquip sint anim ullamco. Tempor enim duis sint voluptate aliquip pariatur veniam.\r\n",
        "time": 29.2744,
        "completed": true,
        "points": 16
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c2eab81efb1ef36e31",
        "description": "Cillum sit veniam irure officia fugiat ad pariatur est anim. Excepteur veniam enim adipisicing incididunt ex fugiat duis ad cillum laborum do. Consequat ipsum magna commodo adipisicing ad dolore cupidatat. Duis adipisicing eu sit mollit enim et dolor magna aute pariatur ullamco excepteur. Lorem esse velit ut commodo anim duis minim qui quis. Velit do deserunt cupidatat reprehenderit aliqua dolor pariatur cupidatat minim do commodo quis tempor. Ut minim irure elit labore sint nulla ad cillum.\r\n",
        "time": 138.2349,
        "completed": true,
        "points": 36
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c2b25263d3ff293040",
        "description": "Officia consequat laborum veniam exercitation velit aliqua quis aute in voluptate incididunt labore. Laborum non enim duis qui qui non tempor nisi incididunt incididunt pariatur commodo sit velit. Anim pariatur in nisi deserunt et esse id irure deserunt adipisicing et ea. Ipsum nulla cillum dolor cupidatat ea consequat proident est deserunt nisi eu velit ut. Sit eiusmod dolor qui ad elit. Anim irure reprehenderit officia ea ipsum enim.\r\n",
        "time": 86.7348,
        "completed": true,
        "points": 21
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c20f666d67d160381b",
        "description": "Nisi ut consectetur elit officia eu laboris esse aliquip voluptate eiusmod ea occaecat consequat. Do qui id sint eu ex magna ad laboris nostrud laboris aliqua est ea. Qui do dolore deserunt sit elit mollit adipisicing aute ipsum.\r\n",
        "time": 41.133,
        "completed": true,
        "points": 10
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c2706bd9bede6d0eb5",
        "description": "Est proident do voluptate minim qui aliqua. Do excepteur irure aute fugiat ullamco laborum. Magna id culpa nostrud ex. Ut fugiat ea quis proident culpa velit. Aliqua commodo nostrud nisi in sunt amet eiusmod fugiat reprehenderit.\r\n",
        "time": 121.3325,
        "completed": true,
        "points": 94
      },
      {
        "name": "Orewa Beach",
        "id": "64a9f2c2b09d338e65cc2444",
        "description": "Id consequat aliqua irure id adipisicing magna qui. Eu et reprehenderit mollit laborum elit est tempor dolore eiusmod ipsum deserunt consequat do et. Est culpa adipisicing Lorem nulla proident qui magna dolore.\r\n",
        "time": 26.5925,
        "completed": true,
        "points": 22
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c2e935289e3b3ab985",
        "description": "Nisi nulla sint sunt laboris esse sit. Ut cupidatat pariatur et magna aliquip adipisicing aute reprehenderit eiusmod deserunt cillum eu amet. Deserunt tempor anim sit dolore eiusmod reprehenderit proident laboris laborum cillum ea. Nulla quis ipsum aliquip culpa dolore aliqua reprehenderit consequat commodo cupidatat eiusmod ipsum commodo. Lorem magna reprehenderit elit ex. Qui dolore elit mollit consequat aliquip reprehenderit nostrud deserunt occaecat ut sunt. Id dolor adipisicing consectetur adipisicing enim veniam et ea cupidatat in elit pariatur irure adipisicing.\r\n",
        "time": 31.7641,
        "completed": true,
        "points": 18
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c268831b0a345337af",
        "description": "Nostrud pariatur aliqua commodo ex elit aliqua ut. Anim mollit minim eiusmod laboris cillum. Dolor tempor nulla anim enim. Aute voluptate fugiat anim sunt. Magna consectetur magna sit commodo occaecat labore est do sint. Ea ad amet enim magna magna ut.\r\n",
        "time": 189.0325,
        "completed": true,
        "points": 74
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c2a2637169c407fec4",
        "description": "Proident magna velit labore ad ea ea duis id sit cupidatat minim culpa elit in. Qui aute consequat reprehenderit ullamco anim occaecat id. Dolor velit quis eiusmod elit voluptate occaecat ut tempor magna consequat est laboris pariatur. In nostrud qui fugiat aliqua. Dolor esse minim culpa Lorem aliquip ea nostrud labore nulla. Adipisicing in aute ea nulla. Esse nisi occaecat fugiat anim consectetur tempor qui.\r\n",
        "time": 191.0955,
        "completed": true,
        "points": 79
      }
    ]
  },
  {
    "id": "64a9f2c298b80134346e0104",
    "name": "Ana Sampson",
    "steps": 71960,
    "location": {
      "latitude": -36.87729,
      "longitude": -185.26929
    },
    "quests": [
      {
        "name": "One Tree Hill",
        "id": "64a9f2c2c01cc6b093096a43",
        "description": "Non Lorem ea exercitation dolor fugiat est qui sunt cillum cupidatat aliqua laborum commodo. Esse amet sint cillum eu excepteur duis exercitation sunt voluptate voluptate pariatur esse do. Nulla eu cupidatat do tempor eu laboris. Irure ut dolor anim quis quis dolor.\r\n",
        "time": 132.6717,
        "completed": true,
        "points": 83
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c292fe41dcec880c88",
        "description": "Duis ipsum eu excepteur excepteur Lorem anim enim culpa irure anim duis. Magna tempor mollit sit adipisicing culpa laborum enim eiusmod deserunt quis eiusmod. Ad labore fugiat labore et consectetur anim adipisicing quis sunt.\r\n",
        "time": 45.3925,
        "completed": true,
        "points": 29
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c27641a05ec1c5bbb0",
        "description": "Incididunt sint magna amet amet anim. Officia ullamco tempor id cillum laborum do. Minim dolor pariatur dolore et ea sint sit qui in. Duis incididunt deserunt aliqua labore.\r\n",
        "time": 180.2566,
        "completed": true,
        "points": 74
      },
      {
        "name": "Ambury Regional Park",
        "id": "64a9f2c26f46dceda4038104",
        "description": "Consectetur exercitation quis tempor dolor laborum fugiat Lorem Lorem cupidatat pariatur in dolor. Eiusmod sunt cillum est nulla proident aliquip aliqua veniam esse qui cillum. Lorem laboris dolor anim ad ut ex qui sit ea excepteur nostrud cupidatat.\r\n",
        "time": 18.493,
        "completed": true,
        "points": 61
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c25f729a19f6ea9316",
        "description": "Incididunt cillum deserunt nostrud pariatur laboris. Duis fugiat Lorem consectetur anim irure aute ad consectetur cillum. Labore deserunt esse cillum ad officia Lorem elit sunt commodo enim id. Lorem enim consectetur sint sint adipisicing.\r\n",
        "time": 191.1972,
        "completed": true,
        "points": 32
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9f2c205264814f6db86a7",
        "description": "Nostrud mollit anim id ipsum esse pariatur irure consequat exercitation anim. Excepteur quis adipisicing sint nulla nisi aliqua. Est velit sit id ut ad id consequat excepteur eiusmod quis Lorem. Sunt deserunt tempor eiusmod nisi veniam commodo sunt consectetur duis commodo commodo voluptate. Excepteur enim eu qui enim elit et proident eu duis culpa cupidatat aute fugiat. Non cillum in proident in minim ut deserunt aliqua commodo officia elit amet. Nulla excepteur quis ea sunt esse do laboris in.\r\n",
        "time": 26.047,
        "completed": true,
        "points": 70
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c2df173122b561b3bd",
        "description": "Ea ipsum magna est deserunt nisi aliquip veniam consectetur occaecat ad magna. Incididunt magna in et consectetur voluptate nostrud proident. Ex mollit Lorem dolor eu fugiat occaecat exercitation Lorem qui magna voluptate. Nisi fugiat laborum magna consequat reprehenderit ea sint velit consectetur nulla. Sunt id aliqua irure duis non laboris. Laboris veniam sit esse proident mollit cillum sit sint dolor minim duis consectetur aliqua eu. Elit proident ad sint esse irure esse ad ipsum ad consectetur.\r\n",
        "time": 114.2611,
        "completed": true,
        "points": 23
      },
      {
        "name": "Waiheke Island",
        "id": "64a9f2c236e5bcaf218aa4b6",
        "description": "Ea esse et laboris pariatur aliquip Lorem anim. Veniam esse do officia consectetur cillum magna excepteur consectetur enim incididunt veniam veniam. Irure nisi culpa dolore occaecat laboris sit occaecat nostrud excepteur. Ea cillum mollit dolor id tempor nulla ea pariatur dolore voluptate. Reprehenderit ex veniam laboris nulla eiusmod minim nulla dolore in incididunt.\r\n",
        "time": 166.3501,
        "completed": true,
        "points": 48
      },
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c2096d181cbf7c87b2",
        "description": "Velit ea labore incididunt proident nisi nostrud velit aute ut do. Commodo mollit sit fugiat proident occaecat est sunt enim veniam quis dolore duis. Reprehenderit aliquip aute proident Lorem.\r\n",
        "time": 116.0913,
        "completed": true,
        "points": 59
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9f2c2d828d7464bf0ba39",
        "description": "Elit dolore proident nostrud voluptate ut irure in duis aute culpa. Ullamco velit reprehenderit et qui sint ipsum et. Sunt elit Lorem sit in do mollit pariatur culpa aliquip minim adipisicing.\r\n",
        "time": 70.0465,
        "completed": true,
        "points": 94
      }
    ]
  },
  {
    "id": "64a9f2c275ecfc8175475918",
    "name": "Bradshaw Holland",
    "steps": 65519,
    "location": {
      "latitude": -36.88311,
      "longitude": -185.2322
    },
    "quests": [
      {
        "name": "Auckland War Memorial Museum",
        "id": "64a9f2c2bbc27f047e5b1682",
        "description": "Laboris do nisi fugiat in eu aliquip aliquip adipisicing cupidatat. Cillum sint magna proident est nulla elit aliquip officia tempor reprehenderit deserunt. Qui aute est nisi reprehenderit.\r\n",
        "time": 102.8479,
        "completed": true,
        "points": 67
      },
      {
        "name": "Auckland Harbour Bridge",
        "id": "64a9f2c263598ad211f5e2bd",
        "description": "Deserunt anim est minim enim minim eiusmod quis velit quis ad cupidatat. Lorem enim nulla voluptate nostrud et ipsum laborum dolore esse dolore consectetur ipsum. Magna anim duis quis dolore. Consectetur sunt dolore elit minim irure. Labore sit nostrud veniam aute Lorem Lorem. Voluptate in elit do ea fugiat veniam proident eu aute cillum. Enim consequat adipisicing ipsum sint qui pariatur qui dolore labore.\r\n",
        "time": 155.7481,
        "completed": true,
        "points": 67
      },
      {
        "name": "Auckland Domain",
        "id": "64a9f2c2b7cf41b25c1688d3",
        "description": "Adipisicing esse nisi laborum eiusmod laboris qui sint nisi exercitation. Commodo amet esse sit sit deserunt exercitation cillum. Adipisicing amet sint id elit dolor esse eu pariatur eu amet dolore dolor ut officia.\r\n",
        "time": 154.022,
        "completed": true,
        "points": 38
      },
      {
        "name": "Piha Beach",
        "id": "64a9f2c254ebd6274641a4c0",
        "description": "Non deserunt pariatur laborum do labore laborum et sint et. Ea occaecat Lorem anim voluptate duis anim minim adipisicing consequat velit. Nisi deserunt labore laboris eiusmod exercitation laboris cillum nostrud voluptate pariatur dolor.\r\n",
        "time": 149.7221,
        "completed": true,
        "points": 12
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c2d01131368041139c",
        "description": "Aliqua id aute irure nulla laborum laboris. Sit reprehenderit voluptate ullamco eu ea anim. Laboris cillum exercitation do magna amet dolor aliqua incididunt aute amet anim sint exercitation anim.\r\n",
        "time": 21.0827,
        "completed": true,
        "points": 17
      },
      {
        "name": "Auckland Museum",
        "id": "64a9f2c217eb4d66d93a0308",
        "description": "Voluptate non culpa adipisicing magna mollit cupidatat. Do officia anim est ut duis excepteur. Esse reprehenderit laboris reprehenderit est do consectetur dolor sit labore nulla qui. Id id reprehenderit sunt esse do consectetur velit pariatur. Laborum sunt est minim minim proident Lorem deserunt. Eu ullamco nulla minim occaecat dolore minim ad ipsum deserunt nostrud proident irure qui. Ea aliqua cupidatat nostrud anim occaecat ipsum consectetur consequat officia anim labore nisi velit.\r\n",
        "time": 54.4002,
        "completed": true,
        "points": 25
      },
      {
        "name": "Howick Historical Village",
        "id": "64a9f2c29267f2ae360521c1",
        "description": "Ut dolore consectetur dolore magna non in Lorem amet eu sint occaecat. Ea ex ut ea pariatur ullamco sint cupidatat sit. Nisi eu consectetur velit consequat aute id occaecat proident. Ipsum exercitation in excepteur magna eiusmod. Duis enim eu aute laboris mollit labore deserunt consequat ex nulla Lorem dolor duis magna. Occaecat duis esse consequat tempor ipsum.\r\n",
        "time": 187.9811,
        "completed": true,
        "points": 12
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c24b6acff4325db0aa",
        "description": "Sit mollit cillum amet et velit dolor occaecat cupidatat do. Dolore irure irure exercitation dolor. Nostrud Lorem in elit proident duis eu ad in do anim est quis ex. Cupidatat qui deserunt cillum reprehenderit irure officia exercitation cillum aliqua. Lorem sunt incididunt sit id commodo enim. Dolor voluptate enim ullamco aliquip pariatur anim incididunt eiusmod consectetur. Sint aliqua fugiat irure anim amet veniam anim cillum incididunt nostrud.\r\n",
        "time": 62.456,
        "completed": true,
        "points": 87
      }
    ]
  },
  {
    "id": "64a9f2c271124298633a3a46",
    "name": "Dorothy Buckley",
    "steps": 26197,
    "location": {
      "latitude": -36.89796,
      "longitude": -185.2149
    },
    "quests": [
      {
        "name": "Wynyard Quarter",
        "id": "64a9f2c2b94e11a649725269",
        "description": "Laboris enim ad duis ex veniam aliquip aute eu. Eu fugiat incididunt voluptate dolore cillum irure. Nisi eiusmod laborum est nisi proident culpa magna nulla ipsum tempor qui laboris veniam. Magna ipsum occaecat deserunt cupidatat incididunt sit tempor eiusmod in reprehenderit deserunt voluptate esse. Ipsum consequat do aliqua excepteur nulla adipisicing Lorem laborum commodo anim sit eiusmod. Ipsum id eiusmod consequat ex in est in aute anim.\r\n",
        "time": 194.9364,
        "completed": true,
        "points": 64
      },
      {
        "name": "Aotea Square",
        "id": "64a9f2c272a528724515df77",
        "description": "Culpa in anim do esse excepteur mollit. Consequat id minim eu proident. Et minim est cillum sunt magna dolor. In do quis Lorem id anim eiusmod tempor. Reprehenderit commodo tempor non laborum deserunt exercitation tempor adipisicing irure nostrud incididunt. Quis ad laboris ullamco quis cupidatat consequat.\r\n",
        "time": 90.6816,
        "completed": true,
        "points": 51
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c26c12638dfe481924",
        "description": "Anim magna qui aliqua reprehenderit ullamco enim. Dolor ipsum laborum commodo pariatur cupidatat consequat excepteur sint duis in aliquip sint aliqua deserunt. Magna sit laborum non ea sunt fugiat mollit sunt occaecat aliqua voluptate. Ullamco irure reprehenderit esse ex nulla incididunt id enim cupidatat pariatur qui. In minim dolor elit laboris mollit Lorem excepteur esse sint labore nulla ullamco. Do eu mollit id deserunt laborum do. Adipisicing non aliquip ad id culpa aliqua quis dolor.\r\n",
        "time": 35.9068,
        "completed": true,
        "points": 75
      },
      {
        "name": "Aotea Square",
        "id": "64a9f2c228a8c6794cd7eac4",
        "description": "Anim velit nostrud laborum aliquip deserunt. Sunt ullamco consectetur culpa labore ea occaecat non mollit pariatur. Ea id sit irure aliqua esse ea. Consequat dolor officia ipsum ut non ad nulla amet nulla esse do consequat consectetur. Excepteur pariatur ex anim fugiat excepteur commodo pariatur consequat. Velit voluptate Lorem exercitation sint in id eu ea consequat reprehenderit id cupidatat nulla ad. Incididunt eu exercitation irure in eu duis laboris.\r\n",
        "time": 94.3704,
        "completed": true,
        "points": 18
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c29258bb7fec66e706",
        "description": "Dolore ullamco aliqua dolor velit nulla anim dolore pariatur qui eu reprehenderit consectetur. Magna ea ipsum voluptate qui magna fugiat ea est aliqua anim mollit. Dolor in non aliqua exercitation exercitation mollit excepteur officia mollit pariatur. In qui ullamco aliqua mollit velit Lorem ad et veniam id fugiat. Culpa tempor fugiat do eu duis cupidatat exercitation elit ex nisi sunt mollit velit sint. Id elit laboris veniam elit velit ullamco excepteur aliqua ea non culpa.\r\n",
        "time": 52.2628,
        "completed": true,
        "points": 99
      },
      {
        "name": "Matakana",
        "id": "64a9f2c27c21bae6e7a1ac03",
        "description": "Amet cillum eu exercitation mollit aliqua. Occaecat exercitation ut sit ut consequat irure velit consequat est. Reprehenderit et reprehenderit consectetur esse cillum.\r\n",
        "time": 69.1214,
        "completed": true,
        "points": 68
      },
      {
        "name": "Takapuna Beach",
        "id": "64a9f2c2cb82272ad905d19c",
        "description": "Dolor pariatur fugiat dolore magna amet culpa id enim aliqua fugiat do tempor dolore. Qui exercitation sint eiusmod deserunt consectetur officia proident. Ea esse mollit proident magna velit consectetur sunt ut magna irure qui qui dolor dolore. Minim ea exercitation reprehenderit ea officia nisi nostrud. Exercitation pariatur do est sit. Velit magna occaecat duis elit ea consectetur non id laboris occaecat sint consectetur pariatur.\r\n",
        "time": 6.2768,
        "completed": true,
        "points": 68
      },
      {
        "name": "One Tree Hill",
        "id": "64a9f2c262693aed9130072b",
        "description": "Sit tempor ut quis laborum deserunt minim ut mollit. Officia magna dolore culpa laboris. Dolore voluptate sit aute irure magna pariatur laborum. Est nulla proident eiusmod incididunt esse sint proident ipsum voluptate voluptate incididunt ut. Exercitation ea cillum magna deserunt sint minim dolore ea amet. Exercitation laboris in enim consectetur non et cupidatat sit officia nulla nisi laboris adipisicing. In nostrud velit sunt exercitation occaecat incididunt consequat ullamco.\r\n",
        "time": 96.7943,
        "completed": true,
        "points": 37
      },
      {
        "name": "Parnell",
        "id": "64a9f2c2100666b6ef5e28de",
        "description": "Velit cillum deserunt mollit dolore eu esse id consectetur enim quis do dolor. Officia excepteur labore ex non sint. Amet et eiusmod laborum ex mollit dolor sint esse et.\r\n",
        "time": 99.9809,
        "completed": true,
        "points": 45
      }
    ]
  },
  {
    "id": "64a9f2c229a53ad758b8174d",
    "name": "Lidia Yates",
    "steps": 47929,
    "location": {
      "latitude": -36.89173,
      "longitude": -185.23183
    },
    "quests": [
      {
        "name": "Gulf Harbour",
        "id": "64a9f2c21d8ab18b0e15fbb3",
        "description": "Ea tempor sint duis veniam et ullamco. Adipisicing incididunt eiusmod ad enim veniam ipsum occaecat eiusmod ad incididunt id ut cupidatat. Labore sit dolor laborum velit.\r\n",
        "time": 32.8199,
        "completed": true,
        "points": 21
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c21404212e9dc57935",
        "description": "Ut magna laboris voluptate labore nisi. Excepteur deserunt consequat elit incididunt ipsum aute consequat. Excepteur in amet ipsum voluptate qui. Cillum duis nostrud cillum laborum in eiusmod reprehenderit.\r\n",
        "time": 156.0676,
        "completed": true,
        "points": 47
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9f2c2c341d94de0fef70f",
        "description": "Deserunt incididunt qui laboris Lorem aliqua. Eu veniam excepteur dolore reprehenderit sunt voluptate. In mollit eiusmod aute elit reprehenderit deserunt. Incididunt aute ipsum eu pariatur sit labore reprehenderit nostrud consequat fugiat. Ipsum commodo eu anim sint consectetur ullamco irure anim nostrud nostrud nulla fugiat nisi proident. Dolor exercitation non adipisicing eiusmod est in. Duis cillum in sint reprehenderit culpa sint consectetur ad magna eu quis laboris eu.\r\n",
        "time": 50.2027,
        "completed": true,
        "points": 80
      },
      {
        "name": "Auckland Central Library",
        "id": "64a9f2c26c721798abad2693",
        "description": "Laborum aute aute excepteur cupidatat qui. Anim nisi anim magna irure ex nisi tempor est commodo. Consequat laborum Lorem cupidatat sunt ad. Exercitation veniam incididunt reprehenderit nisi nulla amet ad id adipisicing aute exercitation. Quis aliqua officia deserunt enim ut reprehenderit sunt elit. Exercitation velit et minim sunt eiusmod mollit in reprehenderit occaecat est commodo id minim irure.\r\n",
        "time": 190.5211,
        "completed": true,
        "points": 50
      },
      {
        "name": "Karekare",
        "id": "64a9f2c20c7d28ac6926d80e",
        "description": "Velit nostrud eu velit non consectetur consequat quis eiusmod qui ipsum. Sunt nostrud irure commodo nostrud. Incididunt ad aliquip consequat qui non nostrud. Nisi fugiat anim magna sunt ad sunt excepteur aliqua adipisicing. Sunt ea eiusmod ad minim tempor consequat pariatur est id veniam non ex voluptate cupidatat. Et mollit aute est ea quis nisi proident quis exercitation velit elit aliqua ipsum ut.\r\n",
        "time": 86.5375,
        "completed": true,
        "points": 62
      },
      {
        "name": "Stardome Observatory",
        "id": "64a9f2c2f29d476886e520fc",
        "description": "Nulla aute dolore enim consectetur. Est proident sit cillum ad sit ea cillum commodo. Consequat aliqua sint sunt dolor laborum cillum anim occaecat. Nisi sunt culpa Lorem enim deserunt culpa et cupidatat. Consectetur excepteur dolore dolore elit fugiat non reprehenderit. Reprehenderit et excepteur est et ullamco dolore consequat nostrud.\r\n",
        "time": 171.1559,
        "completed": true,
        "points": 50
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9f2c2eb686d844a867fcc",
        "description": "Quis fugiat reprehenderit aliquip do aute velit dolor officia. Non excepteur laboris quis adipisicing consequat esse. Non nisi non sunt officia irure nulla ullamco adipisicing et esse do officia id. Pariatur sunt nisi amet nisi et. Tempor non elit ex quis qui esse aliqua nisi amet cupidatat cillum exercitation sint. Magna laborum consectetur tempor id ad eiusmod. Duis magna id fugiat anim cillum sint id eu aliquip cillum do sunt dolor.\r\n",
        "time": 194.8831,
        "completed": true,
        "points": 12
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c2e04af7801afd85f9",
        "description": "Dolor occaecat sit consequat culpa. Enim esse consectetur ullamco esse culpa ea tempor excepteur sit. Cupidatat minim duis id sunt velit pariatur magna ipsum.\r\n",
        "time": 1.9175,
        "completed": true,
        "points": 13
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c2018f7d0494ec50b3",
        "description": "Amet Lorem proident enim ullamco nisi aliqua ullamco aliqua laboris. Et cillum ullamco officia est elit dolor pariatur voluptate. Do consequat exercitation non duis do pariatur non mollit. Minim tempor exercitation dolore laborum proident. Duis quis duis id tempor incididunt in est voluptate aute sunt culpa. Occaecat amet aliqua deserunt ut cupidatat.\r\n",
        "time": 78.3638,
        "completed": true,
        "points": 79
      }
    ]
  },
  {
    "id": "64a9f2c2535088c1e71cf186",
    "name": "Mcdowell Sutton",
    "steps": 69272,
    "location": {
      "latitude": -36.87173,
      "longitude": -185.22304
    },
    "quests": [
      {
        "name": "Takapuna",
        "id": "64a9f2c26ed236e650b63edf",
        "description": "Ea deserunt tempor cupidatat incididunt magna qui non sit nostrud minim ipsum enim. Eu sint duis eiusmod dolor laborum qui ipsum adipisicing velit dolore adipisicing. Ullamco est ut sunt tempor irure excepteur tempor proident esse proident veniam eu sunt consequat. Occaecat sint non culpa aliquip ad in.\r\n",
        "time": 59.8375,
        "completed": true,
        "points": 47
      },
      {
        "name": "Bethells Beach",
        "id": "64a9f2c2130cf7bd8aad7d60",
        "description": "Ut consequat ipsum ullamco excepteur id dolor labore sunt incididunt est labore pariatur. Ex minim ullamco exercitation esse aliquip. Consectetur labore magna ad amet non nostrud adipisicing ipsum quis eiusmod.\r\n",
        "time": 95.383,
        "completed": true,
        "points": 42
      },
      {
        "name": "Auckland Fish Market",
        "id": "64a9f2c2284992fe50ec7adf",
        "description": "Et nisi do anim ipsum labore tempor ad qui exercitation incididunt. Officia esse occaecat ea non est. Excepteur id sit magna commodo duis velit pariatur dolor eu et proident fugiat.\r\n",
        "time": 71.7412,
        "completed": true,
        "points": 65
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c25e3ba3bbd70b61d1",
        "description": "Adipisicing elit cupidatat id sunt eu excepteur consequat do exercitation quis. Elit anim esse deserunt excepteur aliquip non enim enim elit eiusmod occaecat mollit. Voluptate in qui do dolore tempor deserunt nulla enim magna.\r\n",
        "time": 6.651,
        "completed": true,
        "points": 69
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c20a9c6b3d220e6791",
        "description": "Tempor proident sunt culpa incididunt pariatur fugiat quis pariatur excepteur. Commodo adipisicing labore duis elit velit minim aliqua do adipisicing incididunt officia incididunt sint. Eu non ullamco irure amet nostrud adipisicing mollit magna. Id velit magna commodo incididunt labore quis adipisicing fugiat mollit pariatur. Dolor ipsum magna proident do. Voluptate est ex sunt aliqua proident adipisicing sunt.\r\n",
        "time": 191.7942,
        "completed": true,
        "points": 12
      },
      {
        "name": "Awhitu Peninsula",
        "id": "64a9f2c283bd1a3555bef9b6",
        "description": "Minim et amet ullamco consectetur ex consectetur irure esse aliqua do eiusmod deserunt ipsum. Consectetur est exercitation enim dolore. Officia ea aute dolore aliquip aliqua non enim nulla laborum sint adipisicing. Lorem magna adipisicing anim amet ipsum in enim nostrud anim nulla qui. Officia dolor ipsum adipisicing cillum consequat esse irure enim aliquip anim consequat.\r\n",
        "time": 105.0685,
        "completed": true,
        "points": 26
      },
      {
        "name": "Matakana Village Farmers' Market",
        "id": "64a9f2c250d11ff829af6d91",
        "description": "Ad aute in dolor reprehenderit et id commodo qui magna. Cupidatat eiusmod qui duis aliquip deserunt tempor elit do cillum in. Elit mollit veniam ut velit eu aliquip minim eu do sit tempor. Ad ipsum commodo do anim eiusmod dolor. Elit incididunt aliquip nulla proident.\r\n",
        "time": 177.7737,
        "completed": true,
        "points": 87
      },
      {
        "name": "Karekare",
        "id": "64a9f2c2eecf324a795d7358",
        "description": "Ipsum mollit cillum amet do cillum aute fugiat et culpa commodo culpa veniam. Mollit voluptate proident laborum labore commodo laboris ut non. Officia in pariatur aliqua proident ipsum cillum exercitation nisi cupidatat. Minim laboris est proident eiusmod occaecat minim do id exercitation officia id ea. Pariatur officia sit eu enim ea dolor dolor esse pariatur fugiat aliquip ea.\r\n",
        "time": 21.9574,
        "completed": true,
        "points": 86
      },
      {
        "name": "Hunua Falls",
        "id": "64a9f2c25e77c0c1a8c7dc50",
        "description": "Tempor qui enim laborum ullamco id ex occaecat ea exercitation esse ad laborum labore. Aliquip duis consectetur adipisicing velit ea non labore in cupidatat deserunt incididunt quis. Lorem aliqua consequat aute officia minim excepteur fugiat.\r\n",
        "time": 79.369,
        "completed": true,
        "points": 16
      },
      {
        "name": "Rangitoto Island",
        "id": "64a9f2c2c94a63b92a27b04f",
        "description": "Consequat dolor est laboris laboris veniam irure nostrud. Ullamco fugiat quis nisi Lorem exercitation esse amet anim tempor consectetur laboris fugiat eu aliqua. Velit elit laborum consectetur velit aliquip sit commodo sunt fugiat minim velit Lorem incididunt. Id elit aliqua et sint tempor enim deserunt laborum esse ea aliquip. Aliqua voluptate commodo consectetur adipisicing reprehenderit ipsum tempor aute minim in laborum sint minim esse. Laboris est labore ea qui sit mollit amet exercitation tempor minim incididunt Lorem tempor. Sunt ad nostrud irure ullamco labore enim dolore anim minim.\r\n",
        "time": 185.5626,
        "completed": true,
        "points": 96
      }
    ]
  },
  {
    "id": "64a9f2c200635ba1162fa95e",
    "name": "Gallagher Morton",
    "steps": 46326,
    "location": {
      "latitude": -36.87399,
      "longitude": -185.22424
    },
    "quests": [
      {
        "name": "Kitekite Falls",
        "id": "64a9f2c2f5936ec424089743",
        "description": "Quis in ex nulla id sit ad anim cillum. Et ea id irure nostrud adipisicing duis. Labore eiusmod pariatur proident qui consectetur do et fugiat pariatur voluptate ex. Irure nulla deserunt irure consectetur ullamco in culpa. Occaecat ex amet aliquip Lorem cillum enim deserunt. Nisi laboris officia dolore proident laboris veniam aute.\r\n",
        "time": 138.2783,
        "completed": true,
        "points": 32
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9f2c2afb4d1028d0cba77",
        "description": "Proident ea eiusmod aliquip eiusmod ea ex. Duis fugiat aute cupidatat duis eu. Ex dolore consequat nulla cillum. Incididunt Lorem dolore reprehenderit nostrud voluptate elit excepteur sit. Eu nulla in consequat id ea. Nostrud tempor aliquip excepteur aliqua adipisicing ex sit do aliquip eiusmod ad irure Lorem.\r\n",
        "time": 97.6548,
        "completed": true,
        "points": 15
      },
      {
        "name": "Albert Park",
        "id": "64a9f2c24500670fcc5f9cf5",
        "description": "Voluptate dolore aliquip labore irure fugiat aliqua velit exercitation aliquip nisi non exercitation commodo. Quis ea eu veniam do aliquip cupidatat in. Aliqua ut qui do occaecat adipisicing labore labore.\r\n",
        "time": 7.9128,
        "completed": true,
        "points": 91
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2cfed44bff7424719",
        "description": "Quis magna qui et excepteur cillum officia mollit. Exercitation id consequat elit dolor et mollit officia aute Lorem elit veniam ipsum consequat. Commodo esse excepteur fugiat fugiat officia aliqua cupidatat. Quis cillum labore sint anim cillum aliqua. Ipsum qui ut Lorem enim.\r\n",
        "time": 159.2074,
        "completed": true,
        "points": 38
      },
      {
        "name": "Orakei Korako Geothermal Park and Cave",
        "id": "64a9f2c21390ee567ffe7c98",
        "description": "Eiusmod veniam officia veniam ullamco laborum consequat voluptate enim incididunt sunt nostrud. Sunt ipsum non sit aliquip officia Lorem ullamco anim sit tempor veniam aliquip. Reprehenderit tempor aute dolore in. Cillum nulla laborum adipisicing Lorem quis nostrud laboris nostrud qui officia mollit esse non. Reprehenderit veniam veniam qui sint voluptate quis laborum exercitation fugiat ad sit. Adipisicing ullamco aliqua dolore et laboris tempor nisi dolore non minim.\r\n",
        "time": 149.7724,
        "completed": true,
        "points": 95
      },
      {
        "name": "Karekare",
        "id": "64a9f2c28c5bbdaf7e0aaa19",
        "description": "Irure laborum non anim incididunt aliqua dolor enim sunt dolor fugiat enim amet. Officia ut sit laborum excepteur aute cupidatat laborum ex magna. Aliqua enim culpa exercitation occaecat mollit exercitation labore. Ipsum culpa do proident labore fugiat eiusmod proident non est pariatur veniam laboris tempor. Et incididunt exercitation cillum et et eu eiusmod nulla cupidatat consectetur irure est. Amet fugiat exercitation tempor culpa est ad occaecat ad elit aute ut occaecat incididunt minim. Qui consectetur anim dolore Lorem.\r\n",
        "time": 123.4113,
        "completed": true,
        "points": 57
      },
      {
        "name": "Karekare",
        "id": "64a9f2c2541241f7feb1c497",
        "description": "Nulla veniam in exercitation officia ipsum ad aliqua eu labore ipsum adipisicing. Nostrud sunt ex voluptate occaecat aliquip irure sit esse mollit. Nostrud exercitation anim deserunt dolor proident ea et tempor. Irure sunt duis pariatur quis ex voluptate Lorem cupidatat consectetur veniam proident commodo. Nisi occaecat laboris est amet aliquip. Culpa reprehenderit nisi voluptate velit ipsum laborum magna irure ipsum.\r\n",
        "time": 101.3383,
        "completed": true,
        "points": 87
      },
      {
        "name": "Viaduct Harbour",
        "id": "64a9f2c23cf1883efb11085d",
        "description": "Adipisicing consectetur velit veniam culpa do. Incididunt proident ullamco Lorem Lorem cillum culpa veniam id magna qui laboris. Non minim incididunt nulla tempor in nisi aute cupidatat qui.\r\n",
        "time": 19.8875,
        "completed": true,
        "points": 90
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c2c77c37d422137c43",
        "description": "Irure proident excepteur exercitation aute ut aliquip commodo incididunt. Pariatur tempor labore elit do sunt incididunt qui eiusmod amet elit. Minim culpa dolore duis eiusmod consectetur est proident ex anim ut ex velit laborum tempor. Duis ex culpa ut sint eiusmod eu proident duis sint anim officia dolor.\r\n",
        "time": 171.1418,
        "completed": true,
        "points": 88
      }
    ]
  },
  {
    "id": "64a9f2c23a808a400709c7db",
    "name": "Angie Shaffer",
    "steps": 7725,
    "location": {
      "latitude": -36.89755,
      "longitude": -185.21226
    },
    "quests": [
      {
        "name": "Tiritiri Matangi Island",
        "id": "64a9f2c2303f687254fd2956",
        "description": "Cillum ex et labore aliquip velit sint laborum adipisicing dolore id dolor exercitation consectetur. Deserunt velit labore aute veniam dolore elit officia enim voluptate eiusmod ipsum laboris. Sint tempor incididunt ipsum non ipsum laborum irure pariatur. Officia cupidatat ex enim minim quis enim cupidatat occaecat ipsum incididunt labore anim qui. Anim eu adipisicing id consectetur. Cupidatat sunt ipsum cupidatat exercitation Lorem ea ullamco quis reprehenderit proident. Veniam id ea laborum eiusmod sunt adipisicing cupidatat incididunt fugiat deserunt est eu velit qui.\r\n",
        "time": 99.4082,
        "completed": true,
        "points": 48
      },
      {
        "name": "Auckland Zoo",
        "id": "64a9f2c2dc650385c139a86c",
        "description": "Duis sunt adipisicing consectetur exercitation ex. Anim aute aliqua ad Lorem in consectetur commodo culpa enim. Eiusmod dolore dolore mollit incididunt amet esse. Incididunt nostrud veniam voluptate Lorem deserunt pariatur deserunt occaecat non et fugiat reprehenderit in ex.\r\n",
        "time": 87.2802,
        "completed": true,
        "points": 65
      },
      {
        "name": "Cornwall Park",
        "id": "64a9f2c23ac6bd96decd836f",
        "description": "Est pariatur ullamco ea veniam proident laborum. Amet elit velit labore dolore dolor labore qui aute laboris quis aliqua cupidatat. Adipisicing fugiat eu occaecat consequat deserunt incididunt. Incididunt do non amet reprehenderit non ea ullamco dolor cupidatat dolor laborum. Id irure mollit tempor dolore. Fugiat sunt qui mollit pariatur veniam aliquip.\r\n",
        "time": 62.0398,
        "completed": true,
        "points": 41
      },
      {
        "name": "Auckland Art Gallery Toi o Tāmaki",
        "id": "64a9f2c2026aa4a9e59c998a",
        "description": "Dolore ea laborum tempor minim duis adipisicing officia laboris cillum eu exercitation sunt dolore. Eu voluptate proident adipisicing non in. Consectetur veniam id est anim deserunt et reprehenderit cillum sunt tempor.\r\n",
        "time": 115.509,
        "completed": true,
        "points": 65
      },
      {
        "name": "Sky Tower",
        "id": "64a9f2c2fce816addb067063",
        "description": "Tempor et nulla consectetur ut est aliqua reprehenderit Lorem sunt excepteur cillum fugiat aliqua nisi. Eiusmod mollit eiusmod excepteur aute. Consequat est laborum tempor nisi dolore deserunt occaecat duis adipisicing fugiat ea cupidatat do est. Tempor consectetur exercitation ut quis cupidatat. Enim Lorem nostrud proident occaecat veniam et tempor ullamco occaecat.\r\n",
        "time": 101.8174,
        "completed": true,
        "points": 55
      },
      {
        "name": "Kelly Tarlton's Sea Life Aquarium",
        "id": "64a9f2c28dc5feab230673da",
        "description": "Ea ea consequat velit proident dolore magna amet ullamco non proident sunt irure officia cillum. Labore consectetur dolor ullamco incididunt ex. Velit consequat Lorem aliquip officia aute consectetur nulla pariatur aliqua sit. Fugiat pariatur eu laboris nostrud eiusmod aliquip minim.\r\n",
        "time": 52.5768,
        "completed": true,
        "points": 49
      },
      {
        "name": "Kawau Island",
        "id": "64a9f2c2f110fb91f13c2f68",
        "description": "Duis est aliqua incididunt tempor ea incididunt et culpa qui velit laborum. Voluptate dolor dolor consequat pariatur proident do. Et proident magna non sint ut.\r\n",
        "time": 174.0193,
        "completed": true,
        "points": 63
      },
      {
        "name": "Ponsonby",
        "id": "64a9f2c2aa32ec34fcdbaa7c",
        "description": "Sint dolor labore minim mollit. Irure laboris dolore ad ea veniam amet laboris. Exercitation Lorem occaecat non deserunt exercitation in cillum consequat eiusmod deserunt velit incididunt. Aliquip deserunt aliquip dolore sit. Exercitation Lorem occaecat sunt cupidatat cupidatat Lorem anim culpa id reprehenderit ex anim.\r\n",
        "time": 124.0187,
        "completed": true,
        "points": 79
      }
    ]
  },
  {
    "id": "64a9f2c2f1d785d7ef296eff",
    "name": "Whitaker Dixon",
    "steps": 38643,
    "location": {
      "latitude": -36.89977,
      "longitude": -185.22898
    },
    "quests": [
      {
        "name": "Chelsea Sugar Factory",
        "id": "64a9f2c2b8a3c9168ce470ea",
        "description": "Nostrud fugiat dolore enim ut cupidatat id excepteur et pariatur laborum irure. Minim ad deserunt amet tempor culpa tempor amet incididunt consectetur ut. Eu labore consequat nostrud aliqua. Non eiusmod magna do reprehenderit et in.\r\n",
        "time": 118.5367,
        "completed": true,
        "points": 64
      },
      {
        "name": "Waiheke Island",
        "id": "64a9f2c2d8e9753396d55e6a",
        "description": "Sit excepteur laboris et incididunt quis qui fugiat cillum Lorem pariatur ad pariatur reprehenderit eu. Ex velit sit eiusmod labore consequat laborum ipsum qui aliquip magna fugiat do. Aliquip cupidatat irure eu sit qui ad aute sit.\r\n",
        "time": 30.9886,
        "completed": true,
        "points": 71
      },
      {
        "name": "Western Springs",
        "id": "64a9f2c2e652d770c2227754",
        "description": "Incididunt mollit ad nulla ex qui proident do ex irure ea non et qui. Laboris labore et laborum nulla nostrud adipisicing magna exercitation cupidatat pariatur incididunt ut excepteur. Do commodo minim consequat quis dolore ad sint est adipisicing ea irure id. Nostrud esse non laboris velit non reprehenderit ex do non ullamco magna sit. Id id elit tempor ad voluptate pariatur officia aliqua ut incididunt exercitation duis id. Elit in incididunt consectetur voluptate culpa culpa elit mollit enim sunt.\r\n",
        "time": 88.6475,
        "completed": true,
        "points": 53
      },
      {
        "name": "Hunua Falls",
        "id": "64a9f2c2bb1d9d88063050b0",
        "description": "Nostrud fugiat in nisi elit veniam ad irure Lorem id laboris aliqua consequat. Amet exercitation velit magna ullamco cupidatat quis eiusmod aute consequat. Cupidatat nostrud non do do dolor sit eu anim eu tempor cillum quis.\r\n",
        "time": 143.9201,
        "completed": true,
        "points": 53
      },
      {
        "name": "Westfield Newmarket",
        "id": "64a9f2c238902292b544e053",
        "description": "Duis nisi culpa elit occaecat nisi ad velit labore labore id nisi amet velit id. Cupidatat culpa elit quis proident nostrud in aliqua commodo veniam elit voluptate et tempor. Deserunt veniam proident dolore esse minim. Magna esse sit reprehenderit qui ad Lorem est est consequat magna elit. Aliquip ex qui aliquip sit exercitation consequat cillum in laborum nulla sunt. Commodo consequat consequat nulla aliquip pariatur mollit proident.\r\n",
        "time": 155.2354,
        "completed": true,
        "points": 83
      },
      {
        "name": "Omana Regional Park",
        "id": "64a9f2c22a555b0791726282",
        "description": "Mollit exercitation aute proident velit tempor sunt occaecat laborum anim commodo voluptate. Incididunt pariatur laboris officia magna in velit consectetur voluptate id. Commodo elit dolor cupidatat dolor tempor eiusmod mollit et. Nulla commodo reprehenderit elit eiusmod nostrud pariatur esse anim veniam. Eiusmod exercitation nulla fugiat officia anim amet irure anim culpa adipisicing sit dolor. Ipsum duis quis officia dolore nostrud cupidatat sunt ut esse excepteur. Quis cillum officia ad id exercitation ea eu.\r\n",
        "time": 53.6916,
        "completed": true,
        "points": 55
      },
      {
        "name": "Karekare",
        "id": "64a9f2c2c817b6e911d0e49f",
        "description": "Nulla adipisicing non occaecat cillum aliquip ut adipisicing. Aute laborum sit enim do eiusmod labore amet aute labore. Ad irure voluptate do irure. Exercitation aliqua ad ea eiusmod id labore veniam aliqua et irure. Magna voluptate duis qui exercitation aute deserunt id adipisicing eiusmod incididunt nostrud nisi. Mollit ea cillum magna irure reprehenderit cupidatat fugiat laboris. Quis laborum laboris occaecat fugiat tempor qui esse magna irure.\r\n",
        "time": 152.9021,
        "completed": true,
        "points": 93
      },
      {
        "name": "Parnell",
        "id": "64a9f2c268f0b64ae15f2e82",
        "description": "Deserunt ut in proident eu in duis incididunt enim magna. Dolor mollit sunt Lorem cillum mollit. Exercitation quis duis ipsum excepteur amet exercitation aliqua pariatur enim nostrud mollit. Nulla commodo nulla adipisicing occaecat ullamco elit magna. Ad ea veniam nostrud aliqua cupidatat dolor est anim eu pariatur reprehenderit laborum.\r\n",
        "time": 11.0004,
        "completed": true,
        "points": 60
      },
      {
        "name": "Auckland Bridge Climb",
        "id": "64a9f2c2d04a57d2db06ddb1",
        "description": "Cupidatat sunt elit ut reprehenderit. Adipisicing est Lorem irure veniam sunt minim in. In aliqua veniam quis magna ex consequat magna in amet labore quis cupidatat cillum. Consectetur amet ad exercitation fugiat consectetur laborum. In culpa et culpa in Lorem qui esse magna. Aliqua mollit do nulla sint aliquip cupidatat eu irure in. Adipisicing commodo fugiat cupidatat veniam reprehenderit incididunt laboris ipsum pariatur culpa voluptate incididunt.\r\n",
        "time": 193.7834,
        "completed": true,
        "points": 96
      },
      {
        "name": "Parnell",
        "id": "64a9f2c20d9a333da17f00aa",
        "description": "Nisi est tempor labore eu. Irure occaecat ea ipsum aute ex qui aliqua sint consequat ipsum. Quis amet dolor ipsum officia in ex ex enim non enim consectetur et dolor. Eu sint dolore voluptate minim minim do ullamco in aliquip esse laborum magna sunt tempor.\r\n",
        "time": 193.7113,
        "completed": true,
        "points": 34
      }
    ]
  }
]